/**
 * Copyright (c) 2018-2019 FAUCHER Julien & FRANCE Loic
 * This file is part of SooL.
 *
 *  SooL is free software: you can redistribute it and/or modify
 *  it under the terms of the GNU Lesser General Public License
 *  as published by the Free Software Foundation, either version 3
 *  of the License, or (at your option) any later version.
 *
 *  SooL is distributed in the hope that it will be useful,
 *  but WITHOUT ANY WARRANTY; without even the implied warranty of
 *  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
 *  GNU Lesser General Public License for more details.
 *
 *  You should have received a copy of the GNU Lesser General Public License
 *  along with SooL. If not, see <https://www.gnu.org/licenses/>.
 */
#ifndef __SOOL_ADC_H
#define __SOOL_ADC_H

#include "lib_utils/peripheral_include.h"
#include "RCC.h"

//region defines

#if defined(STM32F301x8 ) || defined(STM32F302x8 ) || defined(STM32F302xC ) || defined(STM32F302xE ) ||\
    defined(STM32F303x8 ) || defined(STM32F303xC ) || defined(STM32F303xE ) || defined(STM32F318xx ) ||\
    defined(STM32F328xx ) || defined(STM32F334x8 ) || defined(STM32F358xx ) || defined(STM32F398xx ) ||\
    defined(STM32H7     ) || defined(STM32L4     ) || defined(STM32L4P    ) 
#define ADC_AWD2CR
#define ADC_AWD3CR
#define ADC_CFGR
#define ADC_CR_0_JADSTART    JADSTART             // 1 bits @ 3
#define ADC_CR_0_JADSTP      JADSTP               // 1 bits @ 5

#define ADC34_CSR_0_ADRDY_EOS_MST ADRDY_EOS_MST        // 1 bits @ 3
#define ADC34_CSR_0_ADRDY_OVR_MST ADRDY_OVR_MST        // 1 bits @ 4
#define ADC34_CSR_0_ADRDY_JEOC_MST ADRDY_JEOC_MST       // 1 bits @ 5
#define ADC34_CSR_0_ADRDY_JEOS_MST ADRDY_JEOS_MST       // 1 bits @ 6
#define ADC34_CSR_0_AWD1_MST AWD1_MST             // 1 bits @ 7
#define ADC34_CSR_0_AWD2_MST AWD2_MST             // 1 bits @ 8
#define ADC34_CSR_0_AWD3_MST AWD3_MST             // 1 bits @ 9
#define ADC34_CSR_0_ADRDY_EOSMP_SLV ADRDY_EOSMP_SLV      // 1 bits @ 17
#define ADC34_CSR_0_ADRDY_EOC_SLV ADRDY_EOC_SLV        // 1 bits @ 18
#define ADC34_CSR_0_ADRDY_EOS_SLV ADRDY_EOS_SLV        // 1 bits @ 19
#define ADC34_CSR_0_ADRDY_JEOC_SLV ADRDY_JEOC_SLV       // 1 bits @ 21
#define ADC34_CSR_0_ADRDY_JEOS_SLV ADRDY_JEOS_SLV       // 1 bits @ 22
#define ADC34_CSR_0_AWD1_SLV AWD1_SLV             // 1 bits @ 23
#define ADC34_CSR_0_AWD2_SLV AWD2_SLV             // 1 bits @ 24
#define ADC34_CSR_0_AWD3_SLV AWD3_SLV             // 1 bits @ 25
#else
#define ADC34_CSR_0_ADRDY_EOSMP_MST
#define ADC34_CSR_0_ADRDY_EOC_MST
#define ADC34_CSR_0_ADRDY_EOS_MST
#define ADC34_CSR_0_ADRDY_OVR_MST
#define ADC34_CSR_0_ADRDY_JEOC_MST
#define ADC34_CSR_0_ADRDY_JEOS_MST
#define ADC34_CSR_0_AWD1_MST
#define ADC34_CSR_0_AWD2_MST
#define ADC34_CSR_0_AWD3_MST
#define ADC34_CSR_0_ADRDY_EOSMP_SLV
#define ADC34_CSR_0_ADRDY_EOC_SLV
#define ADC34_CSR_0_ADRDY_EOS_SLV
#define ADC34_CSR_0_ADRDY_JEOC_SLV
#define ADC34_CSR_0_ADRDY_JEOS_SLV
#define ADC34_CSR_0_AWD1_SLV
#define ADC34_CSR_0_AWD2_SLV
#define ADC34_CSR_0_AWD3_SLV
#endif

#if defined(STM32F2     ) || defined(STM32F301x8 ) || defined(STM32F302x8 ) || defined(STM32F302xC ) ||\
    defined(STM32F302xE ) || defined(STM32F303x8 ) || defined(STM32F303xC ) || defined(STM32F303xE ) ||\
    defined(STM32F318xx ) || defined(STM32F328xx ) || defined(STM32F334x8 ) || defined(STM32F358xx ) ||\
    defined(STM32F398xx ) || defined(STM32F405xx ) || defined(STM32F407xx ) || defined(STM32F415xx ) ||\
    defined(STM32F417xx ) || defined(STM32F427xx ) || defined(STM32F429xx ) || defined(STM32F437xx ) ||\
    defined(STM32F439xx ) || defined(STM32F446xx ) || defined(STM32F469xx ) || defined(STM32F479xx ) ||\
    defined(STM32F7     ) || defined(STM32H7     ) || defined(STM32L471xx ) || defined(STM32L475xx ) ||\
    defined(STM32L476xx ) || defined(STM32L485xx ) || defined(STM32L486xx ) || defined(STM32L496xx ) ||\
    defined(STM32L4A6xx ) 
#define ADC123_CSR_0
#endif

#if defined(STM32F301x8 ) || defined(STM32F302x8 ) || defined(STM32F302xC ) || defined(STM32F302xE ) ||\
    defined(STM32F303x8 ) || defined(STM32F303xC ) || defined(STM32F303xE ) || defined(STM32F318xx ) ||\
    defined(STM32F328xx ) || defined(STM32F334x8 ) || defined(STM32F358xx ) || defined(STM32F398xx ) ||\
    defined(STM32L0     ) || defined(STM32L4     ) || defined(STM32L4P    ) 
#define ADC_MAP0_CALFACT     CALFACT_TypeDef CALFACT
#else
#define ADC_MAP0_CALFACT __SOOL_PERIPH_PADDING_4
#endif

//endregion

namespace sool
{
	namespace core
	{
		class ADC
		{
			
			
			public :
			
			#ifdef ADC_AWD2CR
			struct AWD2CR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					#ifdef ADC_AWD2CR_0
					struct
					{
						uint32_t AWD2CH               :19;
						uint32_t                      :13;
					};
					#endif
					#ifdef ADC_AWD2CR_1
					struct
					{
						uint32_t AWD2CH               :20;
						uint32_t                      :12;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef ADC_AWD3CR
			struct AWD3CR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					#ifdef ADC_AWD3CR_0
					struct
					{
						uint32_t AWD3CH               :19;
						uint32_t                      :13;
					};
					#endif
					#ifdef ADC_AWD3CR_1
					struct
					{
						uint32_t AWD3CH               :20;
						uint32_t                      :12;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef ADC_CALFACT
			struct CALFACT_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					#ifdef ADC_CALFACT_0
					struct
					{
						uint32_t S                    :7;
						uint32_t                      :9;
						uint32_t D                    :7;
						uint32_t                      :9;
					};
					#endif
					#ifdef ADC_CALFACT_1
					struct
					{
						uint32_t S                    :11;
						uint32_t                      :5;
						uint32_t D                    :11;
						uint32_t                      :5;
					};
					#endif
					#ifdef ADC_CALFACT_2
					struct
					{
						uint32_t CALFACT              :7;
						uint32_t                      :25;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef ADC_CALFACT2
			struct CALFACT2_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t LINCALFACT           :30;
					uint32_t                      :2;
			
				
			};
			#endif
			
			#ifdef ADC_CFGR
			struct CFGR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					struct
					{
						uint32_t ADC_CFGR_0_DMAEN     :1;
						uint32_t ADC_CFGR_0_DMACFG    :1;
						uint32_t ADC_CFGR_0_DFSDMCFG  :1;
						uint32_t ADC_CFGR_0_RES       :2;
						uint32_t ADC_CFGR_0_ALIGN     :1;
						uint32_t ADC_CFGR_0_EXTSEL    :4;
						uint32_t EXTEN                :2;
						uint32_t OVRMOD               :1;
						uint32_t CONT                 :1;
						uint32_t AUTDLY               :1;
						uint32_t ADC_CFGR_0_AUTOFF    :1;
						uint32_t DISCEN               :1;
						uint32_t DISCNUM              :3;
						uint32_t JDISCEN              :1;
						uint32_t JQM                  :1;
						uint32_t AWD1SGL              :1;
						uint32_t AWD1EN               :1;
						uint32_t JAWD1EN              :1;
						uint32_t JAUTO                :1;
						uint32_t AWD1CH               :5;
						uint32_t ADC_CFGR_0_JQDIS     :1;
					};
					#ifdef ADC_CFGR_1
					struct
					{
						uint32_t DMNGT                :2;
						uint32_t RES                  :3;
						uint32_t EXTSEL               :5;
						uint32_t                      :22;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef ADC_CFGR1
			struct CFGR1_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					struct
					{
						uint32_t DMAEN                :1;
						uint32_t DMACFG               :1;
						uint32_t SCANDIR              :1;
						uint32_t RES                  :2;
						uint32_t ALIGN                :1;
						uint32_t EXTSEL               :3;
						uint32_t                      :1;
						uint32_t EXTEN                :2;
						uint32_t OVRMOD               :1;
						uint32_t CONT                 :1;
						uint32_t WAIT                 :1;
						uint32_t AUTOFF               :1;
						uint32_t DISCEN               :1;
						uint32_t                      :5;
						uint32_t ADC_CFGR1_0_AWD1SGL  :1;
						uint32_t ADC_CFGR1_0_AWD1EN   :1;
						uint32_t                      :2;
						uint32_t ADC_CFGR1_0_AWD1CH   :5;
						uint32_t                      :1;
					};
					struct
					{
						uint32_t                      :14;
						uint32_t ADC_CFGR1_1_AUTDLY   :1;
						uint32_t                      :7;
						uint32_t AWDSGL               :1;
						uint32_t AWDEN                :1;
						uint32_t                      :2;
						uint32_t AWDCH                :5;
						uint32_t                      :1;
					};
				};
				
			};
			#endif
			
			#ifdef ADC_CFGR2
			struct CFGR2_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					struct
					{
						uint32_t ADC_CFGR2_0_ROVSE    :1;
						uint32_t ADC_CFGR2_0_JOVSE    :1;
						uint32_t ADC_CFGR2_0_OVSR     :3;
						uint32_t ADC_CFGR2_0_OVSS     :4;
						uint32_t ADC_CFGR2_0_TROVS    :1;
						uint32_t ADC_CFGR2_0_ROVSM    :1;
						uint32_t ADC_CFGR2_0_RSHIFT1  :1;
						uint32_t ADC_CFGR2_0_RSHIFT2  :1;
						uint32_t ADC_CFGR2_0_RSHIFT3  :1;
						uint32_t ADC_CFGR2_0_RSHIFT4  :1;
						uint32_t                      :1;
						uint32_t ADC_CFGR2_0_OSR      :10;
						uint32_t                      :4;
						uint32_t ADC_CFGR2_0_CKMODE   :2;
					};
					#ifdef ADC_CFGR2_1
					struct
					{
						uint32_t ADC_CFGR2_1_OVSE     :1;
						uint32_t                      :8;
						uint32_t ADC_CFGR2_1_TOVS     :1;
						uint32_t                      :18;
						uint32_t ADC_CFGR2_1_LSHIFT   :4;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef ADC_CHSELR
			struct CHSELR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					struct
					{
						uint32_t CHSEL                :19;
						uint32_t                      :13;
					};
					struct
					{
						uint32_t CHSEL0               :1;
						uint32_t CHSEL1               :1;
						uint32_t CHSEL2               :1;
						uint32_t CHSEL3               :1;
						uint32_t CHSEL4               :1;
						uint32_t CHSEL5               :1;
						uint32_t CHSEL6               :1;
						uint32_t CHSEL7               :1;
						uint32_t CHSEL8               :1;
						uint32_t CHSEL9               :1;
						uint32_t CHSEL10              :1;
						uint32_t CHSEL11              :1;
						uint32_t CHSEL12              :1;
						uint32_t CHSEL13              :1;
						uint32_t CHSEL14              :1;
						uint32_t CHSEL15              :1;
						uint32_t ADC_CHSELR_1_CHSEL16 :1;
						uint32_t CHSEL17              :1;
						uint32_t CHSEL18              :1;
						uint32_t                      :13;
					};
				};
				
			};
			#endif
			
			#ifdef ADC_CR
			struct CR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					struct
					{
						uint32_t ADEN                 :1;
						uint32_t ADDIS                :1;
						uint32_t ADSTART              :1;
						uint32_t ADC_CR_0_JADSTART    :1;
						uint32_t ADSTP                :1;
						uint32_t ADC_CR_0_JADSTP      :1;
						uint32_t                      :2;
						uint32_t ADC_CR_0_BOOST       :1;
						uint32_t                      :7;
						uint32_t ADC_CR_0_ADCALLIN    :1;
						uint32_t                      :5;
						uint32_t ADC_CR_0_LINCALRDYW1 :1;
						uint32_t ADC_CR_0_LINCALRDYW2 :1;
						uint32_t ADC_CR_0_LINCALRDYW3 :1;
						uint32_t ADC_CR_0_LINCALRDYW4 :1;
						uint32_t ADC_CR_0_LINCALRDYW5 :1;
						uint32_t ADC_CR_0_LINCALRDYW6 :1;
						uint32_t ADC_CR_0_ADVREGEN    :2;
						uint32_t ADC_CR_0_ADCALDIF    :1;
						uint32_t ADCAL                :1;
					};
					#ifdef ADC_CR_1
					struct
					{
						uint32_t                      :28;
						uint32_t ADVREGEN             :1;
						uint32_t ADC_CR_1_DEEPPWD     :1;
						uint32_t                      :2;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef ADC_CR1
			struct CR1_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					struct
					{
						uint32_t AWDCH                :5;
						uint32_t ADC_CR1_0_EOSIE      :1;
						uint32_t AWDIE                :1;
						uint32_t ADC_CR1_0_JEOSIE     :1;
						uint32_t SCAN                 :1;
						uint32_t AWDSGL               :1;
						uint32_t JAUTO                :1;
						uint32_t DISCEN               :1;
						uint32_t JDISCEN              :1;
						uint32_t DISCNUM              :3;
						uint32_t ADC_CR1_0_DUALMOD    :4;
						uint32_t                      :2;
						uint32_t JAWDEN               :1;
						uint32_t AWDEN                :1;
						uint32_t ADC_CR1_0_RES        :2;
						uint32_t ADC_CR1_0_OVRIE      :1;
						uint32_t                      :5;
					};
					struct
					{
						uint32_t                      :5;
						uint32_t EOCIE                :1;
						uint32_t                      :1;
						uint32_t JEOCIE               :1;
						uint32_t                      :8;
						uint32_t ADC_CR1_1_PDD        :1;
						uint32_t ADC_CR1_1_PDI        :1;
						uint32_t                      :14;
					};
					#ifdef ADC_CR1_2
					struct
					{
						uint32_t                      :5;
						uint32_t EOCSIE               :1;
						uint32_t                      :26;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef ADC_CR2
			struct CR2_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					struct
					{
						uint32_t ADON                 :1;
						uint32_t CONT                 :1;
						uint32_t ADC_CR2_0_CAL        :1;
						uint32_t ADC_CR2_0_RSTCAL     :1;
						uint32_t ADC_CR2_0_DELS       :3;
						uint32_t                      :1;
						uint32_t DMA                  :1;
						uint32_t ADC_CR2_0_DDS        :1;
						uint32_t ADC_CR2_0_EOCS       :1;
						uint32_t ALIGN                :1;
						uint32_t ADC_CR2_0_JEXTSEL    :3;
						uint32_t ADC_CR2_0_JEXTTRIG   :1;
						uint32_t                      :1;
						uint32_t ADC_CR2_0_EXTSEL     :3;
						uint32_t ADC_CR2_0_EXTTRIG    :1;
						uint32_t ADC_CR2_0_JSWSTART   :1;
						uint32_t ADC_CR2_0_SWSTART    :1;
						uint32_t ADC_CR2_0_TSVREFE    :1;
						uint32_t                      :4;
						uint32_t ADC_CR2_0_EXTEN      :2;
						uint32_t                      :2;
					};
					#ifdef ADC_CR2_1
					struct
					{
						uint32_t                      :2;
						uint32_t ADC_CR2_1_CFG        :1;
						uint32_t                      :13;
						uint32_t JEXTSEL              :4;
						uint32_t JEXTEN               :2;
						uint32_t JSWSTART             :1;
						uint32_t                      :1;
						uint32_t EXTSEL               :4;
						uint32_t                      :2;
						uint32_t SWSTART              :1;
						uint32_t                      :1;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef ADC_DIFSEL
			struct DIFSEL_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					struct
					{
						uint32_t ADC_DIFSEL_0_DIFSEL  :19;
						uint32_t ADC_DIFSEL_0_DIFSEL19 :1;
						uint32_t                      :12;
					};
					struct
					{
						uint32_t DIFSEL0              :1;
						uint32_t DIFSEL1              :1;
						uint32_t DIFSEL2              :1;
						uint32_t DIFSEL3              :1;
						uint32_t DIFSEL4              :1;
						uint32_t DIFSEL5              :1;
						uint32_t DIFSEL6              :1;
						uint32_t DIFSEL7              :1;
						uint32_t DIFSEL8              :1;
						uint32_t DIFSEL9              :1;
						uint32_t DIFSEL10             :1;
						uint32_t DIFSEL11             :1;
						uint32_t DIFSEL12             :1;
						uint32_t DIFSEL13             :1;
						uint32_t DIFSEL14             :1;
						uint32_t DIFSEL15             :1;
						uint32_t DIFSEL16             :1;
						uint32_t DIFSEL17             :1;
						uint32_t DIFSEL18             :1;
						uint32_t                      :13;
					};
					#ifdef ADC_DIFSEL_2
					struct
					{
						uint32_t DIFSEL               :20;
						uint32_t                      :12;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef ADC_DR
			struct DR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					#ifdef ADC_DR_0
					struct
					{
						uint32_t DATA                 :16;
						uint32_t ADC_DR_0_ADC2DATA    :16;
					};
					#endif
					#ifdef ADC_DR_1
					struct
					{
						uint32_t RDATA                :16;
						uint32_t                      :16;
					};
					#endif
					#ifdef ADC_DR_2
					struct
					{
						uint32_t RDATA                :32;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef ADC_HTR
			struct HTR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					#ifdef ADC_HTR_0
					struct
					{
						uint32_t                      :16;
						uint32_t HT                   :12;
						uint32_t                      :4;
					};
					#endif
					struct
					{
						uint32_t HT                   :12;
						uint32_t                      :20;
					};
				};
				
			};
			#endif
			
			#ifdef ADC_HTR1
			struct HTR1_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t HT1                  :26;
					uint32_t                      :6;
			
				
			};
			#endif
			
			#ifdef ADC_HTR2
			struct HTR2_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t HT2                  :26;
					uint32_t                      :6;
			
				
			};
			#endif
			
			#ifdef ADC_HTR3
			struct HTR3_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t HT3                  :26;
					uint32_t                      :6;
			
				
			};
			#endif
			
			#ifdef ADC_IER
			struct IER_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					#ifdef ADC_IER_0
					struct
					{
						uint32_t ADRDYIE              :1;
						uint32_t EOSMPIE              :1;
						uint32_t EOCIE                :1;
						uint32_t ADC_IER_0_EOSIE      :1;
						uint32_t OVRIE                :1;
						uint32_t ADC_IER_0_JEOCIE     :1;
						uint32_t ADC_IER_0_JEOSIE     :1;
						uint32_t ADC_IER_0_AWD1IE     :1;
						uint32_t ADC_IER_0_AWD2IE     :1;
						uint32_t ADC_IER_0_AWD3IE     :1;
						uint32_t ADC_IER_0_JQOVFIE    :1;
						uint32_t ADC_IER_0_EOCALIE    :1;
						uint32_t                      :20;
					};
					#endif
					struct
					{
						uint32_t ADC_IER_1_RDY        :1;
						uint32_t ADC_IER_1_EOSMP      :1;
						uint32_t ADC_IER_1_EOC        :1;
						uint32_t ADC_IER_1_EOSEQIE    :1;
						uint32_t ADC_IER_1_OVR        :1;
						uint32_t ADC_IER_1_JEOC       :1;
						uint32_t ADC_IER_1_JEOS       :1;
						uint32_t ADC_IER_1_AWDIE      :1;
						uint32_t ADC_IER_1_AWD2       :1;
						uint32_t ADC_IER_1_AWD3       :1;
						uint32_t ADC_IER_1_JQOVF      :1;
						uint32_t                      :21;
					};
					#ifdef ADC_IER_2
					struct
					{
						uint32_t ADC_IER_2_ADRDY      :1;
						uint32_t                      :2;
						uint32_t EOS                  :1;
						uint32_t                      :3;
						uint32_t AWD1                 :1;
						uint32_t                      :24;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef ADC_ISR
			struct ISR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					struct
					{
						uint32_t ADC_ISR_0_ADRDY      :1;
						uint32_t EOSMP                :1;
						uint32_t EOC                  :1;
						uint32_t ADC_ISR_0_EOS        :1;
						uint32_t OVR                  :1;
						uint32_t ADC_ISR_0_JEOC       :1;
						uint32_t ADC_ISR_0_JEOS       :1;
						uint32_t ADC_ISR_0_AWD1       :1;
						uint32_t ADC_ISR_0_AWD2       :1;
						uint32_t ADC_ISR_0_AWD3       :1;
						uint32_t ADC_ISR_0_JQOVF      :1;
						uint32_t ADC_ISR_0_EOCAL      :1;
						uint32_t                      :20;
					};
					#ifdef ADC_ISR_1
					struct
					{
						uint32_t ADC_ISR_1_ADRD       :1;
						uint32_t                      :2;
						uint32_t ADC_ISR_1_EOSEQ      :1;
						uint32_t                      :3;
						uint32_t ADC_ISR_1_AWD        :1;
						uint32_t                      :24;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef ADC_JDR1
			struct JDR1_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					#ifdef ADC_JDR1_0
					struct
					{
						uint32_t JDATA                :16;
						uint32_t                      :16;
					};
					#endif
					#ifdef ADC_JDR1_1
					struct
					{
						uint32_t JDATA                :32;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef ADC_JDR2
			struct JDR2_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					#ifdef ADC_JDR2_0
					struct
					{
						uint32_t JDATA                :16;
						uint32_t                      :16;
					};
					#endif
					#ifdef ADC_JDR2_1
					struct
					{
						uint32_t JDATA                :32;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef ADC_JDR3
			struct JDR3_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					#ifdef ADC_JDR3_0
					struct
					{
						uint32_t JDATA                :16;
						uint32_t                      :16;
					};
					#endif
					#ifdef ADC_JDR3_1
					struct
					{
						uint32_t JDATA                :32;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef ADC_JDR4
			struct JDR4_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					#ifdef ADC_JDR4_0
					struct
					{
						uint32_t JDATA                :16;
						uint32_t                      :16;
					};
					#endif
					#ifdef ADC_JDR4_1
					struct
					{
						uint32_t JDATA                :32;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef ADC_JOFR1
			struct JOFR1_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t JOFFSET1             :12;
					uint32_t                      :20;
			
				
			};
			#endif
			
			#ifdef ADC_JOFR2
			struct JOFR2_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t JOFFSET2             :12;
					uint32_t                      :20;
			
				
			};
			#endif
			
			#ifdef ADC_JOFR3
			struct JOFR3_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t JOFFSET3             :12;
					uint32_t                      :20;
			
				
			};
			#endif
			
			#ifdef ADC_JOFR4
			struct JOFR4_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t JOFFSET4             :12;
					uint32_t                      :20;
			
				
			};
			#endif
			
			#ifdef ADC_JSQR
			struct JSQR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					#ifdef ADC_JSQR_0
					struct
					{
						uint32_t JSQ1                 :5;
						uint32_t JSQ2                 :5;
						uint32_t JSQ3                 :5;
						uint32_t JSQ4                 :5;
						uint32_t JL                   :2;
						uint32_t                      :10;
					};
					#endif
					#ifdef ADC_JSQR_1
					struct
					{
						uint32_t JL                   :2;
						uint32_t ADC_JSQR_1_JEXTSEL   :4;
						uint32_t ADC_JSQR_1_JEXTEN    :2;
						uint32_t ADC_JSQR_1_JSQ1      :5;
						uint32_t                      :1;
						uint32_t ADC_JSQR_1_JSQ2      :5;
						uint32_t                      :1;
						uint32_t ADC_JSQR_1_JSQ3      :5;
						uint32_t                      :1;
						uint32_t ADC_JSQR_1_JSQ4      :5;
						uint32_t                      :1;
					};
					#endif
					#ifdef ADC_JSQR_2
					struct
					{
						uint32_t                      :2;
						uint32_t JEXTSEL              :5;
						uint32_t JEXTEN               :2;
						uint32_t JSQ1                 :5;
						uint32_t                      :1;
						uint32_t JSQ2                 :5;
						uint32_t                      :1;
						uint32_t JSQ3                 :5;
						uint32_t                      :1;
						uint32_t JSQ4                 :5;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef ADC_LTR
			struct LTR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t LT                   :12;
					uint32_t                      :20;
			
				
			};
			#endif
			
			#ifdef ADC_LTR1
			struct LTR1_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t LT1                  :26;
					uint32_t                      :6;
			
				
			};
			#endif
			
			#ifdef ADC_LTR2
			struct LTR2_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t LT2                  :26;
					uint32_t                      :6;
			
				
			};
			#endif
			
			#ifdef ADC_LTR3
			struct LTR3_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t LT3                  :26;
					uint32_t                      :6;
			
				
			};
			#endif
			
			#ifdef ADC_OFR1
			struct OFR1_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					struct
					{
						uint32_t ADC_OFR1_0_OFFSET1   :12;
						uint32_t                      :19;
						uint32_t ADC_OFR1_0_SSATE     :1;
					};
					#ifdef ADC_OFR1_1
					struct
					{
						uint32_t OFFSET1              :26;
						uint32_t                      :6;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef ADC_OFR2
			struct OFR2_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					struct
					{
						uint32_t ADC_OFR2_0_OFFSET2   :12;
						uint32_t                      :19;
						uint32_t ADC_OFR2_0_SSATE     :1;
					};
					#ifdef ADC_OFR2_1
					struct
					{
						uint32_t OFFSET2              :26;
						uint32_t                      :6;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef ADC_OFR3
			struct OFR3_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					struct
					{
						uint32_t ADC_OFR3_0_OFFSET3   :12;
						uint32_t                      :19;
						uint32_t ADC_OFR3_0_SSATE     :1;
					};
					#ifdef ADC_OFR3_1
					struct
					{
						uint32_t OFFSET3              :26;
						uint32_t                      :6;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef ADC_OFR4
			struct OFR4_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					struct
					{
						uint32_t ADC_OFR4_0_OFFSET4   :12;
						uint32_t                      :19;
						uint32_t ADC_OFR4_0_SSATE     :1;
					};
					#ifdef ADC_OFR4_1
					struct
					{
						uint32_t OFFSET4              :26;
						uint32_t                      :6;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef ADC_PCSEL
			struct PCSEL_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					struct
					{
						uint32_t PCSEL                :20;
						uint32_t                      :12;
					};
					struct
					{
						uint32_t PCSEL0               :1;
						uint32_t PCSEL1               :1;
						uint32_t PCSEL2               :1;
						uint32_t PCSEL3               :1;
						uint32_t PCSEL4               :1;
						uint32_t PCSEL5               :1;
						uint32_t PCSEL6               :1;
						uint32_t PCSEL7               :1;
						uint32_t PCSEL8               :1;
						uint32_t PCSEL9               :1;
						uint32_t PCSEL10              :1;
						uint32_t PCSEL11              :1;
						uint32_t PCSEL12              :1;
						uint32_t PCSEL13              :1;
						uint32_t PCSEL14              :1;
						uint32_t PCSEL15              :1;
						uint32_t PCSEL16              :1;
						uint32_t PCSEL17              :1;
						uint32_t PCSEL18              :1;
						uint32_t PCSEL19              :1;
						uint32_t                      :12;
					};
				};
				
			};
			#endif
			
			#ifdef ADC_SMPR
			struct SMPR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					struct
					{
						uint32_t SMP                  :3;
						uint32_t                      :29;
					};
					#ifdef ADC_SMPR_1
					struct
					{
						uint32_t SMPR                 :3;
						uint32_t                      :29;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef ADC_SMPR0
			struct SMPR0_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t SMP30                :3;
					uint32_t SMP31                :3;
					uint32_t                      :26;
			
				
			};
			#endif
			
			#ifdef ADC_SMPR1
			struct SMPR1_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					#ifdef ADC_SMPR1_0
					struct
					{
						uint32_t ADC_SMPR1_0_SMPR     :3;
						uint32_t ADC_SMPR1_0_SMP11    :3;
						uint32_t ADC_SMPR1_0_SMP12    :3;
						uint32_t ADC_SMPR1_0_SMP13    :3;
						uint32_t ADC_SMPR1_0_SMP14    :3;
						uint32_t ADC_SMPR1_0_SMP15    :3;
						uint32_t ADC_SMPR1_0_SMP16    :3;
						uint32_t ADC_SMPR1_0_SMP17    :3;
						uint32_t ADC_SMPR1_0_SMP18    :3;
						uint32_t ADC_SMPR1_0_SMP9     :3;
						uint32_t                      :1;
						uint32_t ADC_SMPR1_0_SMPPLUS  :1;
					};
					#endif
					#ifdef ADC_SMPR1_1
					struct
					{
						uint32_t ADC_SMPR1_1_SMP10    :3;
						uint32_t ADC_SMPR1_1_SMP1     :3;
						uint32_t ADC_SMPR1_1_SMP2     :3;
						uint32_t ADC_SMPR1_1_SMP3     :3;
						uint32_t ADC_SMPR1_1_SMP4     :3;
						uint32_t ADC_SMPR1_1_SMP5     :3;
						uint32_t ADC_SMPR1_1_SMP6     :3;
						uint32_t ADC_SMPR1_1_SMP7     :3;
						uint32_t ADC_SMPR1_1_SMP8     :3;
						uint32_t ADC_SMPR1_1_SMP29    :3;
						uint32_t                      :2;
					};
					#endif
					#ifdef ADC_SMPR1_2
					struct
					{
						uint32_t ADC_SMPR1_2_SMP0     :3;
						uint32_t ADC_SMPR1_2_SMP21    :3;
						uint32_t ADC_SMPR1_2_SMP22    :3;
						uint32_t ADC_SMPR1_2_SMP23    :3;
						uint32_t ADC_SMPR1_2_SMP24    :3;
						uint32_t ADC_SMPR1_2_SMP25    :3;
						uint32_t ADC_SMPR1_2_SMP26    :3;
						uint32_t ADC_SMPR1_2_SMP27    :3;
						uint32_t ADC_SMPR1_2_SMP28    :3;
						uint32_t                      :5;
					};
					#endif
					#ifdef ADC_SMPR1_3
					struct
					{
						uint32_t SMP20                :3;
						uint32_t                      :29;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef ADC_SMPR2
			struct SMPR2_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					#ifdef ADC_SMPR2_0
					struct
					{
						uint32_t SMP0                 :3;
						uint32_t SMP1                 :3;
						uint32_t SMP2                 :3;
						uint32_t SMP3                 :3;
						uint32_t SMP4                 :3;
						uint32_t SMP5                 :3;
						uint32_t SMP6                 :3;
						uint32_t SMP7                 :3;
						uint32_t SMP8                 :3;
						uint32_t SMP9                 :3;
						uint32_t                      :2;
					};
					#endif
					#ifdef ADC_SMPR2_1
					struct
					{
						uint32_t SMP10                :3;
						uint32_t SMP11                :3;
						uint32_t SMP12                :3;
						uint32_t SMP13                :3;
						uint32_t SMP14                :3;
						uint32_t SMP15                :3;
						uint32_t SMP16                :3;
						uint32_t SMP17                :3;
						uint32_t SMP18                :3;
						uint32_t ADC_SMPR2_1_SMP19    :3;
						uint32_t                      :2;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef ADC_SMPR3
			struct SMPR3_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t SMP0                 :3;
					uint32_t SMP1                 :3;
					uint32_t SMP2                 :3;
					uint32_t SMP3                 :3;
					uint32_t SMP4                 :3;
					uint32_t SMP5                 :3;
					uint32_t SMP6                 :3;
					uint32_t SMP7                 :3;
					uint32_t SMP8                 :3;
					uint32_t SMP9                 :3;
					uint32_t                      :2;
			
				
			};
			#endif
			
			#ifdef ADC_SQR1
			struct SQR1_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					#ifdef ADC_SQR1_0
					struct
					{
						uint32_t ADC_SQR1_0_SQ13      :5;
						uint32_t ADC_SQR1_0_SQ14      :5;
						uint32_t ADC_SQR1_0_SQ15      :5;
						uint32_t ADC_SQR1_0_SQ16      :5;
						uint32_t ADC_SQR1_0_L         :4;
						uint32_t ADC_SQR1_0_SQ4       :5;
						uint32_t                      :3;
					};
					#endif
					#ifdef ADC_SQR1_1
					struct
					{
						uint32_t L                    :4;
						uint32_t                      :2;
						uint32_t SQ1                  :5;
						uint32_t                      :1;
						uint32_t SQ2                  :5;
						uint32_t                      :1;
						uint32_t SQ3                  :5;
						uint32_t                      :9;
					};
					#endif
					#ifdef ADC_SQR1_2
					struct
					{
						uint32_t SQ25                 :5;
						uint32_t SQ26                 :5;
						uint32_t SQ27                 :5;
						uint32_t ADC_SQR1_2_SQ28      :5;
						uint32_t L                    :5;
						uint32_t                      :7;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef ADC_SQR2
			struct SQR2_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					#ifdef ADC_SQR2_0
					struct
					{
						uint32_t SQ7                  :5;
						uint32_t SQ8                  :5;
						uint32_t SQ9                  :5;
						uint32_t SQ10                 :5;
						uint32_t SQ11                 :5;
						uint32_t SQ12                 :5;
						uint32_t                      :2;
					};
					#endif
					#ifdef ADC_SQR2_1
					struct
					{
						uint32_t SQ5                  :5;
						uint32_t                      :1;
						uint32_t SQ6                  :5;
						uint32_t                      :1;
						uint32_t SQ7                  :5;
						uint32_t                      :1;
						uint32_t SQ8                  :5;
						uint32_t                      :1;
						uint32_t SQ9                  :5;
						uint32_t                      :3;
					};
					#endif
					#ifdef ADC_SQR2_2
					struct
					{
						uint32_t SQ19                 :5;
						uint32_t SQ20                 :5;
						uint32_t SQ21                 :5;
						uint32_t SQ22                 :5;
						uint32_t SQ23                 :5;
						uint32_t SQ24                 :5;
						uint32_t                      :2;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef ADC_SQR3
			struct SQR3_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					#ifdef ADC_SQR3_0
					struct
					{
						uint32_t SQ1                  :5;
						uint32_t SQ2                  :5;
						uint32_t SQ3                  :5;
						uint32_t SQ4                  :5;
						uint32_t SQ5                  :5;
						uint32_t SQ6                  :5;
						uint32_t                      :2;
					};
					#endif
					#ifdef ADC_SQR3_1
					struct
					{
						uint32_t SQ10                 :5;
						uint32_t                      :1;
						uint32_t SQ11                 :5;
						uint32_t                      :1;
						uint32_t SQ12                 :5;
						uint32_t                      :1;
						uint32_t SQ13                 :5;
						uint32_t                      :1;
						uint32_t SQ14                 :5;
						uint32_t                      :3;
					};
					#endif
					#ifdef ADC_SQR3_2
					struct
					{
						uint32_t SQ13                 :5;
						uint32_t SQ14                 :5;
						uint32_t SQ15                 :5;
						uint32_t SQ16                 :5;
						uint32_t SQ17                 :5;
						uint32_t SQ18                 :5;
						uint32_t                      :2;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef ADC_SQR4
			struct SQR4_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					struct
					{
						uint32_t ADC_SQR4_0_SQ15      :5;
						uint32_t                      :1;
						uint32_t ADC_SQR4_0_SQ16      :5;
						uint32_t                      :4;
						uint32_t ADC_SQR4_0_SQ10      :5;
						uint32_t ADC_SQR4_0_SQ11      :5;
						uint32_t ADC_SQR4_0_SQ12      :5;
						uint32_t                      :2;
					};
					#ifdef ADC_SQR4_1
					struct
					{
						uint32_t SQ7                  :5;
						uint32_t SQ8                  :5;
						uint32_t SQ9                  :5;
						uint32_t                      :17;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef ADC_SQR5
			struct SQR5_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t SQ1                  :5;
					uint32_t SQ2                  :5;
					uint32_t SQ3                  :5;
					uint32_t SQ4                  :5;
					uint32_t SQ5                  :5;
					uint32_t SQ6                  :5;
					uint32_t                      :2;
			
				
			};
			#endif
			
			#ifdef ADC_SR
			struct SR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					struct
					{
						uint32_t AWD                  :1;
						uint32_t ADC_SR_0_EOS         :1;
						uint32_t ADC_SR_0_JEOS        :1;
						uint32_t JSTRT                :1;
						uint32_t STRT                 :1;
						uint32_t ADC_SR_0_OVR         :1;
						uint32_t ADC_SR_0_ADONS       :1;
						uint32_t                      :1;
						uint32_t ADC_SR_0_RCNR        :1;
						uint32_t ADC_SR_0_JCNR        :1;
						uint32_t                      :22;
					};
					struct
					{
						uint32_t                      :1;
						uint32_t EOC                  :1;
						uint32_t JEOC                 :1;
						uint32_t                      :29;
					};
					#ifdef ADC_SR_2
					struct
					{
						uint32_t                      :1;
						uint32_t EOCS                 :1;
						uint32_t                      :30;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef ADC_TR
			struct TR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t LT                   :12;
					uint32_t                      :4;
					uint32_t HT                   :12;
					uint32_t                      :4;
			
				
			};
			#endif
			
			#ifdef ADC_TR1
			struct TR1_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t LT1                  :12;
					uint32_t                      :4;
					uint32_t HT1                  :12;
					uint32_t                      :4;
			
				
			};
			#endif
			
			#ifdef ADC_TR2
			struct TR2_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t LT2                  :8;
					uint32_t                      :8;
					uint32_t HT2                  :8;
					uint32_t                      :8;
			
				
			};
			#endif
			
			#ifdef ADC_TR3
			struct TR3_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t LT3                  :8;
					uint32_t                      :8;
					uint32_t HT3                  :8;
					uint32_t                      :8;
			
				
			};
			#endif
			
			union
			{
				
				struct
				{
					ADC_MAP0_ISR;        // @0x000
					ADC_MAP0_IER;        // @0x004
					ADC_MAP0_CR;         // @0x008
					ADC_MAP0_CFGR1;      // @0x00c
					ADC_MAP0_CFGR2;      // @0x010
					ADC_MAP0_SMPR;       // @0x014
					ADC_MAP0_JOFR2;      // @0x018
					ADC_MAP0_JOFR3;      // @0x01c
					ADC_MAP0_TR;         // @0x020
					ADC_MAP0_HTR;        // @0x024
					ADC_MAP0_CHSELR;     // @0x028
					ADC_MAP0_SQR1;       // @0x02c
					ADC_MAP0_SQR2;       // @0x030
					ADC_MAP0_SQR3;       // @0x034
					ADC_MAP0_JSQR;       // @0x038
					ADC_MAP0_JDR1;       // @0x03c
					ADC_MAP0_DR;         // @0x040
					ADC_MAP0_JDR3;       // @0x044
					ADC_MAP0_JDR4;       // @0x048
					ADC_MAP0_JDR2;       // @0x04c
					__SOOL_PERIPH_PADDING_8;
					__SOOL_PERIPH_PADDING_4;
					ADC_MAP0_SMPR0;      // @0x05c
					ADC_MAP0_OFR1;       // @0x060
					ADC_MAP0_OFR2;       // @0x064
					ADC_MAP0_OFR3;       // @0x068
					ADC_MAP0_OFR4;       // @0x06c
					__SOOL_PERIPH_PADDING_32;
					__SOOL_PERIPH_PADDING_16;
					ADC_MAP0_AWD2CR;     // @0x0a0
					ADC_MAP0_AWD3CR;     // @0x0a4
					__SOOL_PERIPH_PADDING_8;
					ADC_MAP0_DIFSEL;     // @0x0b0
					ADC_MAP0_CALFACT;    // @0x0b4
					ADC_MAP0_LTR3;       // @0x0b8
					ADC_MAP0_HTR3;       // @0x0bc
					__SOOL_PERIPH_PADDING_8;
					ADC_MAP0_CALFACT2;   // @0x0c8
				};
				struct
				{
					ADC_MAP1_SR;         // @0x000
					ADC_MAP1_CR1;        // @0x004
					ADC_MAP1_CR2;        // @0x008
					ADC_MAP1_SMPR1;      // @0x00c
					ADC_MAP1_SMPR2;      // @0x010
					ADC_MAP1_JOFR1;      // @0x014
					__SOOL_PERIPH_PADDING_4;
					ADC_MAP1_PCSEL;      // @0x01c
					ADC_MAP1_JOFR4;      // @0x020
					ADC_MAP1_TR2;        // @0x024
					ADC_MAP1_LTR;        // @0x028
					__SOOL_PERIPH_PADDING_4;
					ADC_MAP1_SQR1;       // @0x030
					ADC_MAP1_SQR2;       // @0x034
					ADC_MAP1_SQR3;       // @0x038
					ADC_MAP1_SQR4;       // @0x03c
					ADC_MAP1_JDR2;       // @0x040
					ADC_MAP1_JSQR;       // @0x044
					ADC_MAP1_JDR1;       // @0x048
					ADC_MAP1_DR;         // @0x04c
					ADC_MAP1_JDR3;       // @0x050
					ADC_MAP1_JDR4;       // @0x054
					__SOOL_PERIPH_PADDING_64;
					__SOOL_PERIPH_PADDING_16;
					__SOOL_PERIPH_PADDING_8;
					ADC_MAP1_LTR2;       // @0x0b0
					ADC_MAP1_HTR2;       // @0x0b4
					__SOOL_PERIPH_PADDING_8;
					ADC_MAP1_DIFSEL;     // @0x0c0
					ADC_MAP1_CALFACT;    // @0x0c4
					__SOOL_PERIPH_PADDING_4;
				};
				struct
				{
					__SOOL_PERIPH_PADDING_8;
					__SOOL_PERIPH_PADDING_4;
					ADC_MAP2_CFGR;       // @0x00c
					__SOOL_PERIPH_PADDING_4;
					ADC_MAP2_SMPR1;      // @0x014
					ADC_MAP2_SMPR2;      // @0x018
					ADC_MAP2_JOFR2;      // @0x01c
					ADC_MAP2_TR1;        // @0x020
					ADC_MAP2_HTR1;       // @0x024
					ADC_MAP2_TR3;        // @0x028
					ADC_MAP2_LTR;        // @0x02c
					__SOOL_PERIPH_PADDING_16;
					ADC_MAP2_SQR5;       // @0x040
					__SOOL_PERIPH_PADDING_8;
					ADC_MAP2_JSQR;       // @0x04c
					__SOOL_PERIPH_PADDING_8;
					ADC_MAP2_DR;         // @0x058
					__SOOL_PERIPH_PADDING_32;
					__SOOL_PERIPH_PADDING_4;
					ADC_MAP2_JDR1;       // @0x080
					ADC_MAP2_JDR2;       // @0x084
					ADC_MAP2_JDR3;       // @0x088
					ADC_MAP2_JDR4;       // @0x08c
					__SOOL_PERIPH_PADDING_32;
					__SOOL_PERIPH_PADDING_16;
					__SOOL_PERIPH_PADDING_8;
					__SOOL_PERIPH_PADDING_4;
				};
				struct
				{
					__SOOL_PERIPH_PADDING_16;
					__SOOL_PERIPH_PADDING_4;
					ADC_MAP3_SMPR3;      // @0x014
					ADC_MAP3_JOFR1;      // @0x018
					__SOOL_PERIPH_PADDING_4;
					ADC_MAP3_LTR1;       // @0x020
					ADC_MAP3_JOFR4;      // @0x024
					ADC_MAP3_HTR;        // @0x028
					__SOOL_PERIPH_PADDING_128;
					__SOOL_PERIPH_PADDING_32;
				};
				struct
				{
					__SOOL_PERIPH_PADDING_32;
					ADC_MAP4_JOFR3;      // @0x020
					__SOOL_PERIPH_PADDING_128;
					__SOOL_PERIPH_PADDING_32;
					__SOOL_PERIPH_PADDING_8;
				};
			};
			private:
			ADC() = delete;
			private:
			static constexpr uint32_t get_clock_enable_bit(const uint32_t addr);
			
			static constexpr volatile Reg32_t& get_clock_enable_reg(const uint32_t addr);
			
			public:
			void enable_clock() volatile;
			
			void disable_clock() volatile;
			
			bool is_clock_enabled() const volatile;
			
			#ifdef ADC_SQR1
			void set_acquisition_sequence_length(const unsigned int length) volatile;
			#endif
			
			void set_sequence_value(const unsigned int position, const unsigned int channel) volatile;
			
		};
		
		struct ADC_Common_base_plugin
		{
		
			#ifdef ADC_Common_CCR
			struct CCR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					struct
					{
						uint32_t ADC_Common_CCR_0_MULTI :5;
						uint32_t                      :3;
						uint32_t ADC_Common_CCR_0_DELAY :4;
						uint32_t                      :1;
						uint32_t ADC_Common_CCR_0_DDS :1;
						uint32_t ADC_Common_CCR_0_DMA :2;
						uint32_t ADC_Common_CCR_0_ADCPRE :2;
						uint32_t ADC_Common_CCR_0_PRESC :4;
						uint32_t ADC_Common_CCR_0_VREFEN :1;
						uint32_t ADC_Common_CCR_0_TSEN :1;
						uint32_t ADC_Common_CCR_0_VBATEN :1;
						uint32_t ADC_Common_CCR_0_LFMEN :1;
						uint32_t                      :6;
					};
					#ifdef ADC_Common_CCR_1
					struct
					{
						uint32_t ADC_Common_CCR_1_DUAL :5;
						uint32_t                      :8;
						uint32_t ADC_Common_CCR_1_DMACFG :1;
						uint32_t ADC_Common_CCR_1_MDMA :2;
						uint32_t ADC_Common_CCR_1_CKMODE :2;
						uint32_t                      :4;
						uint32_t ADC_Common_CCR_1_VBATE :1;
						uint32_t ADC_Common_CCR_1_TSVREFE :1;
						uint32_t ADC_Common_CCR_1_VLCDEN :1;
						uint32_t                      :7;
					};
					#endif
					#ifdef ADC_Common_CCR_2
					struct
					{
						uint32_t                      :14;
						uint32_t DAMDF                :2;
						uint32_t                      :16;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef ADC_Common_CDR
			struct CDR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					#ifdef ADC_Common_CDR_0
					struct
					{
						uint32_t DATA1                :16;
						uint32_t DATA2                :16;
					};
					#endif
					#ifdef ADC_Common_CDR_1
					struct
					{
						uint32_t RDATA_MST            :16;
						uint32_t RDATA_SLV            :16;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef ADC_Common_CDR2
			struct CDR2_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
			
				
			};
			#endif
			
			#ifdef ADC_Common_CSR
			struct CSR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					#ifdef ADC_Common_CSR_0
					struct
					{
						uint32_t ADC_Common_CSR_0_AWD1 :1;
						uint32_t ADC_Common_CSR_0_EOC1 :1;
						uint32_t ADC_Common_CSR_0_JEOC1 :1;
						uint32_t ADC_Common_CSR_0_JSTRT1 :1;
						uint32_t ADC_Common_CSR_0_STRT1 :1;
						uint32_t ADC_Common_CSR_0_OVR1 :1;
						uint32_t ADC_Common_CSR_0_JEOS_MST :1;
						uint32_t                      :1;
						uint32_t ADC_Common_CSR_0_AWD2 :1;
						uint32_t ADC_Common_CSR_0_EOC2 :1;
						uint32_t ADC_Common_CSR_0_JEOC2 :1;
						uint32_t ADC_Common_CSR_0_JSTRT2 :1;
						uint32_t ADC_Common_CSR_0_STRT2 :1;
						uint32_t ADC_Common_CSR_0_OVR2 :1;
						uint32_t                      :2;
						uint32_t ADC_Common_CSR_0_AWD3 :1;
						uint32_t ADC_Common_CSR_0_EOC3 :1;
						uint32_t ADC_Common_CSR_0_JEOC3 :1;
						uint32_t ADC_Common_CSR_0_JSTRT3 :1;
						uint32_t ADC_Common_CSR_0_STRT3 :1;
						uint32_t ADC_Common_CSR_0_OVR3 :1;
						uint32_t ADC_Common_CSR_0_JEOS_SLV :1;
						uint32_t                      :3;
						uint32_t ADC_Common_CSR_0_JQOVF_SLV :1;
						uint32_t                      :5;
					};
					#endif
					#ifdef ADC_Common_CSR_1
					struct
					{
						uint32_t ADC_Common_CSR_1_ADRDY_MST :1;
						uint32_t ADC_Common_CSR_1_EOSMP_MST :1;
						uint32_t ADC_Common_CSR_1_EOC_MST :1;
						uint32_t ADC_Common_CSR_1_EOS_MST :1;
						uint32_t ADC_Common_CSR_1_OVR_MST :1;
						uint32_t ADC_Common_CSR_1_DOVR1 :1;
						uint32_t ADC_Common_CSR_1_ADONS1 :1;
						uint32_t                      :3;
						uint32_t ADC_Common_CSR_1_JQOVF_MST :1;
						uint32_t                      :2;
						uint32_t ADC_Common_CSR_1_DOVR2 :1;
						uint32_t                      :2;
						uint32_t ADC_Common_CSR_1_ADRDY_SLV :1;
						uint32_t ADC_Common_CSR_1_EOSMP_SLV :1;
						uint32_t ADC_Common_CSR_1_EOC_SLV :1;
						uint32_t ADC_Common_CSR_1_EOS_SLV :1;
						uint32_t ADC_Common_CSR_1_OVR_SLV :1;
						uint32_t ADC_Common_CSR_1_DOVR3 :1;
						uint32_t                      :10;
					};
					#endif
					#ifdef ADC_Common_CSR_2
					struct
					{
						uint32_t                      :1;
						uint32_t ADC_Common_CSR_2_EOCS1 :1;
						uint32_t ADC_Common_CSR_2_JEOS1 :1;
						uint32_t                      :2;
						uint32_t ADC_Common_CSR_2_JEOC_MST :1;
						uint32_t                      :15;
						uint32_t ADC_Common_CSR_2_JEOC_SLV :1;
						uint32_t                      :10;
					};
					#endif
				};
				
			};
			#endif
			};
		template<typename plugin=ADC_Common_base_plugin>
		class ADC_Common
		{
			
			
			public :
			
			union
			{
				
				struct
				{
					ADC_Common_MAP0_CCR; // @0x000
					ADC_Common_MAP0_CR1; // @0x004
					ADC_Common_MAP0_CR2; // @0x008
					ADC_Common_MAP0_CDR; // @0x00c
					ADC_Common_MAP0_CDR2; // @0x010
					__SOOL_PERIPH_PADDING_32;
					__SOOL_PERIPH_PADDING_16;
					__SOOL_PERIPH_PADDING_8;
					ADC_Common_MAP0_DR;  // @0x04c
				};
				struct
				{
					ADC_Common_MAP1_SR;  // @0x000
					ADC_Common_MAP1_CCR; // @0x004
					ADC_Common_MAP1_CDR; // @0x008
					__SOOL_PERIPH_PADDING_64;
					__SOOL_PERIPH_PADDING_4;
				};
				struct
				{
					ADC_Common_MAP2_CSR; // @0x000
					__SOOL_PERIPH_PADDING_4;
					ADC_Common_MAP2_CCR; // @0x008
					__SOOL_PERIPH_PADDING_64;
					__SOOL_PERIPH_PADDING_4;
				};
			};
			private:
			ADC_Common() = delete;
			
		};
		
		//region instances
#if defined(STM32F0     ) || defined(STM32F1     ) || defined(STM32F373xC ) || defined(STM32F378xx ) ||\
    defined(STM32L0     ) || defined(STM32L1     ) 
#define ADC1_BASE_ADDR ((uint32_t)0x40012400U)
#endif

#if defined(STM32F2     ) || defined(STM32F4     ) || defined(STM32F7     ) 
#define ADC1_BASE_ADDR ((uint32_t)0x40012000U)
#endif

#if defined(STM32F301x8 ) || defined(STM32F302x8 ) || defined(STM32F302xC ) || defined(STM32F302xE ) ||\
    defined(STM32F303x8 ) || defined(STM32F303xC ) || defined(STM32F303xE ) || defined(STM32F318xx ) ||\
    defined(STM32F328xx ) || defined(STM32F334x8 ) || defined(STM32F358xx ) || defined(STM32F398xx ) 
#define ADC1_BASE_ADDR ((uint32_t)0x50000000U)
#endif

#if defined(STM32H7     ) 
#define ADC1_BASE_ADDR ((uint32_t)0x40022000U)
