/**
 * Copyright (c) 2018-2019 FAUCHER Julien & FRANCE Loic
 * This file is part of SooL.
 *
 *  SooL is free software: you can redistribute it and/or modify
 *  it under the terms of the GNU Lesser General Public License
 *  as published by the Free Software Foundation, either version 3
 *  of the License, or (at your option) any later version.
 *
 *  SooL is distributed in the hope that it will be useful,
 *  but WITHOUT ANY WARRANTY; without even the implied warranty of
 *  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
 *  GNU Lesser General Public License for more details.
 *
 *  You should have received a copy of the GNU Lesser General Public License
 *  along with SooL. If not, see <https://www.gnu.org/licenses/>.
 */
#ifndef __SOOL_FLASH_H
#define __SOOL_FLASH_H

#include "lib_utils/peripheral_include.h"

//region defines

#define FLASH_ACR
#define FLASH_OPTKEYR

#if defined(STM32F0     ) || defined(STM32F1     ) || defined(STM32F2     ) || defined(STM32F3     ) ||\
    defined(STM32F4     ) || defined(STM32F7     ) || defined(STM32L0     ) || defined(STM32L1     ) ||\
    defined(STM32L4     ) || defined(STM32L4P    ) 
#define FLASH_ACR_0
#define FLASH_SR
#endif

#if defined(STM32F0     ) || defined(STM32L0     ) || defined(STM32L1     ) 
#define FLASH_ACR_0_LATENCY  LATENCY              // 1 bits @ 0
#else
#define FLASH_ACR_0_LATENCY
#endif

#if defined(STM32L1     ) 
#define FLASH_ACR_0_ACC64    ACC64                // 1 bits @ 2

    defined(STM32L151xC ) || defined(STM32L152xBA) || defined(STM32L152xC ) || defined(STM32L162xC ) 
#define FLASH_SR_1_RDERR     RDERR                // 1 bits @ 13
#else
#define FLASH_SR_1_RDERR
#endif

#if defined(STM32H7     ) || defined(STM32L0     ) || defined(STM32L1     ) || defined(STM32L4     ) ||\
    defined(STM32L4P    ) 
#define FLASH_SR_2
#endif

#if defined(STM32L0     ) || defined(STM32L1     ) || defined(STM32L431xx ) || defined(STM32L432xx ) ||\
    defined(STM32L433xx ) || defined(STM32L442xx ) || defined(STM32L443xx ) || defined(STM32L451xx ) ||\
    defined(STM32L452xx ) || defined(STM32L462xx ) || defined(STM32L496xx ) || defined(STM32L4A6xx ) ||\
    defined(STM32L4P    ) 
#define FLASH_SR_3
#endif

#if defined(STM32F0     ) || defined(STM32F1     ) || defined(STM32F3     ) || defined(STM32L0     ) 
#define FLASH_WRPR
#define FLASH_MAP0_WRPR      WRPR_TypeDef WRPR
#else
#define FLASH_MAP0_WRPR __SOOL_PERIPH_PADDING_4
#endif

#if defined(STM32F0     ) || defined(STM32L0     ) 
#define FLASH_WRPR_0
#endif

#if defined(STM32F1     ) || defined(STM32F3     ) 
#define FLASH_WRPR_1
#endif

#if defined(STM32L071xx ) || defined(STM32L072xx ) || defined(STM32L073xx ) || defined(STM32L081xx ) ||\
    defined(STM32L082xx ) || defined(STM32L083xx ) || defined(STM32L100xC ) || defined(STM32L151xC ) ||\
    defined(STM32L151xCA) || defined(STM32L151xD ) || defined(STM32L151xDx) || defined(STM32L151xE ) ||\
    defined(STM32L152xC ) || defined(STM32L152xCA) || defined(STM32L152xD ) || defined(STM32L152xDx) ||\
    defined(STM32L152xE ) || defined(STM32L162xC ) || defined(STM32L162xCA) || defined(STM32L162xD ) ||\
    defined(STM32L162xDx) || defined(STM32L162xE ) 
#define FLASH_WRPR2
#define FLASH_MAP0_WRPR2     WRPR2_TypeDef WRPR2
#else
#define FLASH_MAP0_WRPR2 __SOOL_PERIPH_PADDING_4
#endif

#if defined(STM32L100xC ) || defined(STM32L151xC ) || defined(STM32L151xCA) || defined(STM32L151xD ) ||\
    defined(STM32L151xE ) || defined(STM32L152xC ) || defined(STM32L152xCA) || defined(STM32L152xD ) ||\
    defined(STM32L152xE ) || defined(STM32L162xC ) || defined(STM32L162xCA) || defined(STM32L162xD ) ||\
    defined(STM32L162xE ) 
#define FLASH_WRPR2_0
#endif

#if defined(STM32L151xDx) || defined(STM32L152xDx) || defined(STM32L162xDx) 
#define FLASH_WRPR2_1
#define FLASH_WRPR4_0
#endif

#if defined(STM32L151xDx) || defined(STM32L151xE ) || defined(STM32L152xDx) || defined(STM32L152xE ) ||\
    defined(STM32L162xDx) || defined(STM32L162xE ) 
#define FLASH_WRPR4
#define FLASH_MAP0_WRPR4     WRPR4_TypeDef WRPR4
#else
#define FLASH_MAP0_WRPR4 __SOOL_PERIPH_PADDING_4
#endif

#if defined(STM32L151xE ) || defined(STM32L152xE ) || defined(STM32L162xE ) 
#define FLASH_WRPR4_1
#endif

#if defined(STM32F0     ) || defined(STM32F1     ) || defined(STM32F2     ) || defined(STM32F3     ) ||\
    defined(STM32F4     ) || defined(STM32F7     ) || defined(STM32H7     ) 
#define FLASH_MAP0_OPTKEYR   OPTKEYR_TypeDef OPTKEYR
#else
#define FLASH_MAP0_OPTKEYR __SOOL_PERIPH_PADDING_4
#endif

//endregion

namespace sool
{
	namespace core
	{
		class FLASH
		{
			
			
			public :
			
			#ifdef FLASH_ACR
			struct ACR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					#ifdef FLASH_ACR_0
					struct
					{
						uint32_t FLASH_ACR_0_LATENCY  :1;
						uint32_t                      :1;
						uint32_t FLASH_ACR_0_ACC64    :1;
						uint32_t FLASH_ACR_0_HLFCYA   :1;
						uint32_t FLASH_ACR_0_PRFTBE   :1;
						uint32_t FLASH_ACR_0_PRFTBS   :1;
						uint32_t FLASH_ACR_0_PRE_READ :1;
						uint32_t                      :1;
						uint32_t FLASH_ACR_0_PRFTEN   :1;
						uint32_t FLASH_ACR_0_ICEN     :1;
						uint32_t FLASH_ACR_0_DCEN     :1;
						uint32_t FLASH_ACR_0_ICRST    :1;
						uint32_t FLASH_ACR_0_DCRST    :1;
						uint32_t FLASH_ACR_0_RUN_PD   :1;
						uint32_t FLASH_ACR_0_SLEEP_PD :1;
						uint32_t                      :17;
					};
					#endif
					#ifdef FLASH_ACR_1
					struct
					{
						uint32_t FLASH_ACR_1_LATENCY  :3;
						uint32_t FLASH_ACR_1_SLEEP_PD :1;
						uint32_t FLASH_ACR_1_WRHIGHFREQ :2;
						uint32_t                      :3;
						uint32_t FLASH_ACR_1_ARTEN    :1;
						uint32_t                      :1;
						uint32_t FLASH_ACR_1_ARTRST   :1;
						uint32_t                      :20;
					};
					#endif
					#ifdef FLASH_ACR_2
					struct
					{
						uint32_t FLASH_ACR_2_LATENCY  :4;
						uint32_t FLASH_ACR_2_RUN_PD   :1;
						uint32_t FLASH_ACR_2_DISAB_BUF :1;
						uint32_t                      :26;
					};
					#endif
					#ifdef FLASH_ACR_3
					struct
					{
						uint32_t                      :1;
						uint32_t PRFTEN               :1;
						uint32_t                      :30;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef FLASH_AR
			struct AR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					struct
					{
						uint32_t FAR                  :32;
					};
					#ifdef FLASH_AR_1
					struct
					{
						uint32_t FAR2                 :32;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef FLASH_BOOT
			struct BOOT_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t ADD0                 :16;
					uint32_t ADD1                 :16;
			
				
			};
			#endif
			
			#ifdef FLASH_CCR
			struct CCR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t                      :16;
					uint32_t CLR_EOP              :1;
					uint32_t CLR_WRPERR           :1;
					uint32_t CLR_PGSERR           :1;
					uint32_t CLR_STRBERR          :1;
					uint32_t                      :1;
					uint32_t CLR_INCERR           :1;
					uint32_t CLR_OPERR            :1;
					uint32_t CLR_RDPERR           :1;
					uint32_t CLR_RDSERR           :1;
					uint32_t CLR_SNECCERR         :1;
					uint32_t CLR_DBECCERR         :1;
					uint32_t CLR_CRCEND           :1;
					uint32_t                      :4;
			
				
			};
			#endif
			
			#ifdef FLASH_CFGR
			struct CFGR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t LVEN                 :1;
					uint32_t                      :31;
			
				
			};
			#endif
			
			#ifdef FLASH_CR
			struct CR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					#ifdef FLASH_CR_0
					struct
					{
						uint32_t FLASH_CR_0_PG        :1;
						uint32_t FLASH_CR_0_PER       :1;
						uint32_t FLASH_CR_0_MER       :1;
						uint32_t FLASH_CR_0_BER       :1;
						uint32_t FLASH_CR_0_OPTPG     :1;
						uint32_t FLASH_CR_0_OPTER     :1;
						uint32_t FLASH_CR_0_STRT      :1;
						uint32_t FLASH_CR_0_LOCK      :1;
						uint32_t                      :1;
						uint32_t FLASH_CR_0_OPTWRE    :1;
						uint32_t FLASH_CR_0_ERRIE     :1;
						uint32_t FLASH_CR_0_BKER      :1;
						uint32_t FLASH_CR_0_EOPIE     :1;
						uint32_t FLASH_CR_0_OBL_LAUNCH :1;
						uint32_t                      :1;
						uint32_t FLASH_CR_0_MER2      :1;
						uint32_t                      :1;
						uint32_t FLASH_CR_0_WRPERRIE  :1;
						uint32_t FLASH_CR_0_PGSERRIE  :1;
						uint32_t FLASH_CR_0_STRBERRIE :1;
						uint32_t                      :1;
						uint32_t FLASH_CR_0_INCERRIE  :1;
						uint32_t FLASH_CR_0_OPERRIE   :1;
						uint32_t FLASH_CR_0_RDPERRIE  :1;
						uint32_t FLASH_CR_0_RDSERRIE  :1;
						uint32_t FLASH_CR_0_SNECCERRIE :1;
						uint32_t FLASH_CR_0_RDERRIE   :1;
						uint32_t FLASH_CR_0_CRCENDIE  :1;
						uint32_t                      :2;
						uint32_t FLASH_CR_0_OPTLOCK   :1;
						uint32_t                      :1;
					};
					#endif
					#ifdef FLASH_CR_1
					struct
					{
						uint32_t                      :1;
						uint32_t FLASH_CR_1_SER       :1;
						uint32_t FLASH_CR_1_MER1      :1;
						uint32_t FLASH_CR_1_SNB       :5;
						uint32_t FLASH_CR_1_PSIZE     :2;
						uint32_t                      :5;
						uint32_t FLASH_CR_1_CRC_EN    :1;
						uint32_t FLASH_CR_1_STRT      :1;
						uint32_t FLASH_CR_1_OPTSTRT   :1;
						uint32_t FLASH_CR_1_FSTPG     :1;
						uint32_t                      :5;
						uint32_t FLASH_CR_1_EOPIE     :1;
						uint32_t FLASH_CR_1_ERRIE     :1;
						uint32_t FLASH_CR_1_DBECCERRIE :1;
						uint32_t FLASH_CR_1_OBL_LAUNCH :1;
						uint32_t                      :3;
						uint32_t FLASH_CR_1_LOCK      :1;
					};
					#endif
					#ifdef FLASH_CR_2
					struct
					{
						uint32_t FLASH_CR_2_LOCK      :1;
						uint32_t FLASH_CR_2_PG        :1;
						uint32_t FLASH_CR_2_SER       :1;
						uint32_t FLASH_CR_2_SNB       :4;
						uint32_t FLASH_CR_2_START     :1;
						uint32_t                      :8;
						uint32_t FLASH_CR_2_EOPIE     :1;
						uint32_t                      :15;
					};
					#endif
					#ifdef FLASH_CR_3
					struct
					{
						uint32_t                      :4;
						uint32_t PSIZE                :2;
						uint32_t FW                   :1;
						uint32_t                      :1;
						uint32_t SNB                  :3;
						uint32_t                      :21;
					};
					#endif
					#ifdef FLASH_CR_4
					struct
					{
						uint32_t                      :3;
						uint32_t PNB                  :8;
						uint32_t                      :21;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef FLASH_CR2
			struct CR2_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t PG                   :1;
					uint32_t PER                  :1;
					uint32_t MER                  :1;
					uint32_t                      :3;
					uint32_t STRT                 :1;
					uint32_t LOCK                 :1;
					uint32_t                      :2;
					uint32_t ERRIE                :1;
					uint32_t                      :1;
					uint32_t EOPIE                :1;
					uint32_t                      :19;
			
				
			};
			#endif
			
			#ifdef FLASH_CRCCR
			struct CRCCR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t CRC_SECT             :3;
					uint32_t                      :4;
					uint32_t ALL_BANK             :1;
					uint32_t CRC_BY_SECT          :1;
					uint32_t ADD_SECT             :1;
					uint32_t CLEAN_SECT           :1;
					uint32_t                      :5;
					uint32_t START_CRC            :1;
					uint32_t CLEAN_CRC            :1;
					uint32_t                      :2;
					uint32_t CRC_BURST            :2;
					uint32_t                      :10;
			
				
			};
			#endif
			
			#ifdef FLASH_CRCDATA
			struct CRCDATA_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t CRC_DATA             :32;
			
				
			};
			#endif
			
			#ifdef FLASH_CRCEADDR
			struct CRCEADDR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t CRC_END_ADDR         :32;
			
				
			};
			#endif
			
			#ifdef FLASH_CRCSADDR
			struct CRCSADDR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t CRC_START_ADDR       :32;
			
				
			};
			#endif
			
			#ifdef FLASH_ECCR
			struct ECCR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					struct
					{
						uint32_t FLASH_ECCR_0_ADDR_ECC :19;
						uint32_t FLASH_ECCR_0_BK_ECC  :1;
						uint32_t FLASH_ECCR_0_SYSF_ECC :1;
						uint32_t                      :3;
						uint32_t ECCIE                :1;
						uint32_t                      :3;
						uint32_t FLASH_ECCR_0_ECCC2   :1;
						uint32_t FLASH_ECCR_0_ECCD2   :1;
						uint32_t ECCC                 :1;
						uint32_t ECCD                 :1;
					};
					#ifdef FLASH_ECCR_1
					struct
					{
						uint32_t ADDR_ECC             :20;
						uint32_t                      :1;
						uint32_t BK_ECC               :1;
						uint32_t SYSF_ECC             :1;
						uint32_t                      :9;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef FLASH_ECC_FA
			struct ECC_FA_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t FAIL_ECC_ADDR        :15;
					uint32_t                      :17;
			
				
			};
			#endif
			
			#ifdef FLASH_KEYR
			struct KEYR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t FKEYR                :32;
			
				
			};
			#endif
			
			#ifdef FLASH_OBR
			struct OBR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					#ifdef FLASH_OBR_0
					struct
					{
						uint32_t OPTERR               :1;
						uint32_t FLASH_OBR_0_RDPRT1   :1;
						uint32_t FLASH_OBR_0_RDPRT2   :1;
						uint32_t                      :2;
						uint32_t FLASH_OBR_0_BFB2     :1;
						uint32_t                      :2;
						uint32_t FLASH_OBR_0_IWDG_SW  :1;
						uint32_t FLASH_OBR_0_nRST_STOP :1;
						uint32_t FLASH_OBR_0_nRST_STDBY :1;
						uint32_t FLASH_OBR_0_nBOOT0   :1;
						uint32_t FLASH_OBR_0_nBOOT1   :1;
						uint32_t FLASH_OBR_0_VDDA_MONITOR :1;
						uint32_t FLASH_OBR_0_RAM_PARITY_CHECK :1;
						uint32_t FLASH_OBR_0_BOOT_SEL :1;
						uint32_t FLASH_OBR_0_DATA0    :8;
						uint32_t FLASH_OBR_0_DATA1    :8;
					};
					#endif
					#ifdef FLASH_OBR_1
					struct
					{
						uint32_t                      :1;
						uint32_t FLASH_OBR_1_RDPRT    :1;
						uint32_t FLASH_OBR_1_IWDG_SW  :1;
						uint32_t FLASH_OBR_1_nRST_STOP :1;
						uint32_t FLASH_OBR_1_nRST_STDBY :1;
						uint32_t                      :3;
						uint32_t FLASH_OBR_1_USER     :8;
						uint32_t                      :2;
						uint32_t FLASH_OBR_1_DATA1    :8;
						uint32_t                      :6;
					};
					#endif
					#ifdef FLASH_OBR_2
					struct
					{
						uint32_t                      :1;
						uint32_t FLASH_OBR_2_LEVEL1_PROT :1;
						uint32_t FLASH_OBR_2_USER     :3;
						uint32_t                      :3;
						uint32_t FLASH_OBR_2_SPRMOD   :1;
						uint32_t                      :1;
						uint32_t FLASH_OBR_2_DATA0    :8;
						uint32_t                      :2;
						uint32_t FLASH_OBR_2_IWDG_SW  :1;
						uint32_t FLASH_OBR_2_nRST_STOP :1;
						uint32_t FLASH_OBR_2_nRST_STDBY :1;
						uint32_t FLASH_OBR_2_nRST_BFB2 :1;
						uint32_t                      :8;
					};
					#endif
					#ifdef FLASH_OBR_3
					struct
					{
						uint32_t                      :2;
						uint32_t FLASH_OBR_3_USER     :4;
						uint32_t                      :8;
						uint32_t FLASH_OBR_3_SRAM_PE  :1;
						uint32_t FLASH_OBR_3_SDADC12_VDD_MONITOR :1;
						uint32_t FLASH_OBR_3_BOR_LEV  :4;
						uint32_t                      :12;
					};
					#endif
					#ifdef FLASH_OBR_4
					struct
					{
						uint32_t                      :1;
						uint32_t FLASH_OBR_4_RDPRT    :2;
						uint32_t                      :17;
						uint32_t FLASH_OBR_4_USER     :3;
						uint32_t                      :9;
					};
					#endif
					#ifdef FLASH_OBR_5
					struct
					{
						uint32_t                      :2;
						uint32_t FLASH_OBR_5_LEVEL2_PROT :1;
						uint32_t                      :17;
						uint32_t FLASH_OBR_5_USER     :4;
						uint32_t                      :8;
					};
					#endif
					#ifdef FLASH_OBR_6
					struct
					{
						uint32_t RDPRT                :8;
						uint32_t                      :24;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef FLASH_OPTCCR
			struct OPTCCR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t                      :30;
					uint32_t CLR_OPTCHANGEERR     :1;
					uint32_t                      :1;
			
				
			};
			#endif
			
			#ifdef FLASH_OPTCR
			struct OPTCR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					struct
					{
						uint32_t OPTLOCK              :1;
						uint32_t FLASH_OPTCR_0_OPTSTRT :1;
						uint32_t FLASH_OPTCR_0_BOR_LEV :1;
						uint32_t FLASH_OPTCR_0_MER    :1;
						uint32_t FLASH_OPTCR_0_BFB2   :1;
						uint32_t FLASH_OPTCR_0_WDG_SW :1;
						uint32_t FLASH_OPTCR_0_nRST_STOP :1;
						uint32_t FLASH_OPTCR_0_nRST_STDBY :1;
						uint32_t FLASH_OPTCR_0_RDP    :8;
						uint32_t FLASH_OPTCR_0_nWRP   :12;
						uint32_t FLASH_OPTCR_0_nDBOOT :1;
						uint32_t FLASH_OPTCR_0_nDBANK :1;
						uint32_t FLASH_OPTCR_0_DB1M   :1;
						uint32_t FLASH_OPTCR_0_SPRMOD :1;
					};
					struct
					{
						uint32_t                      :1;
						uint32_t FLASH_OPTCR_1_OPTSTART :1;
						uint32_t FLASH_OPTCR_1_BOR_LEV :2;
						uint32_t FLASH_OPTCR_1_WWDG_SW :1;
						uint32_t FLASH_OPTCR_1_IWDG_SW :1;
						uint32_t                      :10;
						uint32_t FLASH_OPTCR_1_nWRP   :15;
						uint32_t FLASH_OPTCR_1_IWDG_STOP :1;
					};
					#ifdef FLASH_OPTCR_2
					struct
					{
						uint32_t                      :16;
						uint32_t FLASH_OPTCR_2_nWRP   :8;
						uint32_t                      :6;
						uint32_t FLASH_OPTCR_2_IWDG_STDBY :1;
						uint32_t FLASH_OPTCR_2_SWAP_BANK :1;
					};
					#endif
					#ifdef FLASH_OPTCR_3
					struct
					{
						uint32_t                      :30;
						uint32_t OPTCHANGEERRIE       :1;
						uint32_t                      :1;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef FLASH_OPTCR1
			struct OPTCR1_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					struct
					{
						uint32_t FLASH_OPTCR1_0_BOOT_ADD0 :16;
						uint32_t FLASH_OPTCR1_0_nWRP  :12;
						uint32_t                      :4;
					};
					#ifdef FLASH_OPTCR1_1
					struct
					{
						uint32_t                      :16;
						uint32_t BOOT_ADD1            :16;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef FLASH_OPTCR2
			struct OPTCR2_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t PCROP                :8;
					uint32_t                      :24;
			
				
			};
			#endif
			
			#ifdef FLASH_OPTKEYR
			struct OPTKEYR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					#ifdef FLASH_OPTKEYR_0
					struct
					{
						uint32_t OPTKEYR              :32;
					};
					#endif
					#ifdef FLASH_OPTKEYR_1
					struct
					{
						uint32_t OPTKEY2              :32;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef FLASH_OPTR
			struct OPTR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					struct
					{
						uint32_t FLASH_OPTR_0_RDPROT  :8;
						uint32_t FLASH_OPTR_0_WPRMOD  :1;
						uint32_t                      :5;
						uint32_t FLASH_OPTR_0_nRST_SHDW :1;
						uint32_t                      :1;
						uint32_t FLASH_OPTR_0_BOR_LEV :4;
						uint32_t FLASH_OPTR_0_IWDG_SW :1;
						uint32_t FLASH_OPTR_0_nRST_STOP :1;
						uint32_t FLASH_OPTR_0_nRST_STDBY :1;
						uint32_t FLASH_OPTR_0_BFB2    :1;
						uint32_t FLASH_OPTR_0_SRAM2_PE :1;
						uint32_t FLASH_OPTR_0_SRAM2_RST :1;
						uint32_t FLASH_OPTR_0_nSWBOOT0 :1;
						uint32_t FLASH_OPTR_0_nBOOT0  :1;
						uint32_t                      :3;
						uint32_t FLASH_OPTR_0_BOOT1   :1;
					};
					struct
					{
						uint32_t FLASH_OPTR_1_RDP     :8;
						uint32_t FLASH_OPTR_1_BOR_LEV :3;
						uint32_t                      :1;
						uint32_t FLASH_OPTR_1_nRST_STOP :1;
						uint32_t FLASH_OPTR_1_nRST_STDBY :1;
						uint32_t                      :2;
						uint32_t FLASH_OPTR_1_IWDG_SW :1;
						uint32_t FLASH_OPTR_1_IWDG_STOP :1;
						uint32_t FLASH_OPTR_1_IWDG_STDBY :1;
						uint32_t FLASH_OPTR_1_WWDG_SW :1;
						uint32_t FLASH_OPTR_1_USER    :3;
						uint32_t FLASH_OPTR_1_nBOOT1  :1;
						uint32_t                      :8;
					};
					#ifdef FLASH_OPTR_2
					struct
					{
						uint32_t                      :20;
						uint32_t BFB2                 :1;
						uint32_t FLASH_OPTR_2_DUALBANK :1;
						uint32_t FLASH_OPTR_2_DBANK   :1;
						uint32_t                      :9;
					};
					#endif
					#ifdef FLASH_OPTR_3
					struct
					{
						uint32_t                      :21;
						uint32_t DB1M                 :1;
						uint32_t                      :10;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef FLASH_OPTSR
			struct OPTSR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t OPT_BUSY             :1;
					uint32_t                      :1;
					uint32_t BOR_LEV              :2;
					uint32_t IWDG1_SW             :1;
					uint32_t                      :1;
					uint32_t NRST_STOP_D1         :1;
					uint32_t NRST_STBY_D1         :1;
					uint32_t RDP                  :8;
					uint32_t                      :1;
					uint32_t FZ_IWDG_STOP         :1;
					uint32_t FZ_IWDG_SDBY         :1;
					uint32_t ST_RAM_SIZE          :2;
					uint32_t SECURITY             :1;
					uint32_t                      :4;
					uint32_t RSS1                 :1;
					uint32_t RSS2                 :1;
					uint32_t PERSO_OK             :1;
					uint32_t IO_HSLV              :1;
					uint32_t OPTCHANGEERR         :1;
					uint32_t SWAP_BANK_OPT        :1;
			
				
			};
			#endif
			
			#ifdef FLASH_PCROP1ER
			struct PCROP1ER_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					struct
					{
						uint32_t FLASH_PCROP1ER_0_PCROP1_END :16;
						uint32_t                      :15;
						uint32_t PCROP_RDP            :1;
					};
					#ifdef FLASH_PCROP1ER_1
					struct
					{
						uint32_t PCROP1_END           :15;
						uint32_t                      :17;
					};
					#endif
					#ifdef FLASH_PCROP1ER_2
					struct
					{
						uint32_t PCROP1_END           :17;
						uint32_t                      :15;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef FLASH_PCROP1SR
			struct PCROP1SR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					#ifdef FLASH_PCROP1SR_0
					struct
					{
						uint32_t PCROP1_STRT          :16;
						uint32_t                      :16;
					};
					#endif
					#ifdef FLASH_PCROP1SR_1
					struct
					{
						uint32_t PCROP1_STRT          :15;
						uint32_t                      :17;
					};
					#endif
					#ifdef FLASH_PCROP1SR_2
					struct
					{
						uint32_t PCROP1_STRT          :17;
						uint32_t                      :15;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef FLASH_PCROP2ER
			struct PCROP2ER_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					#ifdef FLASH_PCROP2ER_0
					struct
					{
						uint32_t PCROP2_END           :16;
						uint32_t                      :16;
					};
					#endif
					#ifdef FLASH_PCROP2ER_1
					struct
					{
						uint32_t PCROP2_END           :17;
						uint32_t                      :15;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef FLASH_PCROP2SR
			struct PCROP2SR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					#ifdef FLASH_PCROP2SR_0
					struct
					{
						uint32_t PCROP2_STRT          :16;
						uint32_t                      :16;
					};
					#endif
					#ifdef FLASH_PCROP2SR_1
					struct
					{
						uint32_t PCROP2_STRT          :17;
						uint32_t                      :15;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef FLASH_PDKEYR
			struct PDKEYR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t PDKEYR               :32;
			
				
			};
			#endif
			
			#ifdef FLASH_PECR
			struct PECR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					struct
					{
						uint32_t PELOCK               :1;
						uint32_t PRGLOCK              :1;
						uint32_t OPTLOCK              :1;
						uint32_t PROG                 :1;
						uint32_t DATA                 :1;
						uint32_t                      :3;
						uint32_t FLASH_PECR_0_FIX     :1;
						uint32_t ERASE                :1;
						uint32_t FPRG                 :1;
						uint32_t                      :4;
						uint32_t FLASH_PECR_0_PARALLBANK :1;
						uint32_t EOPIE                :1;
						uint32_t ERRIE                :1;
						uint32_t OBL_LAUNCH           :1;
						uint32_t FLASH_PECR_0_HALF_ARRAY :1;
						uint32_t                      :2;
						uint32_t FLASH_PECR_0_NZDISABLE :1;
						uint32_t                      :9;
					};
					#ifdef FLASH_PECR_1
					struct
					{
						uint32_t                      :8;
						uint32_t FTDW                 :1;
						uint32_t                      :23;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef FLASH_PEKEYR
			struct PEKEYR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t PEKEYR               :32;
			
				
			};
			#endif
			
			#ifdef FLASH_PRAR
			struct PRAR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t PROT_AREA_START      :12;
					uint32_t                      :4;
					uint32_t PROT_AREA_END        :12;
					uint32_t                      :3;
					uint32_t DMEP                 :1;
			
				
			};
			#endif
			
			#ifdef FLASH_PRGKEYR
			struct PRGKEYR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t PRGKEYR              :32;
			
				
			};
			#endif
			
			#ifdef FLASH_SCAR
			struct SCAR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t SEC_AREA_START       :12;
					uint32_t                      :4;
					uint32_t SEC_AREA_END         :12;
					uint32_t                      :3;
					uint32_t DMES                 :1;
			
				
			};
			#endif
			
			#ifdef FLASH_SR
			struct SR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					struct
					{
						uint32_t FLASH_SR_0_BSY       :1;
						uint32_t FLASH_SR_0_SOP       :1;
						uint32_t FLASH_SR_0_PGERR     :1;
						uint32_t FLASH_SR_0_CRC_BUSY  :1;
						uint32_t FLASH_SR_0_WRPRTERR  :1;
						uint32_t FLASH_SR_0_EOP       :1;
						uint32_t FLASH_SR_0_PGPERR    :1;
						uint32_t FLASH_SR_0_PGSERR    :1;
						uint32_t FLASH_SR_0_RDERR     :1;
						uint32_t FLASH_SR_0_PGAERR    :1;
						uint32_t FLASH_SR_0_SIZERR    :1;
						uint32_t FLASH_SR_0_OPTVERR   :1;
						uint32_t FLASH_SR_0_OPTVERRUSR :1;
						uint32_t                      :3;
						uint32_t FLASH_SR_0_NOTZEROERR :1;
						uint32_t FLASH_SR_0_WRPERR    :1;
						uint32_t                      :1;
						uint32_t FLASH_SR_0_STRBERR   :1;
						uint32_t                      :1;
						uint32_t FLASH_SR_0_INCERR    :1;
						uint32_t FLASH_SR_0_OPERR     :1;
						uint32_t FLASH_SR_0_RDPERR    :1;
						uint32_t FLASH_SR_0_RDSERR    :1;
						uint32_t FLASH_SR_0_SNECCERR  :1;
						uint32_t FLASH_SR_0_DBECCERR  :1;
						uint32_t FLASH_SR_0_CRCEND    :1;
						uint32_t                      :4;
					};
					#ifdef FLASH_SR_1
					struct
					{
						uint32_t FLASH_SR_1_EOP       :1;
						uint32_t FLASH_SR_1_OPERR     :1;
						uint32_t FLASH_SR_1_QW        :1;
						uint32_t FLASH_SR_1_READY     :1;
						uint32_t FLASH_SR_1_WRPERR    :1;
						uint32_t FLASH_SR_1_PGAERR    :1;
						uint32_t FLASH_SR_1_SIZERR    :1;
						uint32_t FLASH_SR_1_ERSERR    :1;
						uint32_t FLASH_SR_1_MISERR    :1;
						uint32_t FLASH_SR_1_FASTERR   :1;
						uint32_t                      :3;
						uint32_t FLASH_SR_1_RDERR     :1;
						uint32_t                      :1;
						uint32_t FLASH_SR_1_OPTVERR   :1;
						uint32_t FLASH_SR_1_BSY       :1;
						uint32_t FLASH_SR_1_FWWERR    :1;
						uint32_t FLASH_SR_1_PGSERR    :1;
						uint32_t                      :13;
					};
					#endif
					#ifdef FLASH_SR_2
					struct
					{
						uint32_t                      :1;
						uint32_t FLASH_SR_2_WBNE      :1;
						uint32_t FLASH_SR_2_HVOFF     :1;
						uint32_t FLASH_SR_2_PROGERR   :1;
						uint32_t                      :4;
						uint32_t FLASH_SR_2_WRPERR    :1;
						uint32_t                      :5;
						uint32_t FLASH_SR_2_RDERR     :1;
						uint32_t                      :1;
						uint32_t FLASH_SR_2_EOP       :1;
						uint32_t FLASH_SR_2_FWWER     :1;
						uint32_t                      :14;
					};
					#endif
					#ifdef FLASH_SR_3
					struct
					{
						uint32_t                      :1;
						uint32_t FLASH_SR_3_EOP       :1;
						uint32_t FLASH_SR_3_ENHV      :1;
						uint32_t                      :14;
						uint32_t FLASH_SR_3_PEMPTY    :1;
						uint32_t                      :14;
					};
					#endif
					#ifdef FLASH_SR_4
					struct
					{
						uint32_t                      :2;
						uint32_t ENDHV                :1;
						uint32_t                      :29;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef FLASH_SR2
			struct SR2_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t BSY                  :1;
					uint32_t                      :1;
					uint32_t PGERR                :1;
					uint32_t                      :1;
					uint32_t WRPRTERR             :1;
					uint32_t EOP                  :1;
					uint32_t                      :26;
			
				
			};
			#endif
			
			#ifdef FLASH_WPSN
			struct WPSN_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t WRPSN                :8;
					uint32_t                      :24;
			
				
			};
			#endif
			
			#ifdef FLASH_WRP1AR
			struct WRP1AR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t WRP1A_STRT           :8;
					uint32_t                      :8;
					uint32_t WRP1A_END            :8;
					uint32_t                      :8;
			
				
			};
			#endif
			
			#ifdef FLASH_WRP1BR
			struct WRP1BR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t WRP1B_STRT           :8;
					uint32_t                      :8;
					uint32_t WRP1B_END            :8;
					uint32_t                      :8;
			
				
			};
			#endif
			
			#ifdef FLASH_WRP2AR
			struct WRP2AR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t WRP2A_STRT           :8;
					uint32_t                      :8;
					uint32_t WRP2A_END            :8;
					uint32_t                      :8;
			
				
			};
			#endif
			
			#ifdef FLASH_WRP2BR
			struct WRP2BR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t WRP2B_STRT           :8;
					uint32_t                      :8;
					uint32_t WRP2B_END            :8;
					uint32_t                      :8;
			
				
			};
			#endif
			
			#ifdef FLASH_WRPR
			struct WRPR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					#ifdef FLASH_WRPR_0
					struct
					{
						uint32_t WRP                  :16;
						uint32_t                      :16;
					};
					#endif
					#ifdef FLASH_WRPR_1
					struct
					{
						uint32_t WRP                  :32;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef FLASH_WRPR1
			struct WRPR1_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t WRP                  :32;
			
				
			};
			#endif
			
			#ifdef FLASH_WRPR2
			struct WRPR2_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					#ifdef FLASH_WRPR2_0
					struct
					{
						uint32_t WRP                  :32;
					};
					#endif
					#ifdef FLASH_WRPR2_1
					struct
					{
						uint32_t WRP                  :16;
						uint32_t                      :16;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef FLASH_WRPR3
			struct WRPR3_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t WRP                  :32;
			
				
			};
			#endif
			
			#ifdef FLASH_WRPR4
			struct WRPR4_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					#ifdef FLASH_WRPR4_0
					struct
					{
						uint32_t WRP                  :16;
						uint32_t                      :16;
					};
					#endif
					#ifdef FLASH_WRPR4_1
					struct
					{
						uint32_t WRP                  :32;
					};
					#endif
				};
				
			};
			#endif
			
			union
			{
				
				struct
				{
					ACR_TypeDef ACR;     // @0x000
					FLASH_MAP0_KEYR;     // @0x004
					FLASH_MAP0_OPTKEYR;  // @0x008
					FLASH_MAP0_SR;       // @0x00c
					FLASH_MAP0_CR;       // @0x010
					FLASH_MAP0_AR;       // @0x014
					FLASH_MAP0_OPTCR1;   // @0x018
					FLASH_MAP0_OBR;      // @0x01c
					FLASH_MAP0_WRPR;     // @0x020
					FLASH_MAP0_OPTCCR;   // @0x024
					FLASH_MAP0_PRAR_CUR1; // @0x028
					FLASH_MAP0_PRAR_PRG1; // @0x02c
					FLASH_MAP0_SCAR_CUR1; // @0x030
					FLASH_MAP0_SCAR_PRG1; // @0x034
					FLASH_MAP0_WPSN_CUR1; // @0x038
					FLASH_MAP0_WPSN_PRG1; // @0x03c
					FLASH_MAP0_BOOT_CUR; // @0x040
					FLASH_MAP0_KEYR2;    // @0x044
					FLASH_MAP0_PCROP2ER; // @0x048
					FLASH_MAP0_SR2;      // @0x04c
					FLASH_MAP0_CR2;      // @0x050
					FLASH_MAP0_AR2;      // @0x054
					FLASH_MAP0_CRCEADD1; // @0x058
					FLASH_MAP0_CRCDATA;  // @0x05c
					FLASH_MAP0_ECC_FA1;  // @0x060
					__SOOL_PERIPH_PADDING_16;
					__SOOL_PERIPH_PADDING_8;
					__SOOL_PERIPH_PADDING_4;
					FLASH_MAP0_WRPR2;    // @0x080
					FLASH_MAP0_WRPR3;    // @0x084
					FLASH_MAP0_WRPR4;    // @0x088
					__SOOL_PERIPH_PADDING_128;
					__SOOL_PERIPH_PADDING_8;
					FLASH_MAP0_CCR2;     // @0x114
					__SOOL_PERIPH_PADDING_16;
					FLASH_MAP0_PRAR_CUR2; // @0x128
					FLASH_MAP0_PRAR_PRG2; // @0x12c
					FLASH_MAP0_SCAR_CUR2; // @0x130
					FLASH_MAP0_SCAR_PRG2; // @0x134
					FLASH_MAP0_WPSN_CUR2; // @0x138
					FLASH_MAP0_WPSN_PRG2; // @0x13c
					__SOOL_PERIPH_PADDING_16;
					FLASH_MAP0_CRCCR2;   // @0x150
					FLASH_MAP0_CRCSADD2; // @0x154
					FLASH_MAP0_CRCEADD2; // @0x158
					FLASH_MAP0_CRCDATA2; // @0x15c
					FLASH_MAP0_ECC_FA2;  // @0x160
				};
				struct
				{
					__SOOL_PERIPH_PADDING_4;
					FLASH_MAP1_KEYR1;    // @0x004
					FLASH_MAP1_PDKEYR;   // @0x008
					FLASH_MAP1_CR1;      // @0x00c
					FLASH_MAP1_SR1;      // @0x010
					FLASH_MAP1_OPTCR;    // @0x014
					FLASH_MAP1_SR;       // @0x018
					FLASH_MAP1_OPTCR2;   // @0x01c
					FLASH_MAP1_OPTSR_PRG; // @0x020
					FLASH_MAP1_PCROP1SR; // @0x024
					FLASH_MAP1_PCROP1ER; // @0x028
					FLASH_MAP1_WRP1AR;   // @0x02c
					FLASH_MAP1_WRP1BR;   // @0x030
					__SOOL_PERIPH_PADDING_16;
					FLASH_MAP1_BOOT_PRG; // @0x044
					__SOOL_PERIPH_PADDING_4;
					FLASH_MAP1_WRP2AR;   // @0x04c
					FLASH_MAP1_CRCCR1;   // @0x050
					FLASH_MAP1_CRCSADD1; // @0x054
					__SOOL_PERIPH_PADDING_128;
					__SOOL_PERIPH_PADDING_32;
					__SOOL_PERIPH_PADDING_8;
					__SOOL_PERIPH_PADDING_4;
					FLASH_MAP1_KEYR2;    // @0x104
					__SOOL_PERIPH_PADDING_4;
					FLASH_MAP1_CR2;      // @0x10c
					FLASH_MAP1_SR2;      // @0x110
					__SOOL_PERIPH_PADDING_16;
					__SOOL_PERIPH_PADDING_8;
					__SOOL_PERIPH_PADDING_4;
					FLASH_MAP1_CFGR;     // @0x130
					__SOOL_PERIPH_PADDING_32;
					__SOOL_PERIPH_PADDING_16;
				};
				struct
				{
					__SOOL_PERIPH_PADDING_4;
					FLASH_MAP2_PECR;     // @0x004
					FLASH_MAP2_KEYR;     // @0x008
					FLASH_MAP2_PEKEYR;   // @0x00c
					FLASH_MAP2_PRGKEYR;  // @0x010
					FLASH_MAP2_CCR1;     // @0x014
					FLASH_MAP2_OPTCR;    // @0x018
					FLASH_MAP2_OPTSR_CUR; // @0x01c
					FLASH_MAP2_WRPR1;    // @0x020
					__SOOL_PERIPH_PADDING_32;
					FLASH_MAP2_PCROP2SR; // @0x044
					__SOOL_PERIPH_PADDING_8;
					FLASH_MAP2_WRP2BR;   // @0x050
					__SOOL_PERIPH_PADDING_256;
					__SOOL_PERIPH_PADDING_16;
				};
				struct
				{
					__SOOL_PERIPH_PADDING_4;
					FLASH_MAP3_PDKEYR;   // @0x004
					__SOOL_PERIPH_PADDING_4;
					FLASH_MAP3_OPTKEYR;  // @0x00c
					FLASH_MAP3_SR;       // @0x010
					FLASH_MAP3_CR;       // @0x014
					FLASH_MAP3_ECCR;     // @0x018
					FLASH_MAP3_OPTR;     // @0x01c
					__SOOL_PERIPH_PADDING_256;
					__SOOL_PERIPH_PADDING_64;
					__SOOL_PERIPH_PADDING_4;
				};
				struct
				{
					__SOOL_PERIPH_PADDING_16;
					__SOOL_PERIPH_PADDING_4;
					FLASH_MAP4_OPTKEYR;  // @0x014
					__SOOL_PERIPH_PADDING_8;
					FLASH_MAP4_OPTR;     // @0x020
					__SOOL_PERIPH_PADDING_256;
					__SOOL_PERIPH_PADDING_64;
				};
			};
			private:
			FLASH() = delete;
			
		};
		
		//region instances
#if defined(STM32F0     ) || defined(STM32F1     ) || defined(STM32F3     ) || defined(STM32L0     ) ||\
    defined(STM32L4     ) || defined(STM32L4P    ) 
#define FLASH_BASE_ADDR ((uint32_t)0x40022000U)
#endif

#if defined(STM32F2     ) || defined(STM32F4     ) || defined(STM32F7     ) || defined(STM32L1     ) 
#define FLASH_BASE_ADDR ((uint32_t)0x40023C00U)
#endif

#if defined(STM32H7     ) 
#define FLASH_BASE_ADDR ((uint32_t)0x52002000U)
#endif

#ifdef FLASH_BASE_ADDR
volatile class FLASH * const FLASH = reinterpret_cast<class FLASH* const>(FLASH_BASE_ADDR);
#endif
//endregion



	};
};
//region undef
#undef FLASH_ACR_0_LATENCY
#undef FLASH_ACR_0_ACC64
#undef FLASH_OBR_2_IWDG_SW
#undef FLASH_OBR_2_nRST_STOP
#undef FLASH_OBR_2_nRST_STDBY
#undef FLASH_OBR_3_BOR_LEV
#undef FLASH_MAP2_WRPR1
