/**
 * Copyright (c) 2018 FAUCHER Julien & FRANCE Loic
 * This file is part of SooL core Library.
 *
 *  SooL core Library is free software: you can redistribute it and/or modify
 *  it under the terms of the GNU Lesser General Public License
 *  as published by the Free Software Foundation, either version 3
 *  of the License, or (at your option) any later version.
 *
 *  SooL core Library is distributed in the hope that it will be useful,
 *  but WITHOUT ANY WARRANTY; without even the implied warranty of
 *  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
 *  GNU Lesser General Public License for more details.
 *
 *  You should have received a copy of the GNU Lesser General Public License
 *  along with SooL core Library. If not, see <https://www.gnu.org/licenses/>.
 */
#ifndef __SOOL_RCC_H
#define __SOOL_RCC_H

#include "lib_utils/peripheral_include.h"

//region defines

#if defined(STM32F2     ) || defined(STM32F4     ) || defined(STM32F7     ) || defined(STM32H7     ) || \
    defined(STM32L4     ) || defined(STM32L4P    )
#define RCC_AHB1ENR
#define RCC_AHB1RSTR
#define RCC_PLLCFGR
#endif

#if defined(STM32F2     ) || defined(STM32F4     ) || defined(STM32F7     )
#define RCC_AHB1ENR_0_GPIOAEN GPIOAEN              // 1 bits @ 0
#define RCC_AHB1ENR_0_GPIOBEN GPIOBEN              // 1 bits @ 1
#define RCC_AHB1ENR_0_GPIOCEN GPIOCEN              // 1 bits @ 2
#define RCC_AHB1ENR_0_GPIOHEN GPIOHEN              // 1 bits @ 7

#define RCC_ICSCR_2_HSITRIM
#endif

#if defined(STM32F410Cx ) || defined(STM32F410Rx ) || defined(STM32F410Tx ) || defined(STM32F412Cx ) || \
    defined(STM32F412Rx ) || defined(STM32F412Vx ) || defined(STM32F412Zx ) || defined(STM32F413xx ) || \
    defined(STM32F423xx ) || defined(STM32F446xx ) || defined(STM32F469xx ) || defined(STM32F479xx ) || \
    defined(STM32F765xx ) || defined(STM32F767xx ) || defined(STM32F769xx ) || defined(STM32F777xx ) || \
    defined(STM32F779xx )
#define RCC_PLLCFGR_0_PLLR   PLLR                 // 3 bits @ 28
#else
#define RCC_PLLCFGR_0_PLLR
#endif

#if defined(STM32F411xE ) || defined(STM32F412Cx ) || defined(STM32F412Rx ) || defined(STM32F412Vx ) || \
    defined(STM32F412Zx ) || defined(STM32F413xx ) || defined(STM32F423xx ) || defined(STM32F446xx )
#define RCC_PLLI2SCFGR_PLLI2SM PLLI2SM              // 6 bits @ 0
#else
#define RCC_PLLI2SCFGR_PLLI2SM
#endif

#if defined(STM32F412Cx ) || defined(STM32F412Rx ) || defined(STM32F412Vx ) || defined(STM32F412Zx ) || \
    defined(STM32F413xx ) || defined(STM32F423xx ) || defined(STM32F427xx ) || defined(STM32F429xx ) || \
    defined(STM32F437xx ) || defined(STM32F439xx ) || defined(STM32F446xx ) || defined(STM32F469xx ) || \
    defined(STM32F479xx ) || defined(STM32F7     )
#define RCC_PLLI2SCFGR_PLLI2SQ PLLI2SQ              // 4 bits @ 24
#else
#define RCC_PLLI2SCFGR_PLLI2SQ
#endif

#if defined(STM32F446xx ) || defined(STM32F469xx ) || defined(STM32F479xx ) || defined(STM32F7     )
#define RCC_PLLSAICFGR_PLLSAIP PLLSAIP              // 2 bits @ 16
#else
#define RCC_PLLSAICFGR_PLLSAIP
#endif

#if defined(STM32F2     ) || defined(STM32F4     ) || defined(STM32F7     ) || defined(STM32L1     ) || \
    defined(STM32L4     ) || defined(STM32L4P    )
#define RCC_MAP1_CFGR        CFGR_TypeDef CFGR
#else
#define RCC_MAP1_CFGR __SOOL_PERIPH_PADDING_4
#endif

#if defined(STM32F2     ) || defined(STM32F401xC ) || defined(STM32F401xE ) || defined(STM32F405xx ) || \
    defined(STM32F407xx ) || defined(STM32F411xE ) || defined(STM32F412Rx ) || defined(STM32F412Vx ) || \
    defined(STM32F412Zx ) || defined(STM32F413xx ) || defined(STM32F415xx ) || defined(STM32F417xx ) || \
    defined(STM32F423xx ) || defined(STM32F427xx ) || defined(STM32F429xx ) || defined(STM32F437xx ) || \
    defined(STM32F439xx ) || defined(STM32F446xx ) || defined(STM32F469xx ) || defined(STM32F479xx ) || \
    defined(STM32F7     )
#define RCC_MAP1_AHB3RSTR    AHB3RSTR_TypeDef AHB3RSTR
#define RCC_MAP0_AHB3ENR     AHB3ENR_TypeDef AHB3ENR
#define RCC_MAP0_AHB3LPENR   AHB3LPENR_TypeDef AHB3LPENR
#else
#define RCC_MAP1_AHB3RSTR __SOOL_PERIPH_PADDING_4
#define RCC_MAP0_AHB3ENR __SOOL_PERIPH_PADDING_4
#define RCC_MAP0_AHB3LPENR __SOOL_PERIPH_PADDING_4
#endif

#if defined(STM32F2     ) || defined(STM32F4     ) || defined(STM32F7     ) || defined(STM32L0     )
#define RCC_MAP1_APB2RSTR    APB2RSTR_TypeDef APB2RSTR
#else
#define RCC_MAP1_APB2RSTR __SOOL_PERIPH_PADDING_4
#endif

//endregion

namespace sool
{
	namespace ll
	{

		class RCC
		{


		public :

#ifdef RCC_AHB1ENR
			struct AHB1ENR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

				union
				{
					struct
					{
						uint32_t RCC_AHB1ENR_0_GPIOAEN :1;
						uint32_t RCC_AHB1ENR_0_GPIOBEN :1;
						uint32_t RCC_AHB1ENR_0_GPIOCEN :1;
						uint32_t RCC_AHB1ENR_0_GPIODEN :1;
						uint32_t RCC_AHB1ENR_0_GPIOEEN :1;
						uint32_t RCC_AHB1ENR_0_GPIOFEN :1;
						uint32_t RCC_AHB1ENR_0_GPIOGEN :1;
						uint32_t RCC_AHB1ENR_0_GPIOHEN :1;
						uint32_t RCC_AHB1ENR_0_GPIOIEN :1;
						uint32_t RCC_AHB1ENR_0_GPIOJEN :1;
						uint32_t RCC_AHB1ENR_0_GPIOKEN :1;
						uint32_t                      :1;
						uint32_t RCC_AHB1ENR_0_CRCEN  :1;
						uint32_t                      :2;
						uint32_t RCC_AHB1ENR_0_ETH1MACEN :1;
						uint32_t RCC_AHB1ENR_0_ETH1TXEN :1;
						uint32_t RCC_AHB1ENR_0_ETH1RXEN :1;
						uint32_t RCC_AHB1ENR_0_BKPSRAMEN :1;
						uint32_t                      :1;
						uint32_t RCC_AHB1ENR_0_CCMDATARAMEN :1;
						uint32_t RCC_AHB1ENR_0_DMA1EN :1;
						uint32_t RCC_AHB1ENR_0_DMA2EN :1;
						uint32_t RCC_AHB1ENR_0_DMA2DEN :1;
						uint32_t                      :1;
						uint32_t RCC_AHB1ENR_0_ETHMACEN :1;
						uint32_t RCC_AHB1ENR_0_ETHMACTXEN :1;
						uint32_t RCC_AHB1ENR_0_ETHMACRXEN :1;
						uint32_t RCC_AHB1ENR_0_ETHMACPTPEN :1;
						uint32_t RCC_AHB1ENR_0_OTGHSEN :1;
						uint32_t RCC_AHB1ENR_0_OTGHSULPIEN :1;
						uint32_t RCC_AHB1ENR_0_RNGEN  :1;
					};
#ifdef RCC_AHB1ENR_1
					struct
					{
						uint32_t RCC_AHB1ENR_1_DMA1EN :1;
						uint32_t RCC_AHB1ENR_1_DMA2EN :1;
						uint32_t RCC_AHB1ENR_1_DMAMUX1EN :1;
						uint32_t                      :2;
						uint32_t RCC_AHB1ENR_1_ADC12EN :1;
						uint32_t                      :2;
						uint32_t RCC_AHB1ENR_1_FLASHEN :1;
						uint32_t                      :7;
						uint32_t RCC_AHB1ENR_1_TSCEN  :1;
						uint32_t RCC_AHB1ENR_1_DMA2DEN :1;
						uint32_t RCC_AHB1ENR_1_GFXMMUEN :1;
						uint32_t                      :1;
						uint32_t RCC_AHB1ENR_1_DTCMRAMEN :1;
						uint32_t                      :4;
						uint32_t RCC_AHB1ENR_1_USB1OTGHSEN :1;
						uint32_t RCC_AHB1ENR_1_USB1OTGHSULPIEN :1;
						uint32_t RCC_AHB1ENR_1_USB2OTGHSEN :1;
						uint32_t RCC_AHB1ENR_1_USB2OTGHSULPIEN :1;
						uint32_t                      :3;
					};
#endif
				};

			};
#endif

#ifdef RCC_AHB1LPENR
			struct AHB1LPENR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

				union
				{
#ifdef RCC_AHB1LPENR_0
					struct
					{
						uint32_t GPIOALPEN            :1;
						uint32_t GPIOBLPEN            :1;
						uint32_t GPIOCLPEN            :1;
						uint32_t RCC_AHB1LPENR_0_GPIODLPEN :1;
						uint32_t RCC_AHB1LPENR_0_GPIOELPEN :1;
						uint32_t RCC_AHB1LPENR_0_GPIOFLPEN :1;
						uint32_t RCC_AHB1LPENR_0_GPIOGLPEN :1;
						uint32_t GPIOHLPEN            :1;
						uint32_t RCC_AHB1LPENR_0_GPIOILPEN :1;
						uint32_t RCC_AHB1LPENR_0_GPIOJLPEN :1;
						uint32_t RCC_AHB1LPENR_0_GPIOKLPEN :1;
						uint32_t                      :1;
						uint32_t CRCLPEN              :1;
						uint32_t RCC_AHB1LPENR_0_AXILPEN :1;
						uint32_t                      :1;
						uint32_t FLITFLPEN            :1;
						uint32_t SRAM1LPEN            :1;
						uint32_t RCC_AHB1LPENR_0_SRAM2LPEN :1;
						uint32_t RCC_AHB1LPENR_0_BKPSRAMLPEN :1;
						uint32_t RCC_AHB1LPENR_0_SRAM3LPEN :1;
						uint32_t RCC_AHB1LPENR_0_DTCMLPEN :1;
						uint32_t DMA1LPEN             :1;
						uint32_t DMA2LPEN             :1;
						uint32_t RCC_AHB1LPENR_0_DMA2DLPEN :1;
						uint32_t                      :1;
						uint32_t RCC_AHB1LPENR_0_ETHMACLPEN :1;
						uint32_t RCC_AHB1LPENR_0_ETHMACTXLPEN :1;
						uint32_t RCC_AHB1LPENR_0_ETHMACRXLPEN :1;
						uint32_t RCC_AHB1LPENR_0_ETHMACPTPLPEN :1;
						uint32_t RCC_AHB1LPENR_0_OTGHSLPEN :1;
						uint32_t RCC_AHB1LPENR_0_OTGHSULPILPEN :1;
						uint32_t RCC_AHB1LPENR_0_RNGLPEN :1;
					};
#endif
#ifdef RCC_AHB1LPENR_1
					struct
					{
						uint32_t DMA1LPEN             :1;
						uint32_t DMA2LPEN             :1;
						uint32_t                      :3;
						uint32_t ADC12LPEN            :1;
						uint32_t                      :9;
						uint32_t ETH1MACLPEN          :1;
						uint32_t ETH1TXLPEN           :1;
						uint32_t ETH1RXLPEN           :1;
						uint32_t                      :7;
						uint32_t USB1OTGHSLPEN        :1;
						uint32_t USB1OTGHSULPILPEN    :1;
						uint32_t USB2OTGHSLPEN        :1;
						uint32_t USB2OTGHSULPILPEN    :1;
						uint32_t                      :3;
					};
#endif
				};

			};
#endif

#ifdef RCC_AHB1RSTR
			struct AHB1RSTR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

				union
				{
					struct
					{
						uint32_t RCC_AHB1RSTR_0_GPIOARST :1;
						uint32_t RCC_AHB1RSTR_0_GPIOBRST :1;
						uint32_t RCC_AHB1RSTR_0_GPIOCRST :1;
						uint32_t RCC_AHB1RSTR_0_GPIODRST :1;
						uint32_t RCC_AHB1RSTR_0_GPIOERST :1;
						uint32_t RCC_AHB1RSTR_0_GPIOFRST :1;
						uint32_t RCC_AHB1RSTR_0_GPIOGRST :1;
						uint32_t RCC_AHB1RSTR_0_GPIOHRST :1;
						uint32_t RCC_AHB1RSTR_0_GPIOIRST :1;
						uint32_t RCC_AHB1RSTR_0_GPIOJRST :1;
						uint32_t RCC_AHB1RSTR_0_GPIOKRST :1;
						uint32_t                      :1;
						uint32_t RCC_AHB1RSTR_0_CRCRST :1;
						uint32_t                      :2;
						uint32_t RCC_AHB1RSTR_0_ETH1MACRST :1;
						uint32_t RCC_AHB1RSTR_0_TSCRST :1;
						uint32_t                      :1;
						uint32_t RCC_AHB1RSTR_0_GFXMMURST :1;
						uint32_t                      :2;
						uint32_t RCC_AHB1RSTR_0_DMA1RST :1;
						uint32_t RCC_AHB1RSTR_0_DMA2RST :1;
						uint32_t RCC_AHB1RSTR_0_DMA2DRST :1;
						uint32_t                      :1;
						uint32_t RCC_AHB1RSTR_0_ETHMACRST :1;
						uint32_t                      :1;
						uint32_t RCC_AHB1RSTR_0_USB2OTGHSRST :1;
						uint32_t                      :1;
						uint32_t RCC_AHB1RSTR_0_OTGHRST :1;
						uint32_t                      :1;
						uint32_t RCC_AHB1RSTR_0_RNGRST :1;
					};
#ifdef RCC_AHB1RSTR_1
					struct
					{
						uint32_t DMA1RST              :1;
						uint32_t DMA2RST              :1;
						uint32_t RCC_AHB1RSTR_1_DMAMUX1RST :1;
						uint32_t                      :2;
						uint32_t RCC_AHB1RSTR_1_ADC12RST :1;
						uint32_t                      :2;
						uint32_t RCC_AHB1RSTR_1_FLASHRST :1;
						uint32_t                      :8;
						uint32_t RCC_AHB1RSTR_1_DMA2DRST :1;
						uint32_t                      :7;
						uint32_t RCC_AHB1RSTR_1_USB1OTGHSRST :1;
						uint32_t                      :6;
					};
#endif
				};

			};
#endif

#ifdef RCC_AHB1SMENR
			struct AHB1SMENR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t DMA1SMEN             :1;
					uint32_t DMA2SMEN             :1;
					uint32_t RCC_AHB1SMENR_DMAMUX1SMEN :1;
					uint32_t                      :5;
					uint32_t FLASHSMEN            :1;
					uint32_t SRAM1SMEN            :1;
					uint32_t                      :2;
					uint32_t CRCSMEN              :1;
					uint32_t                      :3;
					uint32_t TSCSMEN              :1;
					uint32_t RCC_AHB1SMENR_DMA2DSMEN :1;
					uint32_t RCC_AHB1SMENR_GFXMMUSMEN :1;
					uint32_t                      :13;


			};
#endif

#ifdef RCC_AHB2ENR
			struct AHB2ENR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

				union
				{
					struct
					{
						uint32_t RCC_AHB2ENR_0_DCMIEN :1;
						uint32_t RCC_AHB2ENR_0_JPEGEN :1;
						uint32_t RCC_AHB2ENR_0_GPIOCEN :1;
						uint32_t RCC_AHB2ENR_0_GPIODEN :1;
						uint32_t RCC_AHB2ENR_0_CRYPEN :1;
						uint32_t RCC_AHB2ENR_0_HASHEN :1;
						uint32_t RCC_AHB2ENR_0_RNGEN  :1;
						uint32_t RCC_AHB2ENR_0_OTGFSEN :1;
						uint32_t RCC_AHB2ENR_0_GPIOIEN :1;
						uint32_t RCC_AHB2ENR_0_SDMMC2EN :1;
						uint32_t                      :3;
						uint32_t RCC_AHB2ENR_0_ADCEN  :1;
						uint32_t                      :2;
						uint32_t RCC_AHB2ENR_0_AESEN  :1;
						uint32_t                      :3;
						uint32_t RCC_AHB2ENR_0_OSPIMEN :1;
						uint32_t                      :1;
						uint32_t RCC_AHB2ENR_0_SDMMC1EN :1;
						uint32_t                      :6;
						uint32_t RCC_AHB2ENR_0_D2SRAM1EN :1;
						uint32_t RCC_AHB2ENR_0_D2SRAM2EN :1;
						uint32_t RCC_AHB2ENR_0_D2SRAM3EN :1;
					};
#ifdef RCC_AHB2ENR_1
					struct
					{
						uint32_t RCC_AHB2ENR_1_GPIOAEN :1;
						uint32_t RCC_AHB2ENR_1_GPIOBEN :1;
						uint32_t                      :2;
						uint32_t RCC_AHB2ENR_1_AESEN  :1;
						uint32_t RCC_AHB2ENR_1_GPIOFEN :1;
						uint32_t RCC_AHB2ENR_1_GPIOGEN :1;
						uint32_t RCC_AHB2ENR_1_GPIOHEN :1;
						uint32_t                      :4;
						uint32_t RCC_AHB2ENR_1_OTGFSEN :1;
						uint32_t                      :1;
						uint32_t RCC_AHB2ENR_1_DCMIEN :1;
						uint32_t                      :2;
						uint32_t RCC_AHB2ENR_1_HASHEN :1;
						uint32_t RCC_AHB2ENR_1_RNGEN  :1;
						uint32_t                      :13;
					};
#endif
#ifdef RCC_AHB2ENR_2
					struct
					{
						uint32_t                      :4;
						uint32_t GPIOEEN              :1;
						uint32_t                      :27;
					};
#endif
				};

			};
#endif

#ifdef RCC_AHB2LPENR
			struct AHB2LPENR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

				union
				{
					struct
					{
						uint32_t RCC_AHB2LPENR_0_DCMILPEN :1;
						uint32_t RCC_AHB2LPENR_0_JPEGLPEN :1;
						uint32_t                      :2;
						uint32_t RCC_AHB2LPENR_0_CRYPLPEN :1;
						uint32_t RCC_AHB2LPENR_0_HASHLPEN :1;
						uint32_t RCC_AHB2LPENR_0_RNGLPEN :1;
						uint32_t RCC_AHB2LPENR_0_OTGFSLPEN :1;
						uint32_t                      :1;
						uint32_t RCC_AHB2LPENR_0_SDMMC2LPEN :1;
						uint32_t                      :20;
						uint32_t RCC_AHB2LPENR_0_D2SRAM1LPEN :1;
						uint32_t RCC_AHB2LPENR_0_D2SRAM3LPEN :1;
					};
#ifdef RCC_AHB2LPENR_1
					struct
					{
						uint32_t                      :4;
						uint32_t RCC_AHB2LPENR_1_AESLPEN :1;
						uint32_t                      :25;
						uint32_t RCC_AHB2LPENR_1_D2SRAM2LPEN :1;
						uint32_t                      :1;
					};
#endif
				};

			};
#endif

#ifdef RCC_AHB2RSTR
			struct AHB2RSTR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

				union
				{
					struct
					{
						uint32_t RCC_AHB2RSTR_0_DCMIRST :1;
						uint32_t RCC_AHB2RSTR_0_JPEGRST :1;
						uint32_t RCC_AHB2RSTR_0_GPIOCRST :1;
						uint32_t RCC_AHB2RSTR_0_GPIODRST :1;
						uint32_t RCC_AHB2RSTR_0_CRYPRST :1;
						uint32_t RCC_AHB2RSTR_0_HASHRST :1;
						uint32_t RCC_AHB2RSTR_0_RNGRST :1;
						uint32_t RCC_AHB2RSTR_0_OTGFSRST :1;
						uint32_t RCC_AHB2RSTR_0_GPIOIRST :1;
						uint32_t RCC_AHB2RSTR_0_SDMMC2RST :1;
						uint32_t                      :3;
						uint32_t RCC_AHB2RSTR_0_ADCRST :1;
						uint32_t                      :2;
						uint32_t RCC_AHB2RSTR_0_AESRST :1;
						uint32_t                      :3;
						uint32_t RCC_AHB2RSTR_0_OSPIMRST :1;
						uint32_t                      :1;
						uint32_t RCC_AHB2RSTR_0_SDMMC1RST :1;
						uint32_t                      :9;
					};
#ifdef RCC_AHB2RSTR_1
					struct
					{
						uint32_t RCC_AHB2RSTR_1_GPIOARST :1;
						uint32_t RCC_AHB2RSTR_1_GPIOBRST :1;
						uint32_t                      :2;
						uint32_t RCC_AHB2RSTR_1_AESRST :1;
						uint32_t RCC_AHB2RSTR_1_GPIOFRST :1;
						uint32_t RCC_AHB2RSTR_1_GPIOGRST :1;
						uint32_t RCC_AHB2RSTR_1_GPIOHRST :1;
						uint32_t                      :4;
						uint32_t RCC_AHB2RSTR_1_OTGFSRST :1;
						uint32_t                      :1;
						uint32_t RCC_AHB2RSTR_1_DCMIRST :1;
						uint32_t                      :2;
						uint32_t RCC_AHB2RSTR_1_HASHRST :1;
						uint32_t RCC_AHB2RSTR_1_RNGRST :1;
						uint32_t                      :13;
					};
#endif
#ifdef RCC_AHB2RSTR_2
					struct
					{
						uint32_t                      :4;
						uint32_t GPIOERST             :1;
						uint32_t                      :27;
					};
#endif
				};

			};
#endif

#ifdef RCC_AHB2SMENR
			struct AHB2SMENR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t GPIOASMEN            :1;
					uint32_t GPIOBSMEN            :1;
					uint32_t GPIOCSMEN            :1;
					uint32_t RCC_AHB2SMENR_GPIODSMEN :1;
					uint32_t RCC_AHB2SMENR_GPIOESMEN :1;
					uint32_t RCC_AHB2SMENR_GPIOFSMEN :1;
					uint32_t RCC_AHB2SMENR_GPIOGSMEN :1;
					uint32_t GPIOHSMEN            :1;
					uint32_t RCC_AHB2SMENR_GPIOISMEN :1;
					uint32_t SRAM2SMEN            :1;
					uint32_t RCC_AHB2SMENR_SRAM3SMEN :1;
					uint32_t                      :1;
					uint32_t RCC_AHB2SMENR_OTGFSSMEN :1;
					uint32_t ADCSMEN              :1;
					uint32_t RCC_AHB2SMENR_DCMISMEN :1;
					uint32_t                      :1;
					uint32_t RCC_AHB2SMENR_AESSMEN :1;
					uint32_t RCC_AHB2SMENR_HASHSMEN :1;
					uint32_t RNGSMEN              :1;
					uint32_t                      :1;
					uint32_t RCC_AHB2SMENR_OSPIMSMEN :1;
					uint32_t                      :1;
					uint32_t RCC_AHB2SMENR_SDMMC1SMEN :1;
					uint32_t                      :9;


			};
#endif

#ifdef RCC_AHB3ENR
			struct AHB3ENR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

				union
				{
#ifdef RCC_AHB3ENR_0
					struct
					{
						uint32_t RCC_AHB3ENR_0_FSMCEN :1;
						uint32_t RCC_AHB3ENR_0_QSPIEN :1;
						uint32_t                      :2;
						uint32_t RCC_AHB3ENR_0_DMA2DEN :1;
						uint32_t RCC_AHB3ENR_0_JPGDECEN :1;
						uint32_t                      :2;
						uint32_t RCC_AHB3ENR_0_OSPI1EN :1;
						uint32_t RCC_AHB3ENR_0_OSPI2EN :1;
						uint32_t                      :2;
						uint32_t RCC_AHB3ENR_0_FMCEN  :1;
						uint32_t                      :3;
						uint32_t RCC_AHB3ENR_0_SDMMC1EN :1;
						uint32_t                      :15;
					};
#endif
#ifdef RCC_AHB3ENR_1
					struct
					{
						uint32_t RCC_AHB3ENR_1_FMCEN  :1;
						uint32_t                      :13;
						uint32_t RCC_AHB3ENR_1_QSPIEN :1;
						uint32_t                      :17;
					};
#endif
#ifdef RCC_AHB3ENR_2
					struct
					{
						uint32_t RCC_AHB3ENR_2_MDMAEN :1;
						uint32_t                      :7;
						uint32_t RCC_AHB3ENR_2_QSPIEN :1;
						uint32_t                      :23;
					};
#endif
				};

			};
#endif

#ifdef RCC_AHB3LPENR
			struct AHB3LPENR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

				union
				{
#ifdef RCC_AHB3LPENR_0
					struct
					{
						uint32_t RCC_AHB3LPENR_0_FSMCLPEN :1;
						uint32_t RCC_AHB3LPENR_0_QSPILPEN :1;
						uint32_t                      :2;
						uint32_t RCC_AHB3LPENR_0_DMA2DLPEN :1;
						uint32_t RCC_AHB3LPENR_0_JPGDECLPEN :1;
						uint32_t                      :2;
						uint32_t RCC_AHB3LPENR_0_FLASHLPEN :1;
						uint32_t                      :3;
						uint32_t RCC_AHB3LPENR_0_FMCLPEN :1;
						uint32_t                      :3;
						uint32_t RCC_AHB3LPENR_0_SDMMC1LPEN :1;
						uint32_t                      :11;
						uint32_t RCC_AHB3LPENR_0_DTCM1LPEN :1;
						uint32_t RCC_AHB3LPENR_0_DTCM2LPEN :1;
						uint32_t RCC_AHB3LPENR_0_ITCMLPEN :1;
						uint32_t RCC_AHB3LPENR_0_AXISRAMLPEN :1;
					};
#endif
#ifdef RCC_AHB3LPENR_1
					struct
					{
						uint32_t RCC_AHB3LPENR_1_FMCLPEN :1;
						uint32_t                      :13;
						uint32_t RCC_AHB3LPENR_1_QSPILPEN :1;
						uint32_t                      :17;
					};
#endif
#ifdef RCC_AHB3LPENR_2
					struct
					{
						uint32_t MDMALPEN             :1;
						uint32_t                      :31;
					};
#endif
				};

			};
#endif

#ifdef RCC_AHB3RSTR
			struct AHB3RSTR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

				union
				{
#ifdef RCC_AHB3RSTR_0
					struct
					{
						uint32_t RCC_AHB3RSTR_0_FSMCRST :1;
						uint32_t RCC_AHB3RSTR_0_QSPIRST :1;
						uint32_t                      :2;
						uint32_t RCC_AHB3RSTR_0_DMA2DRST :1;
						uint32_t RCC_AHB3RSTR_0_JPGDECRST :1;
						uint32_t                      :2;
						uint32_t RCC_AHB3RSTR_0_OSPI1RST :1;
						uint32_t RCC_AHB3RSTR_0_OSPI2RST :1;
						uint32_t                      :2;
						uint32_t RCC_AHB3RSTR_0_FMCRST :1;
						uint32_t                      :3;
						uint32_t RCC_AHB3RSTR_0_SDMMC1RST :1;
						uint32_t                      :14;
						uint32_t RCC_AHB3RSTR_0_CPURST :1;
					};
#endif
#ifdef RCC_AHB3RSTR_1
					struct
					{
						uint32_t RCC_AHB3RSTR_1_FMCRST :1;
						uint32_t                      :13;
						uint32_t RCC_AHB3RSTR_1_QSPIRST :1;
						uint32_t                      :17;
					};
#endif
#ifdef RCC_AHB3RSTR_2
					struct
					{
						uint32_t RCC_AHB3RSTR_2_MDMARST :1;
						uint32_t                      :7;
						uint32_t RCC_AHB3RSTR_2_QSPIRST :1;
						uint32_t                      :23;
					};
#endif
				};

			};
#endif

#ifdef RCC_AHB3SMENR
			struct AHB3SMENR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

				union
				{
					struct
					{
						uint32_t RCC_AHB3SMENR_0_FMCSMEN :1;
						uint32_t                      :7;
						uint32_t RCC_AHB3SMENR_0_QSPISMEN :1;
						uint32_t RCC_AHB3SMENR_0_OSPI2SMEN :1;
						uint32_t                      :22;
					};
#ifdef RCC_AHB3SMENR_1
					struct
					{
						uint32_t                      :8;
						uint32_t OSPI1SMEN            :1;
						uint32_t                      :23;
					};
#endif
				};

			};
#endif

#ifdef RCC_AHB4ENR
			struct AHB4ENR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t GPIOAEN              :1;
					uint32_t GPIOBEN              :1;
					uint32_t GPIOCEN              :1;
					uint32_t GPIODEN              :1;
					uint32_t GPIOEEN              :1;
					uint32_t GPIOFEN              :1;
					uint32_t GPIOGEN              :1;
					uint32_t GPIOHEN              :1;
					uint32_t GPIOIEN              :1;
					uint32_t GPIOJEN              :1;
					uint32_t GPIOKEN              :1;
					uint32_t                      :8;
					uint32_t CRCEN                :1;
					uint32_t                      :1;
					uint32_t BDMAEN               :1;
					uint32_t                      :2;
					uint32_t ADC3EN               :1;
					uint32_t HSEMEN               :1;
					uint32_t                      :2;
					uint32_t BKPRAMEN             :1;
					uint32_t D3SRAM1EN            :1;
					uint32_t                      :2;


			};
#endif

#ifdef RCC_AHB4LPENR
			struct AHB4LPENR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t GPIOALPEN            :1;
					uint32_t GPIOBLPEN            :1;
					uint32_t GPIOCLPEN            :1;
					uint32_t GPIODLPEN            :1;
					uint32_t GPIOELPEN            :1;
					uint32_t GPIOFLPEN            :1;
					uint32_t GPIOGLPEN            :1;
					uint32_t GPIOHLPEN            :1;
					uint32_t GPIOILPEN            :1;
					uint32_t GPIOJLPEN            :1;
					uint32_t GPIOKLPEN            :1;
					uint32_t                      :8;
					uint32_t CRCLPEN              :1;
					uint32_t                      :1;
					uint32_t BDMALPEN             :1;
					uint32_t                      :2;
					uint32_t ADC3LPEN             :1;
					uint32_t                      :3;
					uint32_t BKPRAMLPEN           :1;
					uint32_t D3SRAM1LPEN          :1;
					uint32_t                      :2;


			};
#endif

#ifdef RCC_AHB4RSTR
			struct AHB4RSTR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t GPIOARST             :1;
					uint32_t GPIOBRST             :1;
					uint32_t GPIOCRST             :1;
					uint32_t GPIODRST             :1;
					uint32_t GPIOERST             :1;
					uint32_t GPIOFRST             :1;
					uint32_t GPIOGRST             :1;
					uint32_t GPIOHRST             :1;
					uint32_t GPIOIRST             :1;
					uint32_t GPIOJRST             :1;
					uint32_t GPIOKRST             :1;
					uint32_t                      :8;
					uint32_t CRCRST               :1;
					uint32_t                      :1;
					uint32_t BDMARST              :1;
					uint32_t                      :2;
					uint32_t ADC3RST              :1;
					uint32_t HSEMRST              :1;
					uint32_t                      :6;


			};
#endif

#ifdef RCC_AHBENR
			struct AHBENR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

				union
				{
#ifdef RCC_AHBENR_0
					struct
					{
						uint32_t RCC_AHBENR_0_DMAEN   :1;
						uint32_t RCC_AHBENR_0_DMA2EN  :1;
						uint32_t RCC_AHBENR_0_SRAMEN  :1;
						uint32_t                      :1;
						uint32_t RCC_AHBENR_0_FLITFEN :1;
						uint32_t RCC_AHBENR_0_FMCEN   :1;
						uint32_t RCC_AHBENR_0_CRCEN   :1;
						uint32_t                      :1;
						uint32_t RCC_AHBENR_0_FSMCEN  :1;
						uint32_t                      :1;
						uint32_t RCC_AHBENR_0_SDIOEN  :1;
						uint32_t                      :1;
						uint32_t RCC_AHBENR_0_OTGFSEN :1;
						uint32_t                      :1;
						uint32_t RCC_AHBENR_0_ETHMACEN :1;
						uint32_t RCC_AHBENR_0_ETHMACTXEN :1;
						uint32_t RCC_AHBENR_0_ETHMACRXEN :1;
						uint32_t RCC_AHBENR_0_GPIOAEN :1;
						uint32_t RCC_AHBENR_0_GPIOBEN :1;
						uint32_t RCC_AHBENR_0_GPIOCEN :1;
						uint32_t RCC_AHBENR_0_GPIODEN :1;
						uint32_t RCC_AHBENR_0_GPIOEEN :1;
						uint32_t RCC_AHBENR_0_GPIOFEN :1;
						uint32_t RCC_AHBENR_0_GPIOGEN :1;
						uint32_t RCC_AHBENR_0_TSCEN   :1;
						uint32_t                      :2;
						uint32_t RCC_AHBENR_0_AESEN   :1;
						uint32_t RCC_AHBENR_0_ADC1EN  :1;
						uint32_t RCC_AHBENR_0_ADC34EN :1;
						uint32_t                      :2;
					};
#endif
#ifdef RCC_AHBENR_1
					struct
					{
						uint32_t RCC_AHBENR_1_DMA1EN  :1;
						uint32_t RCC_AHBENR_1_GPIOBEN :1;
						uint32_t RCC_AHBENR_1_GPIOCEN :1;
						uint32_t RCC_AHBENR_1_GPIODEN :1;
						uint32_t RCC_AHBENR_1_GPIOEEN :1;
						uint32_t                      :1;
						uint32_t RCC_AHBENR_1_GPIOFEN :1;
						uint32_t RCC_AHBENR_1_GPIOGEN :1;
						uint32_t RCC_AHBENR_1_MIFEN   :1;
						uint32_t                      :3;
						uint32_t RCC_AHBENR_1_CRCEN   :1;
						uint32_t                      :2;
						uint32_t RCC_AHBENR_1_FLITFEN :1;
						uint32_t RCC_AHBENR_1_GPIOHEN :1;
						uint32_t                      :3;
						uint32_t RCC_AHBENR_1_RNGEN   :1;
						uint32_t                      :3;
						uint32_t RCC_AHBENR_1_TSEN    :1;
						uint32_t RCC_AHBENR_1_DMA2EN  :1;
						uint32_t                      :2;
						uint32_t RCC_AHBENR_1_ADC12EN :1;
						uint32_t                      :1;
						uint32_t RCC_AHBENR_1_FSMCEN  :1;
						uint32_t                      :1;
					};
#endif
#ifdef RCC_AHBENR_2
					struct
					{
						uint32_t RCC_AHBENR_2_GPIOAEN :1;
						uint32_t                      :4;
						uint32_t RCC_AHBENR_2_GPIOHEN :1;
						uint32_t                      :10;
						uint32_t RCC_AHBENR_2_TSCEN   :1;
						uint32_t                      :7;
						uint32_t RCC_AHBENR_2_CRYPEN  :1;
						uint32_t                      :7;
					};
#endif
#ifdef RCC_AHBENR_3
					struct
					{
						uint32_t                      :24;
						uint32_t DMA1EN               :1;
						uint32_t                      :7;
					};
#endif
				};

			};
#endif

#ifdef RCC_AHBLPENR
			struct AHBLPENR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t GPIOALPEN            :1;
					uint32_t GPIOBLPEN            :1;
					uint32_t GPIOCLPEN            :1;
					uint32_t GPIODLPEN            :1;
					uint32_t RCC_AHBLPENR_GPIOELPEN :1;
					uint32_t GPIOHLPEN            :1;
					uint32_t RCC_AHBLPENR_GPIOFLPEN :1;
					uint32_t RCC_AHBLPENR_GPIOGLPEN :1;
					uint32_t                      :4;
					uint32_t CRCLPEN              :1;
					uint32_t                      :2;
					uint32_t FLITFLPEN            :1;
					uint32_t SRAMLPEN             :1;
					uint32_t                      :7;
					uint32_t DMA1LPEN             :1;
					uint32_t RCC_AHBLPENR_DMA2LPEN :1;
					uint32_t                      :1;
					uint32_t RCC_AHBLPENR_AESLPEN :1;
					uint32_t                      :2;
					uint32_t RCC_AHBLPENR_FSMCLPEN :1;
					uint32_t                      :1;


			};
#endif

#ifdef RCC_AHBRSTR
			struct AHBRSTR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

				union
				{
					struct
					{
						uint32_t RCC_AHBRSTR_0_DMARST :1;
						uint32_t                      :4;
						uint32_t RCC_AHBRSTR_0_FMCRST :1;
						uint32_t                      :2;
						uint32_t RCC_AHBRSTR_0_MIFRST :1;
						uint32_t                      :3;
						uint32_t RCC_AHBRSTR_0_OTGFSRST :1;
						uint32_t                      :1;
						uint32_t RCC_AHBRSTR_0_ETHMACRST :1;
						uint32_t RCC_AHBRSTR_0_FLITFRST :1;
						uint32_t RCC_AHBRSTR_0_GPIOHRST :1;
						uint32_t RCC_AHBRSTR_0_GPIOARST :1;
						uint32_t RCC_AHBRSTR_0_GPIOBRST :1;
						uint32_t RCC_AHBRSTR_0_GPIOCRST :1;
						uint32_t RCC_AHBRSTR_0_GPIODRST :1;
						uint32_t RCC_AHBRSTR_0_GPIOERST :1;
						uint32_t RCC_AHBRSTR_0_GPIOFRST :1;
						uint32_t RCC_AHBRSTR_0_GPIOGRST :1;
						uint32_t RCC_AHBRSTR_0_TSCRST :1;
						uint32_t RCC_AHBRSTR_0_DMA2RST :1;
						uint32_t                      :1;
						uint32_t RCC_AHBRSTR_0_AESRST :1;
						uint32_t RCC_AHBRSTR_0_ADC1RST :1;
						uint32_t RCC_AHBRSTR_0_ADC34RST :1;
						uint32_t RCC_AHBRSTR_0_FSMCRST :1;
						uint32_t                      :1;
					};
#ifdef RCC_AHBRSTR_1
					struct
					{
						uint32_t RCC_AHBRSTR_1_DMA1RST :1;
						uint32_t RCC_AHBRSTR_1_GPIOBRST :1;
						uint32_t RCC_AHBRSTR_1_GPIOCRST :1;
						uint32_t RCC_AHBRSTR_1_GPIODRST :1;
						uint32_t RCC_AHBRSTR_1_GPIOERST :1;
						uint32_t RCC_AHBRSTR_1_GPIOHRST :1;
						uint32_t RCC_AHBRSTR_1_GPIOFRST :1;
						uint32_t RCC_AHBRSTR_1_GPIOGRST :1;
						uint32_t                      :4;
						uint32_t RCC_AHBRSTR_1_CRCRST :1;
						uint32_t                      :3;
						uint32_t RCC_AHBRSTR_1_TSCRST :1;
						uint32_t                      :3;
						uint32_t RCC_AHBRSTR_1_RNGRST :1;
						uint32_t                      :3;
						uint32_t RCC_AHBRSTR_1_CRYPRST :1;
						uint32_t                      :3;
						uint32_t RCC_AHBRSTR_1_ADC12RST :1;
						uint32_t                      :3;
					};
#endif
#ifdef RCC_AHBRSTR_2
					struct
					{
						uint32_t GPIOARST             :1;
						uint32_t                      :23;
						uint32_t DMA1RST              :1;
						uint32_t                      :7;
					};
#endif
				};

			};
#endif

#ifdef RCC_AHBSMENR
			struct AHBSMENR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

				union
				{
					struct
					{
						uint32_t DMASMEN              :1;
						uint32_t                      :7;
						uint32_t MIFSMEN              :1;
						uint32_t SRAMSMEN             :1;
						uint32_t                      :2;
						uint32_t CRCSMEN              :1;
						uint32_t                      :3;
						uint32_t RCC_AHBSMENR_0_TSCSMEN :1;
						uint32_t                      :3;
						uint32_t RCC_AHBSMENR_0_RNGSMEN :1;
						uint32_t                      :3;
						uint32_t RCC_AHBSMENR_0_CRYPSMEN :1;
						uint32_t                      :7;
					};
					struct
					{
						uint32_t DMA1SMEN             :1;
						uint32_t                      :31;
					};
				};

			};
#endif

#ifdef RCC_APB1ENR
			struct APB1ENR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

				union
				{
					struct
					{
						uint32_t RCC_APB1ENR_0_TIM2EN :1;
						uint32_t RCC_APB1ENR_0_TIM3EN :1;
						uint32_t RCC_APB1ENR_0_TIM4EN :1;
						uint32_t RCC_APB1ENR_0_TIM5EN :1;
						uint32_t RCC_APB1ENR_0_TIM6EN :1;
						uint32_t RCC_APB1ENR_0_TIM7EN :1;
						uint32_t RCC_APB1ENR_0_TIM12EN :1;
						uint32_t RCC_APB1ENR_0_TIM13EN :1;
						uint32_t RCC_APB1ENR_0_TIM14EN :1;
						uint32_t RCC_APB1ENR_0_TIM18EN :1;
						uint32_t RCC_APB1ENR_0_RTCAPBEN :1;
						uint32_t WWDGEN               :1;
						uint32_t                      :1;
						uint32_t RCC_APB1ENR_0_CAN3EN :1;
						uint32_t RCC_APB1ENR_0_SPI2EN :1;
						uint32_t RCC_APB1ENR_0_SPI3EN :1;
						uint32_t RCC_APB1ENR_0_SPDIFRXEN :1;
						uint32_t RCC_APB1ENR_0_USART2EN :1;
						uint32_t RCC_APB1ENR_0_USART3EN :1;
						uint32_t RCC_APB1ENR_0_USART4EN :1;
						uint32_t RCC_APB1ENR_0_USART5EN :1;
						uint32_t I2C1EN               :1;
						uint32_t RCC_APB1ENR_0_I2C2EN :1;
						uint32_t RCC_APB1ENR_0_USBEN  :1;
						uint32_t RCC_APB1ENR_0_FMPI2C1EN :1;
						uint32_t RCC_APB1ENR_0_CANEN  :1;
						uint32_t RCC_APB1ENR_0_CAN2EN :1;
						uint32_t RCC_APB1ENR_0_CRSEN  :1;
						uint32_t PWREN                :1;
						uint32_t RCC_APB1ENR_0_DACEN  :1;
						uint32_t RCC_APB1ENR_0_CECEN  :1;
						uint32_t RCC_APB1ENR_0_UART8EN :1;
					};
#ifdef RCC_APB1ENR_1
					struct
					{
						uint32_t                      :9;
						uint32_t RCC_APB1ENR_1_LPTIM1EN :1;
						uint32_t RCC_APB1ENR_1_RTCEN  :1;
						uint32_t                      :7;
						uint32_t RCC_APB1ENR_1_LPUART1EN :1;
						uint32_t RCC_APB1ENR_1_UART4EN :1;
						uint32_t RCC_APB1ENR_1_UART5EN :1;
						uint32_t                      :2;
						uint32_t RCC_APB1ENR_1_I2C3EN :1;
						uint32_t RCC_APB1ENR_1_I2C4EN :1;
						uint32_t RCC_APB1ENR_1_CAN1EN :1;
						uint32_t RCC_APB1ENR_1_DAC2EN :1;
						uint32_t RCC_APB1ENR_1_BKPEN  :1;
						uint32_t                      :1;
						uint32_t RCC_APB1ENR_1_DAC1EN :1;
						uint32_t RCC_APB1ENR_1_UART7EN :1;
						uint32_t RCC_APB1ENR_1_COMPEN :1;
					};
#endif
#ifdef RCC_APB1ENR_2
					struct
					{
						uint32_t                      :9;
						uint32_t RCC_APB1ENR_2_LCDEN  :1;
						uint32_t                      :17;
						uint32_t RCC_APB1ENR_2_CAN3EN :1;
						uint32_t                      :2;
						uint32_t RCC_APB1ENR_2_I2C3EN :1;
						uint32_t RCC_APB1ENR_2_LPTIM1EN :1;
					};
#endif
#ifdef RCC_APB1ENR_3
					struct
					{
						uint32_t                      :27;
						uint32_t CECEN                :1;
						uint32_t                      :4;
					};
#endif
				};

			};
#endif

#ifdef RCC_APB1ENR1
			struct APB1ENR1_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

				union
				{
					struct
					{
						uint32_t TIM2EN               :1;
						uint32_t RCC_APB1ENR1_0_TIM3EN :1;
						uint32_t RCC_APB1ENR1_0_TIM4EN :1;
						uint32_t RCC_APB1ENR1_0_TIM5EN :1;
						uint32_t TIM6EN               :1;
						uint32_t RCC_APB1ENR1_0_TIM7EN :1;
						uint32_t                      :3;
						uint32_t RCC_APB1ENR1_0_LCDEN :1;
						uint32_t RCC_APB1ENR1_0_RTCAPBEN :1;
						uint32_t WWDGEN               :1;
						uint32_t                      :2;
						uint32_t RCC_APB1ENR1_0_SPI2EN :1;
						uint32_t SPI3EN               :1;
						uint32_t                      :1;
						uint32_t USART2EN             :1;
						uint32_t RCC_APB1ENR1_0_USART3EN :1;
						uint32_t RCC_APB1ENR1_0_UART4EN :1;
						uint32_t RCC_APB1ENR1_0_UART5EN :1;
						uint32_t I2C1EN               :1;
						uint32_t RCC_APB1ENR1_0_I2C2EN :1;
						uint32_t I2C3EN               :1;
						uint32_t RCC_APB1ENR1_0_CRSEN :1;
						uint32_t CAN1EN               :1;
						uint32_t RCC_APB1ENR1_0_USBFSEN :1;
						uint32_t                      :1;
						uint32_t PWREN                :1;
						uint32_t DAC1EN               :1;
						uint32_t OPAMPEN              :1;
						uint32_t LPTIM1EN             :1;
					};
#ifdef RCC_APB1ENR1_1
					struct
					{
						uint32_t                      :26;
						uint32_t CAN2EN               :1;
						uint32_t                      :5;
					};
#endif
				};

			};
#endif

#ifdef RCC_APB1ENR2
			struct APB1ENR2_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t LPUART1EN            :1;
					uint32_t RCC_APB1ENR2_I2C4EN  :1;
					uint32_t RCC_APB1ENR2_SWPMI1EN :1;
					uint32_t                      :2;
					uint32_t LPTIM2EN             :1;
					uint32_t                      :26;


			};
#endif

#ifdef RCC_APB1HENR
			struct APB1HENR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t                      :1;
					uint32_t CRSEN                :1;
					uint32_t SWPMIEN              :1;
					uint32_t                      :1;
					uint32_t OPAMPEN              :1;
					uint32_t MDIOSEN              :1;
					uint32_t                      :2;
					uint32_t FDCANEN              :1;
					uint32_t                      :23;


			};
#endif

#ifdef RCC_APB1HLPENR
			struct APB1HLPENR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t                      :1;
					uint32_t CRSLPEN              :1;
					uint32_t SWPMILPEN            :1;
					uint32_t                      :1;
					uint32_t OPAMPLPEN            :1;
					uint32_t MDIOSLPEN            :1;
					uint32_t                      :2;
					uint32_t FDCANLPEN            :1;
					uint32_t                      :23;


			};
#endif

#ifdef RCC_APB1HRSTR
			struct APB1HRSTR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t                      :1;
					uint32_t CRSRST               :1;
					uint32_t SWPMIRST             :1;
					uint32_t                      :1;
					uint32_t OPAMPRST             :1;
					uint32_t MDIOSRST             :1;
					uint32_t                      :2;
					uint32_t FDCANRST             :1;
					uint32_t                      :23;


			};
#endif

#ifdef RCC_APB1LENR
			struct APB1LENR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t TIM2EN               :1;
					uint32_t TIM3EN               :1;
					uint32_t TIM4EN               :1;
					uint32_t TIM5EN               :1;
					uint32_t TIM6EN               :1;
					uint32_t TIM7EN               :1;
					uint32_t TIM12EN              :1;
					uint32_t TIM13EN              :1;
					uint32_t TIM14EN              :1;
					uint32_t LPTIM1EN             :1;
					uint32_t                      :4;
					uint32_t SPI2EN               :1;
					uint32_t SPI3EN               :1;
					uint32_t SPDIFRXEN            :1;
					uint32_t USART2EN             :1;
					uint32_t USART3EN             :1;
					uint32_t UART4EN              :1;
					uint32_t UART5EN              :1;
					uint32_t I2C1EN               :1;
					uint32_t I2C2EN               :1;
					uint32_t I2C3EN               :1;
					uint32_t                      :3;
					uint32_t CECEN                :1;
					uint32_t                      :1;
					uint32_t DAC12EN              :1;
					uint32_t UART7EN              :1;
					uint32_t UART8EN              :1;


			};
#endif

#ifdef RCC_APB1LLPENR
			struct APB1LLPENR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t TIM2LPEN             :1;
					uint32_t TIM3LPEN             :1;
					uint32_t TIM4LPEN             :1;
					uint32_t TIM5LPEN             :1;
					uint32_t TIM6LPEN             :1;
					uint32_t TIM7LPEN             :1;
					uint32_t TIM12LPEN            :1;
					uint32_t TIM13LPEN            :1;
					uint32_t TIM14LPEN            :1;
					uint32_t LPTIM1LPEN           :1;
					uint32_t                      :4;
					uint32_t SPI2LPEN             :1;
					uint32_t SPI3LPEN             :1;
					uint32_t SPDIFRXLPEN          :1;
					uint32_t USART2LPEN           :1;
					uint32_t USART3LPEN           :1;
					uint32_t UART4LPEN            :1;
					uint32_t UART5LPEN            :1;
					uint32_t I2C1LPEN             :1;
					uint32_t I2C2LPEN             :1;
					uint32_t I2C3LPEN             :1;
					uint32_t                      :3;
					uint32_t CECLPEN              :1;
					uint32_t                      :1;
					uint32_t DAC12LPEN            :1;
					uint32_t UART7LPEN            :1;
					uint32_t UART8LPEN            :1;


			};
#endif

#ifdef RCC_APB1LPENR
			struct APB1LPENR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

				union
				{
					struct
					{
						uint32_t RCC_APB1LPENR_0_TIM2LPEN :1;
						uint32_t RCC_APB1LPENR_0_TIM3LPEN :1;
						uint32_t RCC_APB1LPENR_0_TIM4LPEN :1;
						uint32_t RCC_APB1LPENR_0_TIM5LPEN :1;
						uint32_t RCC_APB1LPENR_0_TIM6LPEN :1;
						uint32_t RCC_APB1LPENR_0_TIM7LPEN :1;
						uint32_t RCC_APB1LPENR_0_TIM12LPEN :1;
						uint32_t RCC_APB1LPENR_0_TIM13LPEN :1;
						uint32_t RCC_APB1LPENR_0_TIM14LPEN :1;
						uint32_t RCC_APB1LPENR_0_LPTIM1LPEN :1;
						uint32_t RCC_APB1LPENR_0_RTCAPBLPEN :1;
						uint32_t WWDGLPEN             :1;
						uint32_t                      :2;
						uint32_t RCC_APB1LPENR_0_SPI2LPEN :1;
						uint32_t RCC_APB1LPENR_0_SPI3LPEN :1;
						uint32_t RCC_APB1LPENR_0_SPDIFRXLPEN :1;
						uint32_t USART2LPEN           :1;
						uint32_t RCC_APB1LPENR_0_USART3LPEN :1;
						uint32_t RCC_APB1LPENR_0_UART4LPEN :1;
						uint32_t RCC_APB1LPENR_0_UART5LPEN :1;
						uint32_t I2C1LPEN             :1;
						uint32_t I2C2LPEN             :1;
						uint32_t RCC_APB1LPENR_0_I2C3LPEN :1;
						uint32_t RCC_APB1LPENR_0_FMPI2C1LPEN :1;
						uint32_t RCC_APB1LPENR_0_CAN1LPEN :1;
						uint32_t RCC_APB1LPENR_0_CAN2LPEN :1;
						uint32_t RCC_APB1LPENR_0_CAN3LPEN :1;
						uint32_t PWRLPEN              :1;
						uint32_t RCC_APB1LPENR_0_DACLPEN :1;
						uint32_t RCC_APB1LPENR_0_UART7LPEN :1;
						uint32_t RCC_APB1LPENR_0_UART8LPEN :1;
					};
#ifdef RCC_APB1LPENR_1
					struct
					{
						uint32_t                      :9;
						uint32_t RCC_APB1LPENR_1_LCDLPEN :1;
						uint32_t RCC_APB1LPENR_1_RTCLPEN :1;
						uint32_t                      :2;
						uint32_t RCC_APB1LPENR_1_CAN3LPEN :1;
						uint32_t                      :9;
						uint32_t RCC_APB1LPENR_1_USBLPEN :1;
						uint32_t RCC_APB1LPENR_1_I2C4LPEN :1;
						uint32_t                      :2;
						uint32_t RCC_APB1LPENR_1_CECLPEN :1;
						uint32_t                      :3;
						uint32_t RCC_APB1LPENR_1_COMPLPEN :1;
					};
#endif
				};

			};
#endif

#ifdef RCC_APB1LRSTR
			struct APB1LRSTR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t TIM2RST              :1;
					uint32_t TIM3RST              :1;
					uint32_t TIM4RST              :1;
					uint32_t TIM5RST              :1;
					uint32_t TIM6RST              :1;
					uint32_t TIM7RST              :1;
					uint32_t TIM12RST             :1;
					uint32_t TIM13RST             :1;
					uint32_t TIM14RST             :1;
					uint32_t LPTIM1RST            :1;
					uint32_t                      :4;
					uint32_t SPI2RST              :1;
					uint32_t SPI3RST              :1;
					uint32_t SPDIFRXRST           :1;
					uint32_t USART2RST            :1;
					uint32_t USART3RST            :1;
					uint32_t UART4RST             :1;
					uint32_t UART5RST             :1;
					uint32_t I2C1RST              :1;
					uint32_t I2C2RST              :1;
					uint32_t I2C3RST              :1;
					uint32_t                      :3;
					uint32_t CECRST               :1;
					uint32_t                      :1;
					uint32_t DAC12RST             :1;
					uint32_t UART7RST             :1;
					uint32_t UART8RST             :1;


			};
#endif

#ifdef RCC_APB1RSTR
			struct APB1RSTR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

				union
				{
					struct
					{
						uint32_t RCC_APB1RSTR_0_TIM2RST :1;
						uint32_t RCC_APB1RSTR_0_TIM3RST :1;
						uint32_t RCC_APB1RSTR_0_TIM4RST :1;
						uint32_t RCC_APB1RSTR_0_TIM5RST :1;
						uint32_t RCC_APB1RSTR_0_TIM6RST :1;
						uint32_t RCC_APB1RSTR_0_TIM7RST :1;
						uint32_t RCC_APB1RSTR_0_TIM12RST :1;
						uint32_t RCC_APB1RSTR_0_TIM13RST :1;
						uint32_t RCC_APB1RSTR_0_TIM14RST :1;
						uint32_t RCC_APB1RSTR_0_TIM18RST :1;
						uint32_t                      :1;
						uint32_t WWDGRST              :1;
						uint32_t                      :1;
						uint32_t RCC_APB1RSTR_0_CAN3RST :1;
						uint32_t RCC_APB1RSTR_0_SPI2RST :1;
						uint32_t RCC_APB1RSTR_0_SPI3RST :1;
						uint32_t RCC_APB1RSTR_0_SPDIFRXRST :1;
						uint32_t RCC_APB1RSTR_0_USART2RST :1;
						uint32_t RCC_APB1RSTR_0_USART3RST :1;
						uint32_t RCC_APB1RSTR_0_USART4RST :1;
						uint32_t RCC_APB1RSTR_0_USART5RST :1;
						uint32_t I2C1RST              :1;
						uint32_t RCC_APB1RSTR_0_I2C2RST :1;
						uint32_t RCC_APB1RSTR_0_USBRST :1;
						uint32_t RCC_APB1RSTR_0_FMPI2C1RST :1;
						uint32_t RCC_APB1RSTR_0_CANRST :1;
						uint32_t RCC_APB1RSTR_0_CAN2RST :1;
						uint32_t RCC_APB1RSTR_0_CRSRST :1;
						uint32_t PWRRST               :1;
						uint32_t RCC_APB1RSTR_0_DACRST :1;
						uint32_t RCC_APB1RSTR_0_CECRST :1;
						uint32_t RCC_APB1RSTR_0_UART8RST :1;
					};
#ifdef RCC_APB1RSTR_1
					struct
					{
						uint32_t                      :9;
						uint32_t RCC_APB1RSTR_1_LPTIM1RST :1;
						uint32_t                      :8;
						uint32_t RCC_APB1RSTR_1_LPUART1RST :1;
						uint32_t RCC_APB1RSTR_1_UART4RST :1;
						uint32_t RCC_APB1RSTR_1_UART5RST :1;
						uint32_t                      :2;
						uint32_t RCC_APB1RSTR_1_I2C3RST :1;
						uint32_t RCC_APB1RSTR_1_I2C4RST :1;
						uint32_t RCC_APB1RSTR_1_CAN1RST :1;
						uint32_t RCC_APB1RSTR_1_DAC2RST :1;
						uint32_t RCC_APB1RSTR_1_BKPRST :1;
						uint32_t                      :1;
						uint32_t RCC_APB1RSTR_1_DAC1RST :1;
						uint32_t RCC_APB1RSTR_1_UART7RST :1;
						uint32_t RCC_APB1RSTR_1_COMPRST :1;
					};
#endif
#ifdef RCC_APB1RSTR_2
					struct
					{
						uint32_t                      :9;
						uint32_t RCC_APB1RSTR_2_LCDRST :1;
						uint32_t                      :17;
						uint32_t RCC_APB1RSTR_2_CAN3RST :1;
						uint32_t                      :2;
						uint32_t RCC_APB1RSTR_2_I2C3RST :1;
						uint32_t RCC_APB1RSTR_2_LPTIM1RST :1;
					};
#endif
#ifdef RCC_APB1RSTR_3
					struct
					{
						uint32_t                      :27;
						uint32_t CECRST               :1;
						uint32_t                      :4;
					};
#endif
				};

			};
#endif

#ifdef RCC_APB1RSTR1
			struct APB1RSTR1_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

				union
				{
					struct
					{
						uint32_t TIM2RST              :1;
						uint32_t RCC_APB1RSTR1_0_TIM3RST :1;
						uint32_t RCC_APB1RSTR1_0_TIM4RST :1;
						uint32_t RCC_APB1RSTR1_0_TIM5RST :1;
						uint32_t TIM6RST              :1;
						uint32_t RCC_APB1RSTR1_0_TIM7RST :1;
						uint32_t                      :3;
						uint32_t RCC_APB1RSTR1_0_LCDRST :1;
						uint32_t                      :4;
						uint32_t RCC_APB1RSTR1_0_SPI2RST :1;
						uint32_t SPI3RST              :1;
						uint32_t                      :1;
						uint32_t USART2RST            :1;
						uint32_t RCC_APB1RSTR1_0_USART3RST :1;
						uint32_t RCC_APB1RSTR1_0_UART4RST :1;
						uint32_t RCC_APB1RSTR1_0_UART5RST :1;
						uint32_t I2C1RST              :1;
						uint32_t RCC_APB1RSTR1_0_I2C2RST :1;
						uint32_t I2C3RST              :1;
						uint32_t RCC_APB1RSTR1_0_CRSRST :1;
						uint32_t CAN1RST              :1;
						uint32_t RCC_APB1RSTR1_0_USBFSRST :1;
						uint32_t                      :1;
						uint32_t PWRRST               :1;
						uint32_t DAC1RST              :1;
						uint32_t OPAMPRST             :1;
						uint32_t LPTIM1RST            :1;
					};
#ifdef RCC_APB1RSTR1_1
					struct
					{
						uint32_t                      :26;
						uint32_t CAN2RST              :1;
						uint32_t                      :5;
					};
#endif
				};

			};
#endif

#ifdef RCC_APB1RSTR2
			struct APB1RSTR2_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t LPUART1RST           :1;
					uint32_t RCC_APB1RSTR2_I2C4RST :1;
					uint32_t RCC_APB1RSTR2_SWPMI1RST :1;
					uint32_t                      :2;
					uint32_t LPTIM2RST            :1;
					uint32_t                      :26;


			};
#endif

#ifdef RCC_APB1SMENR
			struct APB1SMENR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t TIM2SMEN             :1;
					uint32_t RCC_APB1SMENR_TIM3SMEN :1;
					uint32_t                      :2;
					uint32_t RCC_APB1SMENR_TIM6SMEN :1;
					uint32_t RCC_APB1SMENR_TIM7SMEN :1;
					uint32_t                      :3;
					uint32_t RCC_APB1SMENR_LCDSMEN :1;
					uint32_t                      :1;
					uint32_t WWDGSMEN             :1;
					uint32_t                      :2;
					uint32_t RCC_APB1SMENR_SPI2SMEN :1;
					uint32_t                      :2;
					uint32_t USART2SMEN           :1;
					uint32_t LPUART1SMEN          :1;
					uint32_t RCC_APB1SMENR_USART4SMEN :1;
					uint32_t RCC_APB1SMENR_USART5SMEN :1;
					uint32_t I2C1SMEN             :1;
					uint32_t RCC_APB1SMENR_I2C2SMEN :1;
					uint32_t RCC_APB1SMENR_USBSMEN :1;
					uint32_t                      :3;
					uint32_t RCC_APB1SMENR_CRSSMEN :1;
					uint32_t PWRSMEN              :1;
					uint32_t RCC_APB1SMENR_DACSMEN :1;
					uint32_t RCC_APB1SMENR_I2C3SMEN :1;
					uint32_t LPTIM1SMEN           :1;


			};
#endif

#ifdef RCC_APB1SMENR1
			struct APB1SMENR1_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

				union
				{
					struct
					{
						uint32_t TIM2SMEN             :1;
						uint32_t RCC_APB1SMENR1_0_TIM3SMEN :1;
						uint32_t RCC_APB1SMENR1_0_TIM4SMEN :1;
						uint32_t RCC_APB1SMENR1_0_TIM5SMEN :1;
						uint32_t TIM6SMEN             :1;
						uint32_t RCC_APB1SMENR1_0_TIM7SMEN :1;
						uint32_t                      :3;
						uint32_t RCC_APB1SMENR1_0_LCDSMEN :1;
						uint32_t RCC_APB1SMENR1_0_RTCAPBSMEN :1;
						uint32_t WWDGSMEN             :1;
						uint32_t                      :2;
						uint32_t RCC_APB1SMENR1_0_SPI2SMEN :1;
						uint32_t SPI3SMEN             :1;
						uint32_t                      :1;
						uint32_t USART2SMEN           :1;
						uint32_t RCC_APB1SMENR1_0_USART3SMEN :1;
						uint32_t RCC_APB1SMENR1_0_UART4SMEN :1;
						uint32_t RCC_APB1SMENR1_0_UART5SMEN :1;
						uint32_t I2C1SMEN             :1;
						uint32_t RCC_APB1SMENR1_0_I2C2SMEN :1;
						uint32_t I2C3SMEN             :1;
						uint32_t RCC_APB1SMENR1_0_CRSSMEN :1;
						uint32_t CAN1SMEN             :1;
						uint32_t RCC_APB1SMENR1_0_USBFSSMEN :1;
						uint32_t                      :1;
						uint32_t PWRSMEN              :1;
						uint32_t DAC1SMEN             :1;
						uint32_t OPAMPSMEN            :1;
						uint32_t LPTIM1SMEN           :1;
					};
#ifdef RCC_APB1SMENR1_1
					struct
					{
						uint32_t                      :26;
						uint32_t CAN2SMEN             :1;
						uint32_t                      :5;
					};
#endif
				};

			};
#endif

#ifdef RCC_APB1SMENR2
			struct APB1SMENR2_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t LPUART1SMEN          :1;
					uint32_t RCC_APB1SMENR2_I2C4SMEN :1;
					uint32_t RCC_APB1SMENR2_SWPMI1SMEN :1;
					uint32_t                      :2;
					uint32_t LPTIM2SMEN           :1;
					uint32_t                      :26;


			};
#endif

#ifdef RCC_APB2ENR
			struct APB2ENR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

				union
				{
					struct
					{
						uint32_t RCC_APB2ENR_0_SYSCFGCOMPEN :1;
						uint32_t                      :1;
						uint32_t RCC_APB2ENR_0_IOPAEN :1;
						uint32_t RCC_APB2ENR_0_IOPBEN :1;
						uint32_t RCC_APB2ENR_0_IOPCEN :1;
						uint32_t RCC_APB2ENR_0_USART6EN :1;
						uint32_t RCC_APB2ENR_0_USART7EN :1;
						uint32_t RCC_APB2ENR_0_USART8EN :1;
						uint32_t RCC_APB2ENR_0_IOPGEN :1;
						uint32_t RCC_APB2ENR_0_ADCEN  :1;
						uint32_t RCC_APB2ENR_0_ADC2EN :1;
						uint32_t RCC_APB2ENR_0_TIM1EN :1;
						uint32_t RCC_APB2ENR_0_SPI1EN :1;
						uint32_t RCC_APB2ENR_0_TIM8EN :1;
						uint32_t RCC_APB2ENR_0_USART1EN :1;
						uint32_t RCC_APB2ENR_0_ADC3EN :1;
						uint32_t RCC_APB2ENR_0_TIM15EN :1;
						uint32_t RCC_APB2ENR_0_TIM16EN :1;
						uint32_t RCC_APB2ENR_0_TIM17EN :1;
						uint32_t RCC_APB2ENR_0_TIM9EN :1;
						uint32_t RCC_APB2ENR_0_TIM10EN :1;
						uint32_t RCC_APB2ENR_0_TIM11EN :1;
						uint32_t RCC_APB2ENR_0_DBGMCUEN :1;
						uint32_t RCC_APB2ENR_0_SAI2EN :1;
						uint32_t RCC_APB2ENR_0_SDADC1EN :1;
						uint32_t RCC_APB2ENR_0_SDADC2EN :1;
						uint32_t RCC_APB2ENR_0_SDADC3EN :1;
						uint32_t RCC_APB2ENR_0_DSIEN  :1;
						uint32_t RCC_APB2ENR_0_DFSDM1EN :1;
						uint32_t RCC_APB2ENR_0_HRTIM1EN :1;
						uint32_t RCC_APB2ENR_0_MDIOEN :1;
						uint32_t RCC_APB2ENR_0_OTGPHYCEN :1;
					};
#ifdef RCC_APB2ENR_1
					struct
					{
						uint32_t RCC_APB2ENR_1_AFIOEN :1;
						uint32_t RCC_APB2ENR_1_TIM8EN :1;
						uint32_t RCC_APB2ENR_1_TIM21EN :1;
						uint32_t                      :1;
						uint32_t RCC_APB2ENR_1_USART1EN :1;
						uint32_t RCC_APB2ENR_1_IOPDEN :1;
						uint32_t RCC_APB2ENR_1_IOPEEN :1;
						uint32_t RCC_APB2ENR_1_IOPFEN :1;
						uint32_t                      :1;
						uint32_t RCC_APB2ENR_1_ADC1EN :1;
						uint32_t RCC_APB2ENR_1_ADC3EN :1;
						uint32_t RCC_APB2ENR_1_SDIOEN :1;
						uint32_t                      :2;
						uint32_t RCC_APB2ENR_1_SYSCFGEN :1;
						uint32_t RCC_APB2ENR_1_SPI4EN :1;
						uint32_t RCC_APB2ENR_1_TIM9EN :1;
						uint32_t RCC_APB2ENR_1_TIM10EN :1;
						uint32_t RCC_APB2ENR_1_TIM11EN :1;
						uint32_t RCC_APB2ENR_1_TIM19EN :1;
						uint32_t RCC_APB2ENR_1_TIM20EN :1;
						uint32_t RCC_APB2ENR_1_SPI6EN :1;
						uint32_t RCC_APB2ENR_1_SAI1EN :1;
						uint32_t                      :1;
						uint32_t RCC_APB2ENR_1_DFSDM1EN :1;
						uint32_t RCC_APB2ENR_1_DFSDM2EN :1;
						uint32_t RCC_APB2ENR_1_LTDCEN :1;
						uint32_t                      :2;
						uint32_t RCC_APB2ENR_1_HRTIMEN :1;
						uint32_t                      :2;
					};
#endif
#ifdef RCC_APB2ENR_2
					struct
					{
						uint32_t RCC_APB2ENR_2_TIM1EN :1;
						uint32_t                      :1;
						uint32_t RCC_APB2ENR_2_TIM9EN :1;
						uint32_t RCC_APB2ENR_2_TIM10EN :1;
						uint32_t RCC_APB2ENR_2_TIM11EN :1;
						uint32_t RCC_APB2ENR_2_TIM22EN :1;
						uint32_t RCC_APB2ENR_2_UART9EN :1;
						uint32_t RCC_APB2ENR_2_UART10EN :1;
						uint32_t RCC_APB2ENR_2_ADC1EN :1;
						uint32_t RCC_APB2ENR_2_ADC2EN :1;
						uint32_t                      :1;
						uint32_t RCC_APB2ENR_2_SDMMC1EN :1;
						uint32_t                      :1;
						uint32_t RCC_APB2ENR_2_SPI4EN :1;
						uint32_t                      :1;
						uint32_t RCC_APB2ENR_2_EXTITEN :1;
						uint32_t                      :4;
						uint32_t RCC_APB2ENR_2_SPI5EN :1;
						uint32_t RCC_APB2ENR_2_SAI1EN :1;
						uint32_t RCC_APB2ENR_2_DBGEN  :1;
						uint32_t                      :1;
						uint32_t RCC_APB2ENR_2_SAI3EN :1;
						uint32_t                      :4;
						uint32_t RCC_APB2ENR_2_DFSDM1EN :1;
						uint32_t                      :2;
					};
#endif
#ifdef RCC_APB2ENR_3
					struct
					{
						uint32_t RCC_APB2ENR_3_SYSCFGEN :1;
						uint32_t                      :6;
						uint32_t RCC_APB2ENR_3_SDMMC2EN :1;
						uint32_t                      :2;
						uint32_t RCC_APB2ENR_3_SDMMC1EN :1;
						uint32_t                      :11;
						uint32_t RCC_APB2ENR_3_SAI2EN :1;
						uint32_t                      :9;
					};
#endif
#ifdef RCC_APB2ENR_4
					struct
					{
						uint32_t                      :7;
						uint32_t FWEN                 :1;
						uint32_t                      :24;
					};
#endif
#ifdef RCC_APB2ENR_5
					struct
					{
						uint32_t                      :7;
						uint32_t MIFIEN               :1;
						uint32_t                      :24;
					};
#endif
				};

			};
#endif

#ifdef RCC_APB2LPENR
			struct APB2LPENR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

				union
				{
					struct
					{
						uint32_t RCC_APB2LPENR_0_TIM1LPEN :1;
						uint32_t RCC_APB2LPENR_0_TIM8LPEN :1;
						uint32_t                      :2;
						uint32_t RCC_APB2LPENR_0_USART1LPEN :1;
						uint32_t RCC_APB2LPENR_0_USART6LPEN :1;
						uint32_t RCC_APB2LPENR_0_UART9LPEN :1;
						uint32_t RCC_APB2LPENR_0_UART10LPEN :1;
						uint32_t RCC_APB2LPENR_0_ADC1LPEN :1;
						uint32_t RCC_APB2LPENR_0_ADC2LPEN :1;
						uint32_t RCC_APB2LPENR_0_ADC3LPEN :1;
						uint32_t RCC_APB2LPENR_0_SDIOLPEN :1;
						uint32_t SPI1LPEN             :1;
						uint32_t RCC_APB2LPENR_0_SPI4LPEN :1;
						uint32_t RCC_APB2LPENR_0_SYSCFGLPEN :1;
						uint32_t RCC_APB2LPENR_0_EXTITLPEN :1;
						uint32_t RCC_APB2LPENR_0_TIM9LPEN :1;
						uint32_t RCC_APB2LPENR_0_TIM10LPEN :1;
						uint32_t RCC_APB2LPENR_0_TIM11LPEN :1;
						uint32_t                      :1;
						uint32_t RCC_APB2LPENR_0_SPI5LPEN :1;
						uint32_t RCC_APB2LPENR_0_SPI6LPEN :1;
						uint32_t RCC_APB2LPENR_0_SAI1LPEN :1;
						uint32_t RCC_APB2LPENR_0_SAI2LPEN :1;
						uint32_t RCC_APB2LPENR_0_DFSDM1LPEN :1;
						uint32_t RCC_APB2LPENR_0_DFSDM2LPEN :1;
						uint32_t RCC_APB2LPENR_0_LTDCLPEN :1;
						uint32_t RCC_APB2LPENR_0_DSILPEN :1;
						uint32_t                      :1;
						uint32_t RCC_APB2LPENR_0_HRTIMLPEN :1;
						uint32_t RCC_APB2LPENR_0_MDIOLPEN :1;
						uint32_t                      :1;
					};
#ifdef RCC_APB2LPENR_1
					struct
					{
						uint32_t RCC_APB2LPENR_1_SYSCFGLPEN :1;
						uint32_t                      :1;
						uint32_t RCC_APB2LPENR_1_TIM9LPEN :1;
						uint32_t RCC_APB2LPENR_1_TIM10LPEN :1;
						uint32_t RCC_APB2LPENR_1_TIM11LPEN :1;
						uint32_t                      :2;
						uint32_t RCC_APB2LPENR_1_SDMMC2LPEN :1;
						uint32_t                      :1;
						uint32_t RCC_APB2LPENR_1_ADC1LPEN :1;
						uint32_t                      :1;
						uint32_t RCC_APB2LPENR_1_SDMMC1LPEN :1;
						uint32_t                      :2;
						uint32_t RCC_APB2LPENR_1_USART1LPEN :1;
						uint32_t                      :1;
						uint32_t RCC_APB2LPENR_1_TIM15LPEN :1;
						uint32_t RCC_APB2LPENR_1_TIM16LPEN :1;
						uint32_t RCC_APB2LPENR_1_TIM17LPEN :1;
						uint32_t                      :5;
						uint32_t RCC_APB2LPENR_1_SAI3LPEN :1;
						uint32_t                      :4;
						uint32_t RCC_APB2LPENR_1_DFSDM1LPEN :1;
						uint32_t                      :2;
					};
#endif
#ifdef RCC_APB2LPENR_2
					struct
					{
						uint32_t                      :28;
						uint32_t DFSDM1LPEN           :1;
						uint32_t                      :3;
					};
#endif
				};

			};
#endif

#ifdef RCC_APB2RSTR
			struct APB2RSTR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

				union
				{
					struct
					{
						uint32_t RCC_APB2RSTR_0_SYSCFGRST :1;
						uint32_t                      :1;
						uint32_t RCC_APB2RSTR_0_IOPARST :1;
						uint32_t RCC_APB2RSTR_0_IOPBRST :1;
						uint32_t RCC_APB2RSTR_0_IOPCRST :1;
						uint32_t RCC_APB2RSTR_0_USART6RST :1;
						uint32_t RCC_APB2RSTR_0_USART7RST :1;
						uint32_t RCC_APB2RSTR_0_USART8RST :1;
						uint32_t RCC_APB2RSTR_0_IOPGRST :1;
						uint32_t RCC_APB2RSTR_0_ADCRST :1;
						uint32_t RCC_APB2RSTR_0_ADC2RST :1;
						uint32_t RCC_APB2RSTR_0_TIM1RST :1;
						uint32_t RCC_APB2RSTR_0_SPI1RST :1;
						uint32_t RCC_APB2RSTR_0_TIM8RST :1;
						uint32_t RCC_APB2RSTR_0_USART1RST :1;
						uint32_t RCC_APB2RSTR_0_ADC3RST :1;
						uint32_t RCC_APB2RSTR_0_TIM15RST :1;
						uint32_t RCC_APB2RSTR_0_TIM16RST :1;
						uint32_t RCC_APB2RSTR_0_TIM17RST :1;
						uint32_t RCC_APB2RSTR_0_TIM9RST :1;
						uint32_t RCC_APB2RSTR_0_TIM10RST :1;
						uint32_t RCC_APB2RSTR_0_TIM11RST :1;
						uint32_t RCC_APB2RSTR_0_DBGMCURST :1;
						uint32_t RCC_APB2RSTR_0_SAI2RST :1;
						uint32_t RCC_APB2RSTR_0_SDADC1RST :1;
						uint32_t RCC_APB2RSTR_0_SDADC2RST :1;
						uint32_t RCC_APB2RSTR_0_SDADC3RST :1;
						uint32_t RCC_APB2RSTR_0_DSIRST :1;
						uint32_t RCC_APB2RSTR_0_DFSDM1RST :1;
						uint32_t RCC_APB2RSTR_0_HRTIM1RST :1;
						uint32_t RCC_APB2RSTR_0_MDIORST :1;
						uint32_t RCC_APB2RSTR_0_OTGPHYCRST :1;
					};
#ifdef RCC_APB2RSTR_1
					struct
					{
						uint32_t RCC_APB2RSTR_1_AFIORST :1;
						uint32_t RCC_APB2RSTR_1_TIM8RST :1;
						uint32_t RCC_APB2RSTR_1_TIM21RST :1;
						uint32_t                      :1;
						uint32_t RCC_APB2RSTR_1_USART1RST :1;
						uint32_t RCC_APB2RSTR_1_IOPDRST :1;
						uint32_t RCC_APB2RSTR_1_IOPERST :1;
						uint32_t RCC_APB2RSTR_1_IOPFRST :1;
						uint32_t RCC_APB2RSTR_1_ADCRST :1;
						uint32_t RCC_APB2RSTR_1_ADC1RST :1;
						uint32_t RCC_APB2RSTR_1_SDMMC1RST :1;
						uint32_t RCC_APB2RSTR_1_SDIORST :1;
						uint32_t                      :2;
						uint32_t RCC_APB2RSTR_1_SYSCFGRST :1;
						uint32_t RCC_APB2RSTR_1_SPI4RST :1;
						uint32_t RCC_APB2RSTR_1_TIM9RST :1;
						uint32_t RCC_APB2RSTR_1_TIM10RST :1;
						uint32_t RCC_APB2RSTR_1_TIM11RST :1;
						uint32_t RCC_APB2RSTR_1_TIM19RST :1;
						uint32_t RCC_APB2RSTR_1_TIM20RST :1;
						uint32_t RCC_APB2RSTR_1_SPI6RST :1;
						uint32_t RCC_APB2RSTR_1_SAI1RST :1;
						uint32_t                      :1;
						uint32_t RCC_APB2RSTR_1_DFSDM1RST :1;
						uint32_t RCC_APB2RSTR_1_DFSDM2RST :1;
						uint32_t RCC_APB2RSTR_1_LTDCRST :1;
						uint32_t                      :2;
						uint32_t RCC_APB2RSTR_1_HRTIMRST :1;
						uint32_t                      :2;
					};
#endif
#ifdef RCC_APB2RSTR_2
					struct
					{
						uint32_t RCC_APB2RSTR_2_TIM1RST :1;
						uint32_t                      :1;
						uint32_t RCC_APB2RSTR_2_TIM9RST :1;
						uint32_t RCC_APB2RSTR_2_TIM10RST :1;
						uint32_t RCC_APB2RSTR_2_TIM11RST :1;
						uint32_t RCC_APB2RSTR_2_TIM22RST :1;
						uint32_t RCC_APB2RSTR_2_UART9RST :1;
						uint32_t RCC_APB2RSTR_2_UART10RST :1;
						uint32_t                      :3;
						uint32_t RCC_APB2RSTR_2_SDMMC1RST :1;
						uint32_t                      :1;
						uint32_t RCC_APB2RSTR_2_SPI4RST :1;
						uint32_t                      :6;
						uint32_t RCC_APB2RSTR_2_SPI5RST :1;
						uint32_t RCC_APB2RSTR_2_SAI1RST :1;
						uint32_t RCC_APB2RSTR_2_DBGRST :1;
						uint32_t                      :1;
						uint32_t RCC_APB2RSTR_2_SAI3RST :1;
						uint32_t                      :4;
						uint32_t RCC_APB2RSTR_2_DFSDM1RST :1;
						uint32_t                      :2;
					};
#endif
#ifdef RCC_APB2RSTR_3
					struct
					{
						uint32_t                      :7;
						uint32_t RCC_APB2RSTR_3_SDMMC2RST :1;
						uint32_t                      :14;
						uint32_t RCC_APB2RSTR_3_SAI2RST :1;
						uint32_t                      :9;
					};
#endif
				};

			};
#endif

#ifdef RCC_APB2SMENR
			struct APB2SMENR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

				union
				{
					struct
					{
						uint32_t SYSCFGSMEN           :1;
						uint32_t                      :1;
						uint32_t RCC_APB2SMENR_0_TIM21SMEN :1;
						uint32_t                      :2;
						uint32_t RCC_APB2SMENR_0_TIM22SMEN :1;
						uint32_t                      :3;
						uint32_t RCC_APB2SMENR_0_ADCSMEN :1;
						uint32_t RCC_APB2SMENR_0_SDMMC1SMEN :1;
						uint32_t RCC_APB2SMENR_0_TIM1SMEN :1;
						uint32_t SPI1SMEN             :1;
						uint32_t RCC_APB2SMENR_0_TIM8SMEN :1;
						uint32_t RCC_APB2SMENR_0_USART1SMEN :1;
						uint32_t                      :1;
						uint32_t RCC_APB2SMENR_0_TIM15SMEN :1;
						uint32_t RCC_APB2SMENR_0_TIM16SMEN :1;
						uint32_t RCC_APB2SMENR_0_TIM17SMEN :1;
						uint32_t                      :2;
						uint32_t RCC_APB2SMENR_0_SAI1SMEN :1;
						uint32_t RCC_APB2SMENR_0_DBGSMEN :1;
						uint32_t                      :1;
						uint32_t RCC_APB2SMENR_0_DFSDM1SMEN :1;
						uint32_t                      :1;
						uint32_t RCC_APB2SMENR_0_LTDCSMEN :1;
						uint32_t RCC_APB2SMENR_0_DSISMEN :1;
						uint32_t                      :4;
					};
#ifdef RCC_APB2SMENR_1
					struct
					{
						uint32_t                      :9;
						uint32_t ADC1SMEN             :1;
						uint32_t                      :12;
						uint32_t DBGMCUSMEN           :1;
						uint32_t                      :9;
					};
#endif
#ifdef RCC_APB2SMENR_2
					struct
					{
						uint32_t                      :22;
						uint32_t SAI2SMEN             :1;
						uint32_t                      :9;
					};
#endif
				};

			};
#endif

#ifdef RCC_APB3ENR
			struct APB3ENR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t                      :3;
					uint32_t LTDCEN               :1;
					uint32_t                      :2;
					uint32_t WWDG1EN              :1;
					uint32_t                      :25;


			};
#endif

#ifdef RCC_APB3LPENR
			struct APB3LPENR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t                      :3;
					uint32_t LTDCLPEN             :1;
					uint32_t                      :2;
					uint32_t WWDG1LPEN            :1;
					uint32_t                      :25;


			};
#endif

#ifdef RCC_APB3RSTR
			struct APB3RSTR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t                      :3;
					uint32_t LTDCRST              :1;
					uint32_t                      :28;


			};
#endif

#ifdef RCC_APB4ENR
			struct APB4ENR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t                      :1;
					uint32_t SYSCFGEN             :1;
					uint32_t                      :1;
					uint32_t LPUART1EN            :1;
					uint32_t                      :1;
					uint32_t SPI6EN               :1;
					uint32_t                      :1;
					uint32_t I2C4EN               :1;
					uint32_t                      :1;
					uint32_t LPTIM2EN             :1;
					uint32_t LPTIM3EN             :1;
					uint32_t LPTIM4EN             :1;
					uint32_t LPTIM5EN             :1;
					uint32_t                      :1;
					uint32_t COMP12EN             :1;
					uint32_t VREFEN               :1;
					uint32_t RTCAPBEN             :1;
					uint32_t                      :4;
					uint32_t SAI4EN               :1;
					uint32_t                      :10;


			};
#endif

#ifdef RCC_APB4LPENR
			struct APB4LPENR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t                      :1;
					uint32_t SYSCFGLPEN           :1;
					uint32_t                      :1;
					uint32_t LPUART1LPEN          :1;
					uint32_t                      :1;
					uint32_t SPI6LPEN             :1;
					uint32_t                      :1;
					uint32_t I2C4LPEN             :1;
					uint32_t                      :1;
					uint32_t LPTIM2LPEN           :1;
					uint32_t LPTIM3LPEN           :1;
					uint32_t LPTIM4LPEN           :1;
					uint32_t LPTIM5LPEN           :1;
					uint32_t                      :1;
					uint32_t COMP12LPEN           :1;
					uint32_t VREFLPEN             :1;
					uint32_t RTCAPBLPEN           :1;
					uint32_t                      :4;
					uint32_t SAI4LPEN             :1;
					uint32_t                      :10;


			};
#endif

#ifdef RCC_APB4RSTR
			struct APB4RSTR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t                      :1;
					uint32_t SYSCFGRST            :1;
					uint32_t                      :1;
					uint32_t LPUART1RST           :1;
					uint32_t                      :1;
					uint32_t SPI6RST              :1;
					uint32_t                      :1;
					uint32_t I2C4RST              :1;
					uint32_t                      :1;
					uint32_t LPTIM2RST            :1;
					uint32_t LPTIM3RST            :1;
					uint32_t LPTIM4RST            :1;
					uint32_t LPTIM5RST            :1;
					uint32_t                      :1;
					uint32_t COMP12RST            :1;
					uint32_t VREFRST              :1;
					uint32_t                      :5;
					uint32_t SAI4RST              :1;
					uint32_t                      :10;


			};
#endif

#ifdef RCC_BDCR
			struct BDCR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

				union
				{
					struct
					{
						uint32_t LSEON                :1;
						uint32_t LSERDY               :1;
						uint32_t LSEBYP               :1;
						uint32_t RCC_BDCR_0_LSEDRV    :2;
						uint32_t RCC_BDCR_0_LSECSSON  :1;
						uint32_t RCC_BDCR_0_LSECSSD   :1;
						uint32_t                      :1;
						uint32_t RTCSEL               :2;
						uint32_t                      :5;
						uint32_t RTCEN                :1;
						uint32_t BDRST                :1;
						uint32_t                      :7;
						uint32_t RCC_BDCR_0_LSCOEN    :1;
						uint32_t RCC_BDCR_0_LSCOSEL   :1;
						uint32_t                      :6;
					};
#ifdef RCC_BDCR_1
					struct
					{
						uint32_t RCC_BDCR_1_LSE       :3;
						uint32_t RCC_BDCR_1_LSEMOD    :1;
						uint32_t                      :28;
					};
#endif
				};

			};
#endif

#ifdef RCC_CCIPR
			struct CCIPR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

				union
				{
					struct
					{
						uint32_t RCC_CCIPR_0_USART1SEL :2;
						uint32_t USART2SEL            :2;
						uint32_t RCC_CCIPR_0_USART3SEL :2;
						uint32_t RCC_CCIPR_0_UART4SEL :2;
						uint32_t RCC_CCIPR_0_UART5SEL :2;
						uint32_t LPUART1SEL           :2;
						uint32_t I2C1SEL              :2;
						uint32_t RCC_CCIPR_0_I2C2SEL  :2;
						uint32_t RCC_CCIPR_0_I2C3SEL  :2;
						uint32_t LPTIM1SEL            :2;
						uint32_t RCC_CCIPR_0_LPTIM2SEL :2;
						uint32_t RCC_CCIPR_0_SAI1SEL  :2;
						uint32_t RCC_CCIPR_0_SAI2SEL  :2;
						uint32_t RCC_CCIPR_0_HSI48SEL :1;
						uint32_t                      :1;
						uint32_t RCC_CCIPR_0_ADCSEL   :2;
						uint32_t RCC_CCIPR_0_SWPMI1SEL :1;
						uint32_t RCC_CCIPR_0_DFSDM1SEL :1;
					};
#ifdef RCC_CCIPR_1
					struct
					{
						uint32_t                      :26;
						uint32_t HSI48MSEL            :1;
						uint32_t                      :5;
					};
#endif
#ifdef RCC_CCIPR_2
					struct
					{
						uint32_t                      :26;
						uint32_t CLK48SEL             :2;
						uint32_t                      :4;
					};
#endif
				};

			};
#endif

#ifdef RCC_CCIPR2
			struct CCIPR2_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t I2C4SEL              :2;
					uint32_t RCC_CCIPR2_DFSDM1SEL :1;
					uint32_t RCC_CCIPR2_ADFSDM1SEL :2;
					uint32_t RCC_CCIPR2_SAI1SEL   :3;
					uint32_t RCC_CCIPR2_SAI2SEL   :3;
					uint32_t                      :1;
					uint32_t RCC_CCIPR2_DSISEL    :1;
					uint32_t                      :1;
					uint32_t RCC_CCIPR2_SDMMCSEL  :1;
					uint32_t                      :1;
					uint32_t RCC_CCIPR2_PLLSAI2DIVR :2;
					uint32_t                      :2;
					uint32_t RCC_CCIPR2_OSPISEL   :2;
					uint32_t                      :10;


			};
#endif

#ifdef RCC_CFGR
			struct CFGR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

				union
				{
					struct
					{
						uint32_t RCC_CFGR_0_SW        :2;
						uint32_t RCC_CFGR_0_SWS       :2;
						uint32_t RCC_CFGR_0_HPRE      :4;
						uint32_t RCC_CFGR_0_PPRE      :3;
						uint32_t RCC_CFGR_0_PPRE2     :3;
						uint32_t RCC_CFGR_0_ADCPRE    :1;
						uint32_t RCC_CFGR_0_TIMPRE    :1;
						uint32_t RCC_CFGR_0_PLLSRC    :1;
						uint32_t RCC_CFGR_0_PLLXTPRE  :1;
						uint32_t RCC_CFGR_0_PLLMUL    :4;
						uint32_t RCC_CFGR_0_USBPRE    :1;
						uint32_t RCC_CFGR_0_I2SSRC    :1;
						uint32_t RCC_CFGR_0_MCO       :4;
						uint32_t RCC_CFGR_0_MCOPRE    :3;
						uint32_t RCC_CFGR_0_PLLNODIV  :1;
					};
#ifdef RCC_CFGR_1
					struct
					{
						uint32_t RCC_CFGR_1_SW        :3;
						uint32_t RCC_CFGR_1_SWS       :3;
						uint32_t RCC_CFGR_1_STOPWUCK  :1;
						uint32_t RCC_CFGR_1_STOPKERWUCK :1;
						uint32_t RCC_CFGR_1_PPRE1     :3;
						uint32_t                      :3;
						uint32_t RCC_CFGR_1_HRTIMSEL  :1;
						uint32_t RCC_CFGR_1_PLLSRC    :2;
						uint32_t                      :1;
						uint32_t RCC_CFGR_1_MCO1PRE   :4;
						uint32_t RCC_CFGR_1_OTGFSPRE  :1;
						uint32_t                      :1;
						uint32_t RCC_CFGR_1_MCOSEL    :4;
						uint32_t RCC_CFGR_1_MCOF      :1;
						uint32_t                      :1;
						uint32_t RCC_CFGR_1_MCO2      :2;
					};
#endif
#ifdef RCC_CFGR_2
					struct
					{
						uint32_t                      :8;
						uint32_t RCC_CFGR_2_MCO1EN    :1;
						uint32_t RCC_CFGR_2_MCO2EN    :1;
						uint32_t RCC_CFGR_2_PPRE1     :3;
						uint32_t                      :1;
						uint32_t RCC_CFGR_2_ADCPRE    :2;
						uint32_t RCC_CFGR_2_RTCPRE    :5;
						uint32_t RCC_CFGR_2_MCO1      :2;
						uint32_t                      :1;
						uint32_t RCC_CFGR_2_MCO       :3;
						uint32_t RCC_CFGR_2_MCO2PRE   :3;
						uint32_t                      :2;
					};
#endif
#ifdef RCC_CFGR_3
					struct
					{
						uint32_t                      :13;
						uint32_t RCC_CFGR_3_PPRE2     :3;
						uint32_t                      :6;
						uint32_t RCC_CFGR_3_PLLDIV    :2;
						uint32_t RCC_CFGR_3_MCO1PRE   :3;
						uint32_t RCC_CFGR_3_SDPRE     :5;
					};
#endif
#ifdef RCC_CFGR_4
					struct
					{
						uint32_t                      :8;
						uint32_t RCC_CFGR_4_RTCPRE    :6;
						uint32_t                      :1;
						uint32_t RCC_CFGR_4_STOPWUCK  :1;
						uint32_t                      :6;
						uint32_t RCC_CFGR_4_MCO1      :3;
						uint32_t                      :2;
						uint32_t RCC_CFGR_4_SDADCPRE  :5;
					};
#endif
#ifdef RCC_CFGR_5
					struct
					{
						uint32_t                      :25;
						uint32_t MCO2PRE              :4;
						uint32_t MCO2                 :3;
					};
#endif
#ifdef RCC_CFGR_6
					struct
					{
						uint32_t                      :24;
						uint32_t MCOSEL               :3;
						uint32_t                      :5;
					};
#endif
				};

			};
#endif

#ifdef RCC_CFGR2
			struct CFGR2_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

				union
				{
#ifdef RCC_CFGR2_0
					struct
					{
						uint32_t RCC_CFGR2_0_PREDIV   :4;
						uint32_t RCC_CFGR2_0_PREDIV2  :4;
						uint32_t RCC_CFGR2_0_PLL2MUL  :4;
						uint32_t RCC_CFGR2_0_PLL3MUL  :4;
						uint32_t RCC_CFGR2_0_PREDIV1SRC :1;
						uint32_t RCC_CFGR2_0_I2S2SRC  :1;
						uint32_t RCC_CFGR2_0_I2S3SRC  :1;
						uint32_t                      :13;
					};
#endif
#ifdef RCC_CFGR2_1
					struct
					{
						uint32_t RCC_CFGR2_1_PREDIV1  :4;
						uint32_t RCC_CFGR2_1_ADC1PRES :5;
						uint32_t RCC_CFGR2_1_ADCPRE34 :5;
						uint32_t                      :18;
					};
#endif
#ifdef RCC_CFGR2_2
					struct
					{
						uint32_t                      :4;
						uint32_t ADCPRE12             :5;
						uint32_t                      :23;
					};
#endif
				};

			};
#endif

#ifdef RCC_CFGR3
			struct CFGR3_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

				union
				{
					struct
					{
						uint32_t USART1SW             :2;
						uint32_t                      :2;
						uint32_t I2C1SW               :1;
						uint32_t RCC_CFGR3_0_I2C2SW   :1;
						uint32_t RCC_CFGR3_0_CECSW    :1;
						uint32_t RCC_CFGR3_0_USBSW    :1;
						uint32_t RCC_CFGR3_0_TIM1SW   :1;
						uint32_t RCC_CFGR3_0_TIM8SW   :1;
						uint32_t RCC_CFGR3_0_TIM15SW  :1;
						uint32_t RCC_CFGR3_0_TIM16SW  :1;
						uint32_t RCC_CFGR3_0_HRTIMSW  :1;
						uint32_t RCC_CFGR3_0_TIM17SW  :1;
						uint32_t                      :1;
						uint32_t RCC_CFGR3_0_TIM20SW  :1;
						uint32_t RCC_CFGR3_0_USART2SW :2;
						uint32_t RCC_CFGR3_0_USART3SW :2;
						uint32_t RCC_CFGR3_0_UART4SW  :2;
						uint32_t RCC_CFGR3_0_UART5SW  :2;
						uint32_t RCC_CFGR3_0_TIM2SW   :1;
						uint32_t RCC_CFGR3_0_TIM34SW  :1;
						uint32_t                      :6;
					};
#ifdef RCC_CFGR3_1
					struct
					{
						uint32_t                      :4;
						uint32_t RCC_CFGR3_1_I2CSW    :3;
						uint32_t                      :1;
						uint32_t RCC_CFGR3_1_TIMSW    :2;
						uint32_t                      :2;
						uint32_t RCC_CFGR3_1_HRTIM1SW :1;
						uint32_t                      :19;
					};
#endif
#ifdef RCC_CFGR3_2
					struct
					{
						uint32_t                      :4;
						uint32_t RCC_CFGR3_2_I2CSW    :2;
						uint32_t RCC_CFGR3_2_I2C3SW   :1;
						uint32_t                      :1;
						uint32_t RCC_CFGR3_2_TIMSW    :1;
						uint32_t                      :23;
					};
#endif
#ifdef RCC_CFGR3_3
					struct
					{
						uint32_t                      :4;
						uint32_t RCC_CFGR3_3_I2CSW    :1;
						uint32_t                      :3;
						uint32_t RCC_CFGR3_3_ADCSW    :1;
						uint32_t                      :23;
					};
#endif
				};

			};
#endif

#ifdef RCC_CICR
			struct CICR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

				union
				{
					struct
					{
						uint32_t LSIRDYC              :1;
						uint32_t LSERDYC              :1;
						uint32_t RCC_CICR_0_HSIRDYC   :1;
						uint32_t RCC_CICR_0_HSERDYC   :1;
						uint32_t RCC_CICR_0_CSIRDYC   :1;
						uint32_t RCC_CICR_0_HSI48RDYC :1;
						uint32_t RCC_CICR_0_PLLRDYC   :1;
						uint32_t RCC_CICR_0_PLL2RDYC  :1;
						uint32_t RCC_CICR_0_PLL3RDYC  :1;
						uint32_t RCC_CICR_0_LSECSSC   :1;
						uint32_t RCC_CICR_0_HSECSSC   :1;
						uint32_t                      :21;
					};
#ifdef RCC_CICR_1
					struct
					{
						uint32_t                      :3;
						uint32_t RCC_CICR_1_HSIRDYC   :1;
						uint32_t RCC_CICR_1_PLLRDYC   :1;
						uint32_t RCC_CICR_1_MSIRDYC   :1;
						uint32_t RCC_CICR_1_HSI48RDYC :1;
						uint32_t RCC_CICR_1_CSSLSEC   :1;
						uint32_t RCC_CICR_1_CSSHSEC   :1;
						uint32_t                      :23;
					};
#endif
#ifdef RCC_CICR_2
					struct
					{
						uint32_t                      :2;
						uint32_t RCC_CICR_2_MSIRDYC   :1;
						uint32_t                      :1;
						uint32_t RCC_CICR_2_HSERDYC   :1;
						uint32_t RCC_CICR_2_PLLRDYC   :1;
						uint32_t RCC_CICR_2_PLLSAI1RDYC :1;
						uint32_t RCC_CICR_2_LSECSSC   :1;
						uint32_t RCC_CICR_2_CSSC      :1;
						uint32_t                      :1;
						uint32_t RCC_CICR_2_HSI48RDYC :1;
						uint32_t                      :21;
					};
#endif
#ifdef RCC_CICR_3
					struct
					{
						uint32_t                      :7;
						uint32_t PLLSAI2RDYC          :1;
						uint32_t                      :24;
					};
#endif
				};

			};
#endif

#ifdef RCC_CIER
			struct CIER_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

				union
				{
					struct
					{
						uint32_t LSIRDYIE             :1;
						uint32_t LSERDYIE             :1;
						uint32_t RCC_CIER_0_HSIRDYIE  :1;
						uint32_t RCC_CIER_0_HSERDYIE  :1;
						uint32_t RCC_CIER_0_CSIRDYIE  :1;
						uint32_t RCC_CIER_0_HSI48RDYIE :1;
						uint32_t RCC_CIER_0_PLL1RDYIE :1;
						uint32_t RCC_CIER_0_PLL2RDYIE :1;
						uint32_t RCC_CIER_0_PLL3RDYIE :1;
						uint32_t RCC_CIER_0_LSECSSIE  :1;
						uint32_t                      :22;
					};
#ifdef RCC_CIER_1
					struct
					{
						uint32_t                      :3;
						uint32_t RCC_CIER_1_HSIRDYIE  :1;
						uint32_t RCC_CIER_1_PLLRDYIE  :1;
						uint32_t RCC_CIER_1_MSIRDYIE  :1;
						uint32_t RCC_CIER_1_HSI48RDYIE :1;
						uint32_t RCC_CIER_1_CSSLSE    :1;
						uint32_t                      :24;
					};
#endif
#ifdef RCC_CIER_2
					struct
					{
						uint32_t                      :2;
						uint32_t RCC_CIER_2_MSIRDYIE  :1;
						uint32_t                      :1;
						uint32_t RCC_CIER_2_HSERDYIE  :1;
						uint32_t RCC_CIER_2_PLLRDYIE  :1;
						uint32_t RCC_CIER_2_PLLSAI1RDYIE :1;
						uint32_t RCC_CIER_2_LSECSSIE  :1;
						uint32_t                      :2;
						uint32_t RCC_CIER_2_HSI48RDYIE :1;
						uint32_t                      :21;
					};
#endif
#ifdef RCC_CIER_3
					struct
					{
						uint32_t                      :7;
						uint32_t PLLSAI2RDYIE         :1;
						uint32_t                      :24;
					};
#endif
				};

			};
#endif

#ifdef RCC_CIFR
			struct CIFR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

				union
				{
					struct
					{
						uint32_t LSIRDYF              :1;
						uint32_t LSERDYF              :1;
						uint32_t RCC_CIFR_0_HSIRDYF   :1;
						uint32_t RCC_CIFR_0_HSERDYF   :1;
						uint32_t RCC_CIFR_0_CSIRDYF   :1;
						uint32_t RCC_CIFR_0_HSI48RDYF :1;
						uint32_t RCC_CIFR_0_PLLRDYF   :1;
						uint32_t RCC_CIFR_0_PLL2RDYF  :1;
						uint32_t RCC_CIFR_0_PLL3RDYF  :1;
						uint32_t RCC_CIFR_0_LSECSSF   :1;
						uint32_t RCC_CIFR_0_HSECSSF   :1;
						uint32_t                      :21;
					};
#ifdef RCC_CIFR_1
					struct
					{
						uint32_t                      :3;
						uint32_t RCC_CIFR_1_HSIRDYF   :1;
						uint32_t RCC_CIFR_1_PLLRDYF   :1;
						uint32_t RCC_CIFR_1_MSIRDYF   :1;
						uint32_t RCC_CIFR_1_HSI48RDYF :1;
						uint32_t RCC_CIFR_1_CSSLSEF   :1;
						uint32_t RCC_CIFR_1_CSSHSEF   :1;
						uint32_t                      :23;
					};
#endif
#ifdef RCC_CIFR_2
					struct
					{
						uint32_t                      :2;
						uint32_t RCC_CIFR_2_MSIRDYF   :1;
						uint32_t                      :1;
						uint32_t RCC_CIFR_2_HSERDYF   :1;
						uint32_t RCC_CIFR_2_PLLRDYF   :1;
						uint32_t RCC_CIFR_2_PLLSAI1RDYF :1;
						uint32_t RCC_CIFR_2_LSECSSF   :1;
						uint32_t RCC_CIFR_2_CSSF      :1;
						uint32_t                      :1;
						uint32_t RCC_CIFR_2_HSI48RDYF :1;
						uint32_t                      :21;
					};
#endif
#ifdef RCC_CIFR_3
					struct
					{
						uint32_t                      :7;
						uint32_t PLLSAI2RDYF          :1;
						uint32_t                      :24;
					};
#endif
				};

			};
#endif

#ifdef RCC_CIR
			struct CIR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

				union
				{
					struct
					{
						uint32_t LSIRDYF              :1;
						uint32_t LSERDYF              :1;
						uint32_t HSIRDYF              :1;
						uint32_t HSERDYF              :1;
						uint32_t PLLRDYF              :1;
						uint32_t RCC_CIR_0_HSI14RDYF  :1;
						uint32_t RCC_CIR_0_HSI48RDYF  :1;
						uint32_t CSSF                 :1;
						uint32_t LSIRDYIE             :1;
						uint32_t LSERDYIE             :1;
						uint32_t HSIRDYIE             :1;
						uint32_t HSERDYIE             :1;
						uint32_t PLLRDYIE             :1;
						uint32_t RCC_CIR_0_HSI14RDYIE :1;
						uint32_t RCC_CIR_0_HSI48RDYIE :1;
						uint32_t                      :1;
						uint32_t LSIRDYC              :1;
						uint32_t LSERDYC              :1;
						uint32_t HSIRDYC              :1;
						uint32_t HSERDYC              :1;
						uint32_t PLLRDYC              :1;
						uint32_t RCC_CIR_0_HSI14RDYC  :1;
						uint32_t RCC_CIR_0_HSI48RDYC  :1;
						uint32_t CSSC                 :1;
						uint32_t                      :8;
					};
#ifdef RCC_CIR_1
					struct
					{
						uint32_t                      :5;
						uint32_t PLL2RDYF             :1;
						uint32_t PLL3RDYF             :1;
						uint32_t                      :6;
						uint32_t PLL2RDYIE            :1;
						uint32_t PLL3RDYIE            :1;
						uint32_t                      :6;
						uint32_t PLL2RDYC             :1;
						uint32_t PLL3RDYC             :1;
						uint32_t                      :9;
					};
#endif
#ifdef RCC_CIR_2
					struct
					{
						uint32_t                      :5;
						uint32_t PLLI2SRDYF           :1;
						uint32_t RCC_CIR_2_PLLSAIRDYF :1;
						uint32_t                      :6;
						uint32_t PLLI2SRDYIE          :1;
						uint32_t RCC_CIR_2_PLLSAIRDYIE :1;
						uint32_t                      :6;
						uint32_t PLLI2SRDYC           :1;
						uint32_t RCC_CIR_2_PLLSAIRDYC :1;
						uint32_t                      :9;
					};
#endif
#ifdef RCC_CIR_3
					struct
					{
						uint32_t                      :5;
						uint32_t MSIRDYF              :1;
						uint32_t RCC_CIR_3_LSECSSF    :1;
						uint32_t                      :6;
						uint32_t MSIRDYIE             :1;
						uint32_t RCC_CIR_3_LSECSSIE   :1;
						uint32_t                      :6;
						uint32_t MSIRDYC              :1;
						uint32_t RCC_CIR_3_LSECSSC    :1;
						uint32_t                      :9;
					};
#endif
				};

			};
#endif

#ifdef RCC_CKGATENR
			struct CKGATENR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t AHB2APB1_CKEN        :1;
					uint32_t AHB2APB2_CKEN        :1;
					uint32_t CM4DBG_CKEN          :1;
					uint32_t SPARE_CKEN           :1;
					uint32_t SRAM_CKEN            :1;
					uint32_t FLITF_CKEN           :1;
					uint32_t RCC_CKEN             :1;
					uint32_t RCC_CKGATENR_RCC_EVTCTL :1;
					uint32_t                      :24;


			};
#endif

#ifdef RCC_CR
			struct CR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

				union
				{
					struct
					{
						uint32_t RCC_CR_0_HSION       :1;
						uint32_t RCC_CR_0_HSIRDY      :1;
						uint32_t RCC_CR_0_MSIPLLEN    :1;
						uint32_t RCC_CR_0_HSITRIM     :5;
						uint32_t RCC_CR_0_HSICAL      :8;
						uint32_t HSEON                :1;
						uint32_t HSERDY               :1;
						uint32_t HSEBYP               :1;
						uint32_t RCC_CR_0_CSSON       :1;
						uint32_t RCC_CR_0_RTCPRE      :2;
						uint32_t                      :2;
						uint32_t PLLON                :1;
						uint32_t PLLRDY               :1;
						uint32_t RCC_CR_0_PLL2ON      :1;
						uint32_t RCC_CR_0_PLL2RDY     :1;
						uint32_t RCC_CR_0_PLL3ON      :1;
						uint32_t RCC_CR_0_PLL3RDY     :1;
						uint32_t                      :2;
					};
#ifdef RCC_CR_1
					struct
					{
						uint32_t RCC_CR_1_MSION       :1;
						uint32_t RCC_CR_1_HSIKERON    :1;
						uint32_t RCC_CR_1_HSIRDY      :1;
						uint32_t RCC_CR_1_HSIDIV      :2;
						uint32_t RCC_CR_1_HSIDIVF     :1;
						uint32_t                      :1;
						uint32_t RCC_CR_1_CSION       :1;
						uint32_t RCC_CR_1_CSIRDY      :1;
						uint32_t RCC_CR_1_CSIKERON    :1;
						uint32_t                      :1;
						uint32_t RCC_CR_1_HSIASFS     :1;
						uint32_t RCC_CR_1_HSI48ON     :1;
						uint32_t RCC_CR_1_HSI48RDY    :1;
						uint32_t RCC_CR_1_D1CKRDY     :1;
						uint32_t RCC_CR_1_D2CKRDY     :1;
						uint32_t                      :3;
						uint32_t RCC_CR_1_CSSHSEON    :1;
						uint32_t                      :4;
						uint32_t RCC_CR_1_PLL1ON      :1;
						uint32_t RCC_CR_1_PLL1RDY     :1;
						uint32_t RCC_CR_1_PLLI2SON    :1;
						uint32_t RCC_CR_1_PLLI2SRDY   :1;
						uint32_t RCC_CR_1_PLLSAION    :1;
						uint32_t RCC_CR_1_PLLSAIRDY   :1;
						uint32_t                      :2;
					};
#endif
#ifdef RCC_CR_2
					struct
					{
						uint32_t                      :3;
						uint32_t RCC_CR_2_HSIDIVEN    :1;
						uint32_t RCC_CR_2_HSIDIVF     :1;
						uint32_t RCC_CR_2_HSIOUTEN    :1;
						uint32_t                      :2;
						uint32_t RCC_CR_2_MSION       :1;
						uint32_t RCC_CR_2_MSIRDY      :1;
						uint32_t RCC_CR_2_HSIRDY      :1;
						uint32_t                      :15;
						uint32_t RCC_CR_2_PLLSAI1ON   :1;
						uint32_t RCC_CR_2_PLLSAI1RDY  :1;
						uint32_t RCC_CR_2_CSSON       :1;
						uint32_t RCC_CR_2_RTCPRE      :2;
						uint32_t                      :1;
					};
#endif
#ifdef RCC_CR_3
					struct
					{
						uint32_t                      :1;
						uint32_t MSIRDY               :1;
						uint32_t                      :1;
						uint32_t MSIRGSEL             :1;
						uint32_t MSIRANGE             :4;
						uint32_t HSION                :1;
						uint32_t HSIKERON             :1;
						uint32_t                      :18;
						uint32_t RCC_CR_3_PLLSAI2ON   :1;
						uint32_t RCC_CR_3_PLLSAI2RDY  :1;
						uint32_t                      :2;
					};
#endif
				};

			};
#endif

#ifdef RCC_CR2
			struct CR2_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t HSI14ON              :1;
					uint32_t HSI14RDY             :1;
					uint32_t HSI14DIS             :1;
					uint32_t HSI14TRIM            :5;
					uint32_t HSI14CAL             :8;
					uint32_t RCC_CR2_HSI48ON      :1;
					uint32_t RCC_CR2_HSI48RDY     :1;
					uint32_t                      :6;
					uint32_t RCC_CR2_HSI48CAL     :8;


			};
#endif

#ifdef RCC_CRRCR
			struct CRRCR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

				union
				{
#ifdef RCC_CRRCR_0
					struct
					{
						uint32_t HSI48CAL             :10;
						uint32_t                      :22;
					};
#endif
#ifdef RCC_CRRCR_1
					struct
					{
						uint32_t HSI48ON              :1;
						uint32_t HSI48RDY             :1;
						uint32_t RCC_CRRCR_1_HSI48DIV6OUTEN :1;
						uint32_t                      :5;
						uint32_t RCC_CRRCR_1_HSI48CAL :8;
						uint32_t                      :16;
					};
#endif
#ifdef RCC_CRRCR_2
					struct
					{
						uint32_t                      :7;
						uint32_t HSI48CAL             :9;
						uint32_t                      :16;
					};
#endif
				};

			};
#endif

#ifdef RCC_CSR
			struct CSR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

				union
				{
					struct
					{
						uint32_t LSION                :1;
						uint32_t LSIRDY               :1;
						uint32_t                      :6;
						uint32_t RCC_CSR_0_LSEON      :1;
						uint32_t RCC_CSR_0_LSERDY     :1;
						uint32_t RCC_CSR_0_LSEBYP     :1;
						uint32_t RCC_CSR_0_LSEDRV     :2;
						uint32_t RCC_CSR_0_LSECSSON   :1;
						uint32_t RCC_CSR_0_LSECSSD    :1;
						uint32_t                      :1;
						uint32_t RCC_CSR_0_RTCSEL     :2;
						uint32_t RCC_CSR_0_RTCEN      :1;
						uint32_t RCC_CSR_0_RTCRST     :1;
						uint32_t                      :3;
						uint32_t RCC_CSR_0_V18PWRRSTF :1;
						uint32_t RCC_CSR_0_RMVF       :1;
						uint32_t RCC_CSR_0_OBLRSTF    :1;
						uint32_t RCC_CSR_0_PINRSTF    :1;
						uint32_t RCC_CSR_0_PORRSTF    :1;
						uint32_t RCC_CSR_0_SFTRSTF    :1;
						uint32_t RCC_CSR_0_IWDGRSTF   :1;
						uint32_t RCC_CSR_0_WWDGRSTF   :1;
						uint32_t RCC_CSR_0_LPWRRSTF   :1;
					};
#ifdef RCC_CSR_1
					struct
					{
						uint32_t                      :11;
						uint32_t RCC_CSR_1_LSECSSON   :1;
						uint32_t RCC_CSR_1_LSECSSD    :1;
						uint32_t                      :9;
						uint32_t RCC_CSR_1_RTCEN      :1;
						uint32_t RCC_CSR_1_VREGRSTF   :1;
						uint32_t RCC_CSR_1_FWRSTF     :1;
						uint32_t RCC_CSR_1_BORRSTF    :1;
						uint32_t RCC_CSR_1_PADRSTF    :1;
						uint32_t                      :2;
						uint32_t RCC_CSR_1_WDGRSTF    :1;
						uint32_t                      :2;
					};
#endif
#ifdef RCC_CSR_2
					struct
					{
						uint32_t                      :8;
						uint32_t RCC_CSR_2_MSISRANGE  :4;
						uint32_t                      :11;
						uint32_t RMVF                 :1;
						uint32_t                      :1;
						uint32_t RCC_CSR_2_OBL        :1;
						uint32_t                      :1;
						uint32_t RCC_CSR_2_BORRSTF    :1;
						uint32_t                      :4;
					};
#endif
#ifdef RCC_CSR_3
					struct
					{
						uint32_t                      :23;
						uint32_t RTCRST               :1;
						uint32_t                      :8;
					};
#endif
				};

			};
#endif

#ifdef RCC_D1CCIPR
			struct D1CCIPR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t FMCSEL               :2;
					uint32_t                      :2;
					uint32_t QSPISEL              :2;
					uint32_t                      :10;
					uint32_t SDMMCSEL             :1;
					uint32_t                      :11;
					uint32_t CKPERSEL             :2;
					uint32_t                      :2;


			};
#endif

#ifdef RCC_D1CFGR
			struct D1CFGR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t HPRE                 :4;
					uint32_t D1PPRE               :3;
					uint32_t                      :1;
					uint32_t D1CPRE               :4;
					uint32_t                      :20;


			};
#endif

#ifdef RCC_D2CCIP1R
			struct D2CCIP1R_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t SAI1SEL              :3;
					uint32_t                      :3;
					uint32_t SAI23SEL             :3;
					uint32_t                      :3;
					uint32_t SPI123SEL            :3;
					uint32_t                      :1;
					uint32_t SPI45SEL             :3;
					uint32_t                      :1;
					uint32_t SPDIFSEL             :2;
					uint32_t                      :2;
					uint32_t DFSDM1SEL            :1;
					uint32_t                      :3;
					uint32_t FDCANSEL             :2;
					uint32_t                      :1;
					uint32_t SWPSEL               :1;


			};
#endif

#ifdef RCC_D2CCIP2R
			struct D2CCIP2R_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t USART28SEL           :3;
					uint32_t USART16SEL           :3;
					uint32_t                      :2;
					uint32_t RNGSEL               :2;
					uint32_t                      :2;
					uint32_t I2C123SEL            :2;
					uint32_t                      :6;
					uint32_t USBSEL               :2;
					uint32_t CECSEL               :2;
					uint32_t                      :4;
					uint32_t LPTIM1SEL            :3;
					uint32_t                      :1;


			};
#endif

#ifdef RCC_D2CFGR
			struct D2CFGR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t                      :4;
					uint32_t D2PPRE1              :3;
					uint32_t                      :1;
					uint32_t D2PPRE2              :3;
					uint32_t                      :21;


			};
#endif

#ifdef RCC_D3AMR
			struct D3AMR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t BDMAAMEN             :1;
					uint32_t                      :2;
					uint32_t LPUART1AMEN          :1;
					uint32_t                      :1;
					uint32_t SPI6AMEN             :1;
					uint32_t                      :1;
					uint32_t I2C4AMEN             :1;
					uint32_t                      :1;
					uint32_t LPTIM2AMEN           :1;
					uint32_t LPTIM3AMEN           :1;
					uint32_t LPTIM4AMEN           :1;
					uint32_t LPTIM5AMEN           :1;
					uint32_t                      :1;
					uint32_t COMP12AMEN           :1;
					uint32_t VREFAMEN             :1;
					uint32_t RTCAMEN              :1;
					uint32_t                      :2;
					uint32_t CRCAMEN              :1;
					uint32_t                      :1;
					uint32_t SAI4AMEN             :1;
					uint32_t                      :2;
					uint32_t ADC3AMEN             :1;
					uint32_t                      :3;
					uint32_t BKPRAMAMEN           :1;
					uint32_t SRAM4AMEN            :1;
					uint32_t                      :2;


			};
#endif

#ifdef RCC_D3CCIPR
			struct D3CCIPR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t LPUART1SEL           :3;
					uint32_t                      :5;
					uint32_t I2C4SEL              :2;
					uint32_t LPTIM2SEL            :3;
					uint32_t LPTIM345SEL          :3;
					uint32_t ADCSEL               :2;
					uint32_t                      :3;
					uint32_t SAI4ASEL             :3;
					uint32_t SAI4BSEL             :3;
					uint32_t                      :1;
					uint32_t SPI6SEL              :3;
					uint32_t                      :1;


			};
#endif

#ifdef RCC_D3CFGR
			struct D3CFGR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t                      :4;
					uint32_t D3PPRE               :3;
					uint32_t                      :25;


			};
#endif

#ifdef RCC_DCKCFGR
			struct DCKCFGR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

				union
				{
					struct
					{
						uint32_t RCC_DCKCFGR_0_PLLI2SDIVR :5;
						uint32_t                      :3;
						uint32_t RCC_DCKCFGR_0_PLLDIVR :5;
						uint32_t                      :1;
						uint32_t RCC_DCKCFGR_0_CKDFSDM2ASEL :1;
						uint32_t RCC_DCKCFGR_0_CKDFSDM1ASEL :1;
						uint32_t RCC_DCKCFGR_0_PLLSAIDIVR :2;
						uint32_t                      :2;
						uint32_t RCC_DCKCFGR_0_SAI1ASRC :2;
						uint32_t RCC_DCKCFGR_0_SAI1BSRC :2;
						uint32_t TIMPRE               :1;
						uint32_t RCC_DCKCFGR_0_I2SSRC :2;
						uint32_t RCC_DCKCFGR_0_I2S2SRC :2;
						uint32_t RCC_DCKCFGR_0_DSISEL :1;
						uint32_t                      :1;
						uint32_t RCC_DCKCFGR_0_CKDFSDM1SEL :1;
					};
#ifdef RCC_DCKCFGR_1
					struct
					{
						uint32_t RCC_DCKCFGR_1_PLLI2SDIVQ :5;
						uint32_t                      :3;
						uint32_t RCC_DCKCFGR_1_PLLSAIDIVQ :5;
						uint32_t                      :7;
						uint32_t RCC_DCKCFGR_1_SAI1SRC :2;
						uint32_t RCC_DCKCFGR_1_SAI2SRC :2;
						uint32_t                      :1;
						uint32_t RCC_DCKCFGR_1_I2S1SRC :2;
						uint32_t RCC_DCKCFGR_1_CK48MSEL :1;
						uint32_t RCC_DCKCFGR_1_SDIOSEL :1;
						uint32_t                      :3;
					};
#endif
				};

			};
#endif

#ifdef RCC_DCKCFGR1
			struct DCKCFGR1_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t PLLI2SDIVQ           :5;
					uint32_t                      :3;
					uint32_t PLLSAIDIVQ           :5;
					uint32_t                      :3;
					uint32_t RCC_DCKCFGR1_PLLSAIDIVR :2;
					uint32_t                      :2;
					uint32_t SAI1SEL              :2;
					uint32_t SAI2SEL              :2;
					uint32_t TIMPRE               :1;
					uint32_t RCC_DCKCFGR1_DFSDM1SEL :1;
					uint32_t RCC_DCKCFGR1_ADFSDM1SEL :1;
					uint32_t                      :5;


			};
#endif

#ifdef RCC_DCKCFGR2
			struct DCKCFGR2_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

				union
				{
					struct
					{
						uint32_t RCC_DCKCFGR2_0_USART1SEL :2;
						uint32_t RCC_DCKCFGR2_0_USART2SEL :2;
						uint32_t RCC_DCKCFGR2_0_USART3SEL :2;
						uint32_t RCC_DCKCFGR2_0_UART4SEL :2;
						uint32_t RCC_DCKCFGR2_0_UART5SEL :2;
						uint32_t RCC_DCKCFGR2_0_USART6SEL :2;
						uint32_t RCC_DCKCFGR2_0_UART7SEL :2;
						uint32_t RCC_DCKCFGR2_0_UART8SEL :2;
						uint32_t RCC_DCKCFGR2_0_I2C1SEL :2;
						uint32_t RCC_DCKCFGR2_0_I2C2SEL :2;
						uint32_t RCC_DCKCFGR2_0_I2C3SEL :2;
						uint32_t RCC_DCKCFGR2_0_FMPI2C1SEL :2;
						uint32_t                      :2;
						uint32_t RCC_DCKCFGR2_0_CECSEL :1;
						uint32_t RCC_DCKCFGR2_0_CK48MSEL :1;
						uint32_t RCC_DCKCFGR2_0_SDIOSEL :1;
						uint32_t RCC_DCKCFGR2_0_SPDIFRXSEL :1;
						uint32_t RCC_DCKCFGR2_0_LPTIM1SEL :2;
					};
#ifdef RCC_DCKCFGR2_1
					struct
					{
						uint32_t                      :22;
						uint32_t RCC_DCKCFGR2_1_I2C4SEL :2;
						uint32_t LPTIM1SEL            :2;
						uint32_t                      :2;
						uint32_t SDMMC1SEL            :1;
						uint32_t RCC_DCKCFGR2_1_SDMMC2SEL :1;
						uint32_t RCC_DCKCFGR2_1_DSISEL :1;
						uint32_t                      :1;
					};
#endif
				};

			};
#endif

#ifdef RCC_GCR
			struct GCR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t WW1RSC               :1;
					uint32_t                      :31;


			};
#endif

#ifdef RCC_ICSCR
			struct ICSCR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

				union
				{
#ifdef RCC_ICSCR_0
					struct
					{
						uint32_t HSICAL               :12;
						uint32_t HSITRIM              :6;
						uint32_t CSICAL               :8;
						uint32_t CSITRIM              :5;
						uint32_t                      :1;
					};
#endif
#ifdef RCC_ICSCR_1
					struct
					{
						uint32_t HSICAL               :8;
						uint32_t HSITRIM              :5;
						uint32_t MSIRANGE             :3;
						uint32_t MSICAL               :8;
						uint32_t MSITRIM              :8;
					};
#endif
#ifdef RCC_ICSCR_2
					struct
					{
						uint32_t MSICAL               :8;
						uint32_t MSITRIM              :8;
						uint32_t HSICAL               :8;
						uint32_t RCC_ICSCR_2_HSITRIM  :5;
						uint32_t                      :3;
					};
#endif
#ifdef RCC_ICSCR_3
					struct
					{
						uint32_t                      :24;
						uint32_t HSITRIM              :7;
						uint32_t                      :1;
					};
#endif
				};

			};
#endif

#ifdef RCC_IOPENR
			struct IOPENR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

				union
				{
					struct
					{
						uint32_t IOPAEN               :1;
						uint32_t IOPBEN               :1;
						uint32_t IOPCEN               :1;
						uint32_t RCC_IOPENR_0_IOPDEN  :1;
						uint32_t RCC_IOPENR_0_IOPEEN  :1;
						uint32_t                      :2;
						uint32_t RCC_IOPENR_0_IOPHEN  :1;
						uint32_t                      :24;
					};
					struct
					{
						uint32_t GPIOAEN              :1;
						uint32_t GPIOBEN              :1;
						uint32_t GPIOCEN              :1;
						uint32_t RCC_IOPENR_1_GPIODEN :1;
						uint32_t RCC_IOPENR_1_GPIOEEN :1;
						uint32_t                      :2;
						uint32_t RCC_IOPENR_1_GPIOHEN :1;
						uint32_t                      :24;
					};
				};

			};
#endif

#ifdef RCC_IOPRSTR
			struct IOPRSTR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

				union
				{
					struct
					{
						uint32_t IOPARST              :1;
						uint32_t IOPBRST              :1;
						uint32_t IOPCRST              :1;
						uint32_t RCC_IOPRSTR_0_IOPDRST :1;
						uint32_t RCC_IOPRSTR_0_IOPERST :1;
						uint32_t                      :2;
						uint32_t RCC_IOPRSTR_0_IOPHRST :1;
						uint32_t                      :24;
					};
					struct
					{
						uint32_t GPIOARST             :1;
						uint32_t GPIOBRST             :1;
						uint32_t GPIOCRST             :1;
						uint32_t RCC_IOPRSTR_1_GPIODRST :1;
						uint32_t RCC_IOPRSTR_1_GPIOERST :1;
						uint32_t                      :2;
						uint32_t RCC_IOPRSTR_1_GPIOHRST :1;
						uint32_t                      :24;
					};
				};

			};
#endif

#ifdef RCC_IOPSMENR
			struct IOPSMENR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

				union
				{
					struct
					{
						uint32_t IOPASMEN             :1;
						uint32_t IOPBSMEN             :1;
						uint32_t IOPCSMEN             :1;
						uint32_t RCC_IOPSMENR_0_IOPDSMEN :1;
						uint32_t RCC_IOPSMENR_0_IOPESMEN :1;
						uint32_t                      :2;
						uint32_t RCC_IOPSMENR_0_IOPHSMEN :1;
						uint32_t                      :24;
					};
					struct
					{
						uint32_t GPIOASMEN            :1;
						uint32_t GPIOBSMEN            :1;
						uint32_t GPIOCSMEN            :1;
						uint32_t RCC_IOPSMENR_1_GPIODSMEN :1;
						uint32_t RCC_IOPSMENR_1_GPIOESMEN :1;
						uint32_t                      :2;
						uint32_t RCC_IOPSMENR_1_GPIOHSMEN :1;
						uint32_t                      :24;
					};
				};

			};
#endif

#ifdef RCC_PLL1DIVR
			struct PLL1DIVR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t N1                   :9;
					uint32_t P1                   :7;
					uint32_t Q1                   :7;
					uint32_t                      :1;
					uint32_t R1                   :7;
					uint32_t                      :1;


			};
#endif

#ifdef RCC_PLL1FRACR
			struct PLL1FRACR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t                      :3;
					uint32_t FRACN1               :13;
					uint32_t                      :16;


			};
#endif

#ifdef RCC_PLL2DIVR
			struct PLL2DIVR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t N2                   :9;
					uint32_t P2                   :7;
					uint32_t Q2                   :7;
					uint32_t                      :1;
					uint32_t R2                   :7;
					uint32_t                      :1;


			};
#endif

#ifdef RCC_PLL2FRACR
			struct PLL2FRACR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t                      :3;
					uint32_t FRACN2               :13;
					uint32_t                      :16;


			};
#endif

#ifdef RCC_PLL3DIVR
			struct PLL3DIVR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t N3                   :9;
					uint32_t P3                   :7;
					uint32_t Q3                   :7;
					uint32_t                      :1;
					uint32_t R3                   :7;
					uint32_t                      :1;


			};
#endif

#ifdef RCC_PLL3FRACR
			struct PLL3FRACR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t                      :3;
					uint32_t FRACN3               :13;
					uint32_t                      :16;


			};
#endif

#ifdef RCC_PLLCFGR
			struct PLLCFGR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

				union
				{
#ifdef RCC_PLLCFGR_0
					struct
					{
						uint32_t RCC_PLLCFGR_0_PLLM   :6;
						uint32_t RCC_PLLCFGR_0_PLLN   :9;
						uint32_t                      :1;
						uint32_t RCC_PLLCFGR_0_PLLP   :2;
						uint32_t RCC_PLLCFGR_0_DIVR1EN :1;
						uint32_t RCC_PLLCFGR_0_DIVP2EN :1;
						uint32_t RCC_PLLCFGR_0_DIVQ2EN :1;
						uint32_t RCC_PLLCFGR_0_DIVR2EN :1;
						uint32_t RCC_PLLCFGR_0_PLLSRC :1;
						uint32_t RCC_PLLCFGR_0_DIVQ3EN :1;
						uint32_t RCC_PLLCFGR_0_PLLQ   :4;
						uint32_t RCC_PLLCFGR_0_PLLR   :3;
						uint32_t                      :1;
					};
#endif
#ifdef RCC_PLLCFGR_1
					struct
					{
						uint32_t RCC_PLLCFGR_1_PLL1FRACEN :1;
						uint32_t RCC_PLLCFGR_1_PLL1VCOSEL :1;
						uint32_t RCC_PLLCFGR_1_PLL1RGE :2;
						uint32_t RCC_PLLCFGR_1_PLL2FRACEN :1;
						uint32_t RCC_PLLCFGR_1_PLL2VCOSEL :1;
						uint32_t RCC_PLLCFGR_1_PLL2RGE :2;
						uint32_t RCC_PLLCFGR_1_PLL3FRACEN :1;
						uint32_t RCC_PLLCFGR_1_PLL3VCOSEL :1;
						uint32_t RCC_PLLCFGR_1_PLL3RGE :2;
						uint32_t                      :4;
						uint32_t RCC_PLLCFGR_1_DIVP1EN :1;
						uint32_t RCC_PLLCFGR_1_DIVQ1EN :1;
						uint32_t                      :2;
						uint32_t RCC_PLLCFGR_1_PLLQEN :1;
						uint32_t                      :1;
						uint32_t RCC_PLLCFGR_1_DIVP3EN :1;
						uint32_t                      :1;
						uint32_t RCC_PLLCFGR_1_DIVR3EN :1;
						uint32_t RCC_PLLCFGR_1_PLLR   :2;
						uint32_t RCC_PLLCFGR_1_PLLPDIV :5;
					};
#endif
#ifdef RCC_PLLCFGR_2
					struct
					{
						uint32_t PLLSRC               :2;
						uint32_t                      :2;
						uint32_t RCC_PLLCFGR_2_PLLM   :3;
						uint32_t                      :1;
						uint32_t PLLN                 :7;
						uint32_t                      :1;
						uint32_t PLLPEN               :1;
						uint32_t PLLP                 :1;
						uint32_t                      :3;
						uint32_t PLLQ                 :2;
						uint32_t                      :1;
						uint32_t PLLREN               :1;
						uint32_t                      :7;
					};
#endif
#ifdef RCC_PLLCFGR_3
					struct
					{
						uint32_t                      :4;
						uint32_t PLLM                 :4;
						uint32_t                      :24;
					};
#endif
				};

			};
#endif

#ifdef RCC_PLLCKSELR
			struct PLLCKSELR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t PLLSRC               :2;
					uint32_t                      :2;
					uint32_t DIVM1                :6;
					uint32_t                      :2;
					uint32_t DIVM2                :6;
					uint32_t                      :2;
					uint32_t DIVM3                :6;
					uint32_t                      :6;


			};
#endif

#ifdef RCC_PLLI2SCFGR
			struct PLLI2SCFGR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t RCC_PLLI2SCFGR_PLLI2SM :6;
					uint32_t PLLI2SN              :9;
					uint32_t                      :1;
					uint32_t RCC_PLLI2SCFGR_PLLI2SP :2;
					uint32_t                      :4;
					uint32_t RCC_PLLI2SCFGR_PLLI2SSRC :1;
					uint32_t                      :1;
					uint32_t RCC_PLLI2SCFGR_PLLI2SQ :4;
					uint32_t PLLI2SR              :3;
					uint32_t                      :1;


			};
#endif

#ifdef RCC_PLLSAI1CFGR
			struct PLLSAI1CFGR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t                      :4;
					uint32_t RCC_PLLSAI1CFGR_PLLSAI1M :4;
					uint32_t PLLSAI1N             :7;
					uint32_t                      :1;
					uint32_t PLLSAI1PEN           :1;
					uint32_t PLLSAI1P             :1;
					uint32_t                      :2;
					uint32_t PLLSAI1QEN           :1;
					uint32_t PLLSAI1Q             :2;
					uint32_t                      :1;
					uint32_t PLLSAI1REN           :1;
					uint32_t PLLSAI1R             :2;
					uint32_t RCC_PLLSAI1CFGR_PLLSAI1PDIV :5;


			};
#endif

#ifdef RCC_PLLSAI2CFGR
			struct PLLSAI2CFGR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t                      :4;
					uint32_t RCC_PLLSAI2CFGR_PLLSAI2M :4;
					uint32_t PLLSAI2N             :7;
					uint32_t                      :1;
					uint32_t PLLSAI2PEN           :1;
					uint32_t PLLSAI2P             :1;
					uint32_t                      :2;
					uint32_t RCC_PLLSAI2CFGR_PLLSAI2QEN :1;
					uint32_t RCC_PLLSAI2CFGR_PLLSAI2Q :2;
					uint32_t                      :1;
					uint32_t PLLSAI2REN           :1;
					uint32_t PLLSAI2R             :2;
					uint32_t RCC_PLLSAI2CFGR_PLLSAI2PDIV :5;


			};
#endif

#ifdef RCC_PLLSAICFGR
			struct PLLSAICFGR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t RCC_PLLSAICFGR_PLLSAIM :6;
					uint32_t PLLSAIN              :9;
					uint32_t                      :1;
					uint32_t RCC_PLLSAICFGR_PLLSAIP :2;
					uint32_t                      :6;
					uint32_t PLLSAIQ              :4;
					uint32_t RCC_PLLSAICFGR_PLLSAIR :3;
					uint32_t                      :1;


			};
#endif

#ifdef RCC_RSR
			struct RSR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t                      :16;
					uint32_t RMVF                 :1;
					uint32_t CPURSTF              :1;
					uint32_t                      :1;
					uint32_t D1RSTF               :1;
					uint32_t D2RSTF               :1;
					uint32_t BORRSTF              :1;
					uint32_t PINRSTF              :1;
					uint32_t PORRSTF              :1;
					uint32_t SFTRSTF              :1;
					uint32_t                      :1;
					uint32_t IWDG1RSTF            :1;
					uint32_t                      :1;
					uint32_t WWDG1RSTF            :1;
					uint32_t                      :1;
					uint32_t LPWRRSTF             :1;
					uint32_t                      :1;


			};
#endif

#ifdef RCC_SSCGR
			struct SSCGR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t MODPER               :13;
					uint32_t INCSTEP              :15;
					uint32_t                      :2;
					uint32_t SPREADSEL            :1;
					uint32_t SSCGEN               :1;


			};
#endif

			union
			{

				struct
				{
					CR_TypeDef CR;       // @0x000
					RCC_MAP0_CFGR;       // @0x004
					RCC_MAP0_CIR;        // @0x008
					RCC_MAP0_APB2RSTR;   // @0x00c
					RCC_MAP0_APB1RSTR;   // @0x010
					RCC_MAP0_AHBENR;     // @0x014
					RCC_MAP0_APB2ENR;    // @0x018
					RCC_MAP0_APB1ENR;    // @0x01c
					RCC_MAP0_BDCR;       // @0x020
					RCC_MAP0_CSR;        // @0x024
					RCC_MAP0_AHBRSTR;    // @0x028
					RCC_MAP0_CFGR2;      // @0x02c
					RCC_MAP0_CFGR3;      // @0x030
					RCC_MAP0_CR2;        // @0x034
					RCC_MAP0_AHB3ENR;    // @0x038
					RCC_MAP0_PLL2FRACR;  // @0x03c
					RCC_MAP0_PLL3DIVR;   // @0x040
					RCC_MAP0_PLL3FRACR;  // @0x044
					RCC_MAP0_APB1SMENR;  // @0x048
					RCC_MAP0_D1CCIPR;    // @0x04c
					RCC_MAP0_AHB1LPENR;  // @0x050
					RCC_MAP0_AHB2LPENR;  // @0x054
					RCC_MAP0_AHB3LPENR;  // @0x058
					RCC_MAP0_APB1ENR2;   // @0x05c
					RCC_MAP0_APB1LPENR;  // @0x060
					RCC_MAP0_APB2LPENR;  // @0x064
					RCC_MAP0_CICR;       // @0x068
					RCC_MAP0_AHB2SMENR;  // @0x06c
					RCC_MAP0_AHB3SMENR;  // @0x070
					__SOOL_PERIPH_PADDING_4;
					RCC_MAP0_APB1SMENR1; // @0x078
					RCC_MAP0_AHB3RSTR;   // @0x07c
					RCC_MAP0_SSCGR;      // @0x080
					RCC_MAP0_PLLI2SCFGR; // @0x084
					RCC_MAP0_PLLSAICFGR; // @0x088
					RCC_MAP0_DCKCFGR;    // @0x08c
					RCC_MAP0_CKGATENR;   // @0x090
					RCC_MAP0_DCKCFGR2;   // @0x094
					RCC_MAP0_CRRCR;      // @0x098
					RCC_MAP0_APB4RSTR;   // @0x09c
					RCC_MAP0_GCR;        // @0x0a0
					__SOOL_PERIPH_PADDING_4;
					RCC_MAP0_D3AMR;      // @0x0a8
					__SOOL_PERIPH_PADDING_32;
					__SOOL_PERIPH_PADDING_4;
					RCC_MAP0_RSR;        // @0x0d0
					__SOOL_PERIPH_PADDING_4;
					RCC_MAP0_AHB1ENR;    // @0x0d8
					RCC_MAP0_AHB2ENR;    // @0x0dc
					RCC_MAP0_AHB4ENR;    // @0x0e0
					RCC_MAP0_APB3ENR;    // @0x0e4
					RCC_MAP0_APB1LENR;   // @0x0e8
					RCC_MAP0_APB1HENR;   // @0x0ec
					__SOOL_PERIPH_PADDING_4;
					RCC_MAP0_APB4ENR;    // @0x0f4
					__SOOL_PERIPH_PADDING_16;
					RCC_MAP0_AHB4LPENR;  // @0x108
					RCC_MAP0_APB3LPENR;  // @0x10c
					RCC_MAP0_APB1LLPENR; // @0x110
					RCC_MAP0_APB1HLPENR; // @0x114
					__SOOL_PERIPH_PADDING_4;
					RCC_MAP0_APB4LPENR;  // @0x11c
				};
				struct
				{
					__SOOL_PERIPH_PADDING_4;
					RCC_MAP1_PLLCFGR;    // @0x004
					RCC_MAP1_CFGR;       // @0x008
					RCC_MAP1_CIR;        // @0x00c
					RCC_MAP1_AHB1RSTR;   // @0x010
					RCC_MAP1_AHB2RSTR;   // @0x014
					RCC_MAP1_AHB3RSTR;   // @0x018
					RCC_MAP1_D2CFGR;     // @0x01c
					RCC_MAP1_APB1RSTR;   // @0x020
					RCC_MAP1_APB2RSTR;   // @0x024
					RCC_MAP1_PLLCKSELR;  // @0x028
					RCC_MAP1_IOPENR;     // @0x02c
					RCC_MAP1_AHB1ENR;    // @0x030
					RCC_MAP1_AHB2ENR;    // @0x034
					RCC_MAP1_PLL2DIVR;   // @0x038
					RCC_MAP1_IOPSMENR;   // @0x03c
					RCC_MAP1_APB1ENR;    // @0x040
					RCC_MAP1_APB2ENR;    // @0x044
					__SOOL_PERIPH_PADDING_4;
					RCC_MAP1_CCIPR;      // @0x04c
					RCC_MAP1_D2CCIP1R;   // @0x050
					RCC_MAP1_D2CCIP2R;   // @0x054
					RCC_MAP1_D3CCIPR;    // @0x058
					__SOOL_PERIPH_PADDING_4;
					RCC_MAP1_CIER;       // @0x060
					RCC_MAP1_CIFR;       // @0x064
					RCC_MAP1_AHB1SMENR;  // @0x068
					__SOOL_PERIPH_PADDING_4;
					RCC_MAP1_BDCR;       // @0x070
					RCC_MAP1_CSR;        // @0x074
					__SOOL_PERIPH_PADDING_4;
					RCC_MAP1_APB1SMENR2; // @0x07c
					RCC_MAP1_APB2SMENR;  // @0x080
					__SOOL_PERIPH_PADDING_4;
					RCC_MAP1_AHB4RSTR;   // @0x088
					RCC_MAP1_DCKCFGR1;   // @0x08c
					RCC_MAP1_DCKCFGR2;   // @0x090
					RCC_MAP1_APB1HRSTR;  // @0x094
					__SOOL_PERIPH_PADDING_4;
					RCC_MAP1_CCIPR2;     // @0x09c
					__SOOL_PERIPH_PADDING_32;
					__SOOL_PERIPH_PADDING_16;
					__SOOL_PERIPH_PADDING_4;
					RCC_MAP1_AHB3ENR;    // @0x0d4
					__SOOL_PERIPH_PADDING_32;
					__SOOL_PERIPH_PADDING_4;
					RCC_MAP1_AHB3LPENR;  // @0x0fc
					RCC_MAP1_AHB1LPENR;  // @0x100
					RCC_MAP1_AHB2LPENR;  // @0x104
					__SOOL_PERIPH_PADDING_16;
					RCC_MAP1_APB2LPENR;  // @0x118
					__SOOL_PERIPH_PADDING_4;
				};
				struct
				{
					__SOOL_PERIPH_PADDING_4;
					RCC_MAP2_ICSCR;      // @0x004
					RCC_MAP2_CRRCR;      // @0x008
					RCC_MAP2_CFGR;       // @0x00c
					RCC_MAP2_CIER;       // @0x010
					RCC_MAP2_CIFR;       // @0x014
					RCC_MAP2_D1CFGR;     // @0x018
					RCC_MAP2_IOPRSTR;    // @0x01c
					RCC_MAP2_D3CFGR;     // @0x020
					RCC_MAP2_APB1ENR;    // @0x024
					RCC_MAP2_APB1RSTR;   // @0x028
					RCC_MAP2_PLLCFGR;    // @0x02c
					RCC_MAP2_PLL1DIVR;   // @0x030
					RCC_MAP2_PLL1FRACR;  // @0x034
					RCC_MAP2_APB1RSTR1;  // @0x038
					RCC_MAP2_APB1RSTR2;  // @0x03c
					RCC_MAP2_AHBSMENR;   // @0x040
					RCC_MAP2_APB2SMENR;  // @0x044
					RCC_MAP2_AHB1ENR;    // @0x048
					RCC_MAP2_AHB2ENR;    // @0x04c
					RCC_MAP2_CSR;        // @0x050
					__SOOL_PERIPH_PADDING_4;
					RCC_MAP2_APB1ENR1;   // @0x058
					__SOOL_PERIPH_PADDING_4;
					RCC_MAP2_APB2ENR;    // @0x060
					__SOOL_PERIPH_PADDING_16;
					__SOOL_PERIPH_PADDING_8;
					__SOOL_PERIPH_PADDING_4;
					RCC_MAP2_AHB1RSTR;   // @0x080
					RCC_MAP2_AHB2RSTR;   // @0x084
					RCC_MAP2_CCIPR;      // @0x088
					RCC_MAP2_APB3RSTR;   // @0x08c
					RCC_MAP2_APB1LRSTR;  // @0x090
					__SOOL_PERIPH_PADDING_4;
					RCC_MAP2_APB2RSTR;   // @0x098
					__SOOL_PERIPH_PADDING_128;
					__SOOL_PERIPH_PADDING_4;
				};
				struct
				{
					__SOOL_PERIPH_PADDING_8;
					__SOOL_PERIPH_PADDING_4;
					RCC_MAP3_PLLCFGR;    // @0x00c
					RCC_MAP3_CFGR;       // @0x010
					RCC_MAP3_APB2RSTR;   // @0x014
					RCC_MAP3_CICR;       // @0x018
					RCC_MAP3_AHBENR;     // @0x01c
					RCC_MAP3_AHBRSTR;    // @0x020
					__SOOL_PERIPH_PADDING_4;
					RCC_MAP3_AHBLPENR;   // @0x028
					RCC_MAP3_APB2LPENR;  // @0x02c
					RCC_MAP3_APB1LPENR;  // @0x030
					RCC_MAP3_APB2ENR;    // @0x034
					RCC_MAP3_APB1ENR;    // @0x038
					__SOOL_PERIPH_PADDING_16;
					__SOOL_PERIPH_PADDING_4;
					RCC_MAP3_AHB3ENR;    // @0x050
					__SOOL_PERIPH_PADDING_32;
					__SOOL_PERIPH_PADDING_16;
					__SOOL_PERIPH_PADDING_8;
					__SOOL_PERIPH_PADDING_4;
					RCC_MAP3_BDCR;       // @0x090
					RCC_MAP3_CSR;        // @0x094
					__SOOL_PERIPH_PADDING_128;
					__SOOL_PERIPH_PADDING_8;
				};
				struct
				{
					__SOOL_PERIPH_PADDING_16;
					RCC_MAP4_AHBRSTR;    // @0x010
					RCC_MAP4_PLLSAI2CFGR; // @0x014
					RCC_MAP4_APB1RSTR;   // @0x018
					RCC_MAP4_CIFR;       // @0x01c
					RCC_MAP4_APB2ENR;    // @0x020
					__SOOL_PERIPH_PADDING_4;
					RCC_MAP4_AHB1RSTR;   // @0x028
					RCC_MAP4_AHB2RSTR;   // @0x02c
					RCC_MAP4_AHBENR;     // @0x030
					RCC_MAP4_CSR;        // @0x034
					__SOOL_PERIPH_PADDING_8;
					RCC_MAP4_APB2RSTR;   // @0x040
					__SOOL_PERIPH_PADDING_128;
					__SOOL_PERIPH_PADDING_64;
					__SOOL_PERIPH_PADDING_16;
					__SOOL_PERIPH_PADDING_8;
					__SOOL_PERIPH_PADDING_4;
				};
				struct
				{
					__SOOL_PERIPH_PADDING_16;
					RCC_MAP5_PLLSAI1CFGR; // @0x010
					__SOOL_PERIPH_PADDING_4;
					RCC_MAP5_CIER;       // @0x018
					__SOOL_PERIPH_PADDING_4;
					RCC_MAP5_CICR;       // @0x020
					__SOOL_PERIPH_PADDING_8;
					__SOOL_PERIPH_PADDING_4;
					RCC_MAP5_AHB3RSTR;   // @0x030
					__SOOL_PERIPH_PADDING_128;
					__SOOL_PERIPH_PADDING_32;
					__SOOL_PERIPH_PADDING_16;
					__SOOL_PERIPH_PADDING_8;
					__SOOL_PERIPH_PADDING_4;
					RCC_MAP5_APB2ENR;    // @0x0f0
					__SOOL_PERIPH_PADDING_32;
					__SOOL_PERIPH_PADDING_8;
					__SOOL_PERIPH_PADDING_4;
				};
			};
		private:
			RCC() = delete;

		};

		//region instances
#if defined(STM32F0     ) || defined(STM32F1     ) || defined(STM32F3     ) || defined(STM32L0     ) || \
    defined(STM32L4     ) || defined(STM32L4P    )
#define RCC_BASE_ADDR ((uint32_t)0x40021000U)
#endif

#if defined(STM32F2     ) || defined(STM32F4     ) || defined(STM32F7     ) || defined(STM32L1     )
#define RCC_BASE_ADDR ((uint32_t)0x40023800U)
#endif

#if defined(STM32H7     )
#define RCC_BASE_ADDR ((uint32_t)0x58024400U)
#endif

#ifdef RCC_BASE_ADDR
		volatile class RCC * const RCC = reinterpret_cast<class RCC* const>(RCC_BASE_ADDR);
#endif
//endregion



	};
};
//region undef
#undef RCC_AHB1ENR_0_GPIOAEN
#undef RCC_AHB1ENR_0_GPIOBEN
#undef RCC_AHB1ENR_0_GPIOCEN
#undef RCC_AHB1ENR_0_GPIOHEN
#undef RCC_AHB1ENR_0_DMA1EN
#undef RCC_AHB1ENR_0_DMA2EN
#undef RCC_AHB1RSTR_0_GPIOARST
