/**
 * Copyright (c) 2018-2019 FAUCHER Julien & FRANCE Loic
 * This file is part of SooL core Library.
 *
 *  SooL core Library is free software: you can redistribute it and/or modify
 *  it under the terms of the GNU Lesser General Public License
 *  as published by the Free Software Foundation, either version 3
 *  of the License, or (at your option) any later version.
 *
 *  SooL core Library is distributed in the hope that it will be useful,
 *  but WITHOUT ANY WARRANTY; without even the implied warranty of
 *  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
 *  GNU Lesser General Public License for more details.
 *
 *  You should have received a copy of the GNU Lesser General Public License
 *  along with SooL core Library. If not, see <https://www.gnu.org/licenses/>.
 */
#ifndef __SOOL_SPI_H
#define __SOOL_SPI_H



#include "lib_utils/peripheral_include.h"
#include "RCC.h"

//region defines

#if defined(STM32H7     )
#define SPI_CFG1
#define SPI_CFG2
#define SPI_CR1_0_IOLOCK     IOLOCK               // 1 bits @ 16
#define SPI_CR1_1_SPE        SPE                  // 1 bits @ 0
#define SPI_CR1_1_MASRX      MASRX                // 1 bits @ 8
#define SPI_CR1_1_CSTART     CSTART               // 1 bits @ 9
#define SPI_CR1_1_CSUSP      CSUSP                // 1 bits @ 10
#define SPI_CR1_1_SSI        SSI                  // 1 bits @ 12
#define SPI_CR1_1_CRC3317    CRC3317              // 1 bits @ 13

    defined(STM32L052xx ) || defined(STM32L053xx ) || defined(STM32L061xx ) || defined(STM32L062xx ) ||\
    defined(STM32L063xx ) || defined(STM32L071xx ) || defined(STM32L072xx ) || defined(STM32L073xx ) ||\
    defined(STM32L081xx ) || defined(STM32L082xx ) || defined(STM32L083xx ) || defined(STM32L100xC ) ||\
    defined(STM32L151xC ) || defined(STM32L151xCA) || defined(STM32L151xD ) || defined(STM32L151xDx) ||\
    defined(STM32L151xE ) || defined(STM32L152xC ) || defined(STM32L152xCA) || defined(STM32L152xD ) ||\
    defined(STM32L152xDx) || defined(STM32L152xE ) || defined(STM32L162xC ) || defined(STM32L162xCA) ||\
    defined(STM32L162xD ) || defined(STM32L162xDx) || defined(STM32L162xE )
#define SPI_I2SCFGR_0_I2SMOD I2SMOD               // 1 bits @ 11
#define SPI_MAP0_I2SCFGR     I2SCFGR_TypeDef I2SCFGR
#else
#define SPI_I2SCFGR_0_I2SMOD
#define SPI_MAP0_I2SCFGR __SOOL_PERIPH_PADDING_4
#endif

#if defined(STM32F412Cx ) || defined(STM32F412Rx ) || defined(STM32F412Vx ) || defined(STM32F412Zx ) ||\
    defined(STM32F413xx ) || defined(STM32F423xx ) || defined(STM32F446xx ) || defined(STM32F469xx ) ||\
    defined(STM32F479xx ) || defined(STM32F7     ) || defined(STM32L071xx ) || defined(STM32L072xx ) ||\
    defined(STM32L073xx ) || defined(STM32L081xx ) || defined(STM32L082xx ) || defined(STM32L083xx )
#define SPI_I2SCFGR_0_ASTRTEN ASTRTEN              // 1 bits @ 12
#else
#define SPI_I2SCFGR_0_ASTRTEN
#endif

#if defined(STM32F030x4 ) || defined(STM32F031x6 ) || defined(STM32F038xx ) || defined(STM32F042x6 ) ||\
    defined(STM32F048xx ) || defined(STM32F051x8 ) || defined(STM32F058xx ) || defined(STM32F071xB ) ||\
    defined(STM32F072xB ) || defined(STM32F078xx ) || defined(STM32F091xC ) || defined(STM32F098xx ) ||\
    defined(STM32F1     ) || defined(STM32F2     ) || defined(STM32F301x8 ) || defined(STM32F302x8 ) ||\
    defined(STM32F302xC ) || defined(STM32F302xE ) || defined(STM32F303xC ) || defined(STM32F303xE ) ||\
    defined(STM32F318xx ) || defined(STM32F358xx ) || defined(STM32F373xC ) || defined(STM32F378xx ) ||\
    defined(STM32F398xx ) || defined(STM32F4     ) || defined(STM32F7     ) || defined(STM32L0     ) ||\
    defined(STM32L1     ) || defined(STM32L4     ) || defined(STM32L4P    )
#define SPI_SR_0_CHSIDE      CHSIDE               // 1 bits @ 2
#define SPI_SR_0_UDR         UDR                  // 1 bits @ 3
#else
#define SPI_SR_0_CHSIDE
#define SPI_SR_0_UDR
#endif

#if defined(STM32F0     ) || defined(STM32F2     ) || defined(STM32F3     ) || defined(STM32F4     ) ||\
    defined(STM32F7     ) || defined(STM32L0     ) || defined(STM32L1     ) || defined(STM32L4     ) ||\
    defined(STM32L4P    )
#define SPI_SR_0_FRE         FRE                  // 1 bits @ 8
#else
#define SPI_SR_0_FRE
#endif

#if defined(STM32L4P    )
#define SPI_VERR
#define SPI_MAP0_VERR        VERR_TypeDef VERR
#else
#define SPI_MAP0_VERR __SOOL_PERIPH_PADDING_4
#endif

//endregion
namespace sool
{
	namespace core
	{
//region related-types
		
//endregion
//region peripheral-declaration

		class SPI
		{
			

		public :

#ifdef SPI_CFG1
			struct CFG1_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t DSIZE                :5;
					uint32_t FTHLV                :4;
					uint32_t UDRCFG               :2;
					uint32_t UDRDET               :2;
					uint32_t                      :1;
					uint32_t RXDMAEN              :1;
					uint32_t TXDMAEN              :1;
					uint32_t CRCSIZE              :5;
					uint32_t                      :1;
					uint32_t CRCEN                :1;
					uint32_t                      :5;
					uint32_t MBR                  :3;
					uint32_t                      :1;

				
			};
#endif

#ifdef SPI_CFG2
			struct CFG2_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t MSSI                 :4;
					uint32_t MIDI                 :4;
					uint32_t                      :7;
					uint32_t IOSWP                :1;
					uint32_t                      :1;
					uint32_t COMM                 :2;
					uint32_t SP                   :3;
					uint32_t MASTER               :1;
					uint32_t LSBFRST              :1;
					uint32_t CPHA                 :1;
					uint32_t CPOL                 :1;
					uint32_t SSM                  :1;
					uint32_t                      :1;
					uint32_t SSIOP                :1;
					uint32_t SSOE                 :1;
					uint32_t SSOM                 :1;
					uint32_t AFCNTR               :1;

				
			};
#endif

#ifdef SPI_CR1
			struct CR1_TypeDef : public Reg16_t
			{
				using Reg16_t::operator=;

				union
				{
					struct
					{
						uint32_t SPI_CR1_0_CPHA       :1;
						uint32_t SPI_CR1_0_CPOL       :1;
						uint32_t SPI_CR1_0_MSTR       :1;
						uint32_t SPI_CR1_0_BR         :3;
						uint32_t SPI_CR1_0_SPE        :1;
						uint32_t SPI_CR1_0_LSBFIRST   :1;
						uint32_t SPI_CR1_0_SSI        :1;
						uint32_t SPI_CR1_0_SSM        :1;
						uint32_t SPI_CR1_0_RXONLY     :1;
						uint32_t SPI_CR1_0_CRCL       :1;
						uint32_t SPI_CR1_0_CRCNEXT    :1;
						uint32_t SPI_CR1_0_CRCEN      :1;
						uint32_t SPI_CR1_0_BIDIOE     :1;
						uint32_t SPI_CR1_0_BIDIMODE   :1;
						uint32_t SPI_CR1_0_IOLOCK     :1;
						uint32_t                      :15;
					};
#ifdef SPI_CR1_1
					struct
					{
						uint32_t SPI_CR1_1_SPE        :1;
						uint32_t                      :7;
						uint32_t SPI_CR1_1_MASRX      :1;
						uint32_t SPI_CR1_1_CSTART     :1;
						uint32_t SPI_CR1_1_CSUSP      :1;
						uint32_t SPI_CR1_1_DFF        :1;
						uint32_t SPI_CR1_1_SSI        :1;
						uint32_t SPI_CR1_1_CRC3317    :1;
						uint32_t SPI_CR1_1_RCRCINI    :1;
						uint32_t SPI_CR1_1_TCRCINI    :1;
						uint32_t                      :16;
					};
#endif
#ifdef SPI_CR1_2
					struct
					{
						uint32_t                      :11;
						uint32_t HDDIR                :1;
						uint32_t                      :20;
					};
#endif
				};
				
			};
#endif

#ifdef SPI_CR2
			struct CR2_TypeDef : public Reg16_t
			{
				using Reg16_t::operator=;

				union
				{
					struct
					{
						uint32_t SPI_CR2_0_RXDMAEN    :1;
						uint32_t SPI_CR2_0_TXDMAEN    :1;
						uint32_t SPI_CR2_0_SSOE       :1;
						uint32_t SPI_CR2_0_NSSP       :1;
						uint32_t SPI_CR2_0_FRF        :1;
						uint32_t SPI_CR2_0_ERRIE      :1;
						uint32_t SPI_CR2_0_RXNEIE     :1;
						uint32_t SPI_CR2_0_TXEIE      :1;
						uint32_t SPI_CR2_0_DS         :4;
						uint32_t SPI_CR2_0_FRXTH      :1;
						uint32_t SPI_CR2_0_LDMARX     :1;
						uint32_t SPI_CR2_0_LDMATX     :1;
						uint32_t                      :1;
						uint32_t SPI_CR2_0_TSER       :16;
					};
#ifdef SPI_CR2_1
					struct
					{
						uint32_t TSIZE                :16;
						uint32_t                      :16;
					};
#endif
				};
				
			};
#endif

#ifdef SPI_CRCPOLY
			struct CRCPOLY_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t CRCPOLY              :32;

				
			};
#endif

#ifdef SPI_CRCPR
			struct CRCPR_TypeDef : public Reg16_t
			{
				using Reg16_t::operator=;

				union
				{
					#ifdef SPI_CRCPR_0
					struct
					{
						uint32_t CRCPOLY              :32;
					};
					#endif
					#ifdef SPI_CRCPR_1
					struct
					{
						uint32_t CRCPOLY              :16;
						uint32_t                      :16;
					};
					#endif
				};
				
			};
#endif

#ifdef SPI_DR
			struct DR_TypeDef : public Reg16_t
			{
				using Reg16_t::operator=;

				union
				{
					#ifdef SPI_DR_0
					struct
					{
						uint32_t DR                   :32;
					};
					#endif
					#ifdef SPI_DR_1
					struct
					{
						uint32_t DR                   :16;
						uint32_t                      :16;
					};
					#endif
				};
				
			};
#endif

#ifdef SPI_I2SCFGR
			struct I2SCFGR_TypeDef : public Reg16_t
			{
				using Reg16_t::operator=;

				union
				{
					struct
					{
						uint32_t SPI_I2SCFGR_0_CHLEN  :1;
						uint32_t SPI_I2SCFGR_0_DATLEN :2;
						uint32_t SPI_I2SCFGR_0_CKPOL  :1;
						uint32_t SPI_I2SCFGR_0_I2SSTD :2;
						uint32_t                      :1;
						uint32_t SPI_I2SCFGR_0_PCMSYNC :1;
						uint32_t SPI_I2SCFGR_0_I2SCFG :2;
						uint32_t SPI_I2SCFGR_0_I2SE   :1;
						uint32_t SPI_I2SCFGR_0_I2SMOD :1;
						uint32_t SPI_I2SCFGR_0_ASTRTEN :1;
						uint32_t SPI_I2SCFGR_0_FIXCH  :1;
						uint32_t                      :2;
						uint32_t SPI_I2SCFGR_0_I2SDIV :8;
						uint32_t SPI_I2SCFGR_0_ODD    :1;
						uint32_t SPI_I2SCFGR_0_MCKOE  :1;
						uint32_t                      :6;
					};
					#ifdef SPI_I2SCFGR_1
					struct
					{
						uint32_t I2SMOD               :1;
						uint32_t I2SCFG               :3;
						uint32_t                      :4;
						uint32_t DATLEN               :2;
						uint32_t CHLEN                :1;
						uint32_t CKPOL                :1;
						uint32_t WSINV                :1;
						uint32_t                      :19;
					};
					#endif
					#ifdef SPI_I2SCFGR_2
					struct
					{
						uint32_t                      :12;
						uint32_t DATFMT               :2;
						uint32_t                      :18;
					};
					#endif
				};
				
			};
#endif

#ifdef SPI_I2SPR
			struct I2SPR_TypeDef : public Reg16_t
			{
				using Reg16_t::operator=;

					uint32_t I2SDIV               :8;
					uint32_t ODD                  :1;
					uint32_t MCKOE                :1;
					uint32_t                      :22;

				
			};
#endif

#ifdef SPI_IER
			struct IER_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t RXPIE                :1;
					uint32_t TXPIE                :1;
					uint32_t DXPIE                :1;
					uint32_t EOTIE                :1;
					uint32_t TXTFIE               :1;
					uint32_t UDRIE                :1;
					uint32_t OVRIE                :1;
					uint32_t CRCIE                :1;
					uint32_t TIFREIE              :1;
					uint32_t MODFIE               :1;
					uint32_t TSERIE               :1;
					uint32_t                      :21;

				
			};
#endif

#ifdef SPI_IFCR
			struct IFCR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t                      :3;
					uint32_t EOTC                 :1;
					uint32_t TXTFC                :1;
					uint32_t UDRC                 :1;
					uint32_t OVRC                 :1;
					uint32_t CRCEC                :1;
					uint32_t TIFREC               :1;
					uint32_t MODFC                :1;
					uint32_t TSERFC               :1;
					uint32_t SUSPC                :1;
					uint32_t                      :20;

				
			};
#endif

#ifdef SPI_RXCRCR
			struct RXCRCR_TypeDef : public Reg16_t
			{
				using Reg16_t::operator=;

				union
				{
					#ifdef SPI_RXCRCR_0
					struct
					{
						uint32_t RXCRC                :32;
					};
					#endif
					#ifdef SPI_RXCRCR_1
					struct
					{
						uint32_t RXCRC                :16;
						uint32_t                      :16;
					};
					#endif
				};
				
			};
#endif

#ifdef SPI_RXDR
			struct RXDR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t RXDR                 :32;

				
			};
#endif

#ifdef SPI_SR
			struct SR_TypeDef : public Reg16_t
			{
				using Reg16_t::operator=;

				union
				{
					struct
					{
						uint32_t SPI_SR_0_RXNE        :1;
						uint32_t SPI_SR_0_TXE         :1;
						uint32_t SPI_SR_0_CHSIDE      :1;
						uint32_t SPI_SR_0_UDR         :1;
						uint32_t SPI_SR_0_CRCERR      :1;
						uint32_t SPI_SR_0_MODF        :1;
						uint32_t OVR                  :1;
						uint32_t SPI_SR_0_BSY         :1;
						uint32_t SPI_SR_0_FRE         :1;
						uint32_t SPI_SR_0_FRLVL       :2;
						uint32_t SPI_SR_0_FTLVL       :2;
						uint32_t SPI_SR_0_RXPLVL      :2;
						uint32_t SPI_SR_0_RXWNE       :1;
						uint32_t SPI_SR_0_CTSIZE      :16;
					};
#ifdef SPI_SR_1
					struct
					{
						uint32_t RXP                  :1;
						uint32_t TXP                  :1;
						uint32_t DXP                  :1;
						uint32_t EOT                  :1;
						uint32_t TXTF                 :1;
						uint32_t UDR                  :1;
						uint32_t                      :1;
						uint32_t CRCE                 :1;
						uint32_t TIFRE                :1;
						uint32_t MODF                 :1;
						uint32_t TSERF                :1;
						uint32_t SUSP                 :1;
						uint32_t TXC                  :1;
						uint32_t                      :19;
					};
#endif
				};
				
			};
#endif

#ifdef SPI_TXCRC
			struct TXCRC_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

				union
				{
					struct
					{
						uint32_t TXCRC                :32;
					};
					struct
					{
						uint32_t RXCRC                :32;
					};
				};
				
			};
#endif

#ifdef SPI_TXCRCR
			struct TXCRCR_TypeDef : public Reg16_t
			{
				using Reg16_t::operator=;

				union
				{
					#ifdef SPI_TXCRCR_0
					struct
					{
						uint32_t TXCRC                :32;
					};
					#endif
					#ifdef SPI_TXCRCR_1
					struct
					{
						uint32_t TXCRC                :16;
						uint32_t                      :16;
					};
					#endif
				};
				
			};
#endif

#ifdef SPI_TXDR
			struct TXDR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t TXDR                 :32;

				
			};
#endif

#ifdef SPI_UDRDR
			struct UDRDR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t UDRDR                :32;

				
			};
#endif

#ifdef SPI_VERR
			struct VERR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;

					uint32_t MINREV               :4;
					uint32_t MAJREV               :4;
					uint32_t                      :24;

				
			};
#endif

			union
			{

				struct
				{
					CR1_TypeDef CR1;     // @0x000
					CR2_TypeDef CR2;     // @0x004
					SPI_MAP0_SR;         // @0x008
					SPI_MAP0_DR;         // @0x00c
					SPI_MAP0_CRCPR;      // @0x010
					SPI_MAP0_RXCRCR;     // @0x014
					SPI_MAP0_TXCRCR;     // @0x018
					SPI_MAP0_I2SCFGR;    // @0x01c
					SPI_MAP0_I2SPR;      // @0x020
					__SOOL_PERIPH_PADDING_8;
					__SOOL_PERIPH_PADDING_4;
					SPI_MAP0_RXDR;       // @0x030
					__SOOL_PERIPH_PADDING_8;
					__SOOL_PERIPH_PADDING_4;
					SPI_MAP0_CRCPOLY;    // @0x040
					SPI_MAP0_TXCRC;      // @0x044
					SPI_MAP0_RXCRC;      // @0x048
					SPI_MAP0_UDRDR;      // @0x04c
					__SOOL_PERIPH_PADDING_512;
					__SOOL_PERIPH_PADDING_256;
					__SOOL_PERIPH_PADDING_128;
					__SOOL_PERIPH_PADDING_32;
					__SOOL_PERIPH_PADDING_4;
					SPI_MAP0_VERR;       // @0x3f4
				};
				struct
				{
					__SOOL_PERIPH_PADDING_8;
					SPI_MAP1_CFG1;       // @0x008
					SPI_MAP1_CFG2;       // @0x00c
					SPI_MAP1_IER;        // @0x010
					SPI_MAP1_SR;         // @0x014
					SPI_MAP1_IFCR;       // @0x018
					__SOOL_PERIPH_PADDING_4;
					SPI_MAP1_TXDR;       // @0x020
					__SOOL_PERIPH_PADDING_32;
					__SOOL_PERIPH_PADDING_8;
					__SOOL_PERIPH_PADDING_4;
					SPI_MAP1_I2SCFGR;    // @0x050
					__SOOL_PERIPH_PADDING_512;
					__SOOL_PERIPH_PADDING_256;
					__SOOL_PERIPH_PADDING_128;
					__SOOL_PERIPH_PADDING_32;
					__SOOL_PERIPH_PADDING_4;
				};
			};
		private:
			SPI() = delete;
			private:
				static constexpr uint32_t get_clock_enable_bit(const uint32_t addr);
			
				static constexpr volatile Reg32_t &get_clock_enable_reg(const uint32_t addr);
			
			public:
				void enable_clock() volatile;
			
				void disable_clock() volatile;
			
				bool is_clock_enabled() const volatile;
			
		};

//endregion
//region instances
#if defined(STM32F030x4 ) || defined(STM32F030x8 ) || defined(STM32F030xC ) || defined(STM32F042x6 ) ||\
    defined(STM32F048xx ) || defined(STM32F051x8 ) || defined(STM32F058xx ) || defined(STM32F070xB ) ||\
    defined(STM32F071xB ) || defined(STM32F072xB ) || defined(STM32F078xx ) || defined(STM32F091xC ) ||\
