/**
 * Copyright (c) 2018-2019 FAUCHER Julien & FRANCE Loic
 * This file is part of SooL core Library.
 *
 *  SooL core Library is free software: you can redistribute it and/or modify
 *  it under the terms of the GNU Lesser General Public License
 *  as published by the Free Software Foundation, either version 3
 *  of the License, or (at your option) any later version.
 *
 *  SooL core Library is distributed in the hope that it will be useful,
 *  but WITHOUT ANY WARRANTY; without even the implied warranty of
 *  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
 *  GNU Lesser General Public License for more details.
 *
 *  You should have received a copy of the GNU Lesser General Public License
 *  along with SooL core Library. If not, see <https://www.gnu.org/licenses/>.
 */
#ifndef __SOOL_SYSCFG_H
#define __SOOL_SYSCFG_H

#if defined(STM32F0     ) || defined(STM32F2     ) || defined(STM32F3     ) || defined(STM32F4     ) ||\
    defined(STM32F7     ) || defined(STM32H7     ) || defined(STM32L0     ) || defined(STM32L1     ) ||\
    defined(STM32L4     ) || defined(STM32L4P    ) 


#include "lib_utils/peripheral_include.h"
#include "RCC.h"

//region defines

#if defined(STM32F765xx ) || defined(STM32F767xx ) || defined(STM32F769xx ) || defined(STM32F777xx ) ||\
    defined(STM32F779xx ) 
#define SYSCFG_CBR
#define SYSCFG_MEMRMP_1_SWP_FB SWP_FB               // 1 bits @ 8
#define SYSCFG_PMC_0_I2C4_FMP I2C4_FMP             // 1 bits @ 3

#define SYSCFG_SWPR_PAGE16   PAGE16               // 1 bits @ 16
#define SYSCFG_SWPR_PAGE17   PAGE17               // 1 bits @ 17
#define SYSCFG_SWPR_PAGE18   PAGE18               // 1 bits @ 18
#define SYSCFG_SWPR_PAGE19   PAGE19               // 1 bits @ 19
#define SYSCFG_SWPR_PAGE20   PAGE20               // 1 bits @ 20
#define SYSCFG_SWPR_PAGE21   PAGE21               // 1 bits @ 21
#define SYSCFG_SWPR_PAGE22   PAGE22               // 1 bits @ 22
#define SYSCFG_SWPR_PAGE23   PAGE23               // 1 bits @ 23
#define SYSCFG_SWPR_PAGE24   PAGE24               // 1 bits @ 24
#define SYSCFG_SWPR_PAGE25   PAGE25               // 1 bits @ 25
#define SYSCFG_SWPR_PAGE26   PAGE26               // 1 bits @ 26
#define SYSCFG_SWPR_PAGE27   PAGE27               // 1 bits @ 27
#define SYSCFG_SWPR_PAGE28   PAGE28               // 1 bits @ 28
#define SYSCFG_SWPR_PAGE29   PAGE29               // 1 bits @ 29
#define SYSCFG_SWPR_PAGE30   PAGE30               // 1 bits @ 30
#define SYSCFG_SWPR_PAGE31   PAGE31               // 1 bits @ 31
#else
#define SYSCFG_SWPR_PAGE16
#define SYSCFG_SWPR_PAGE17
#define SYSCFG_SWPR_PAGE18
#define SYSCFG_SWPR_PAGE19
#define SYSCFG_SWPR_PAGE20
#define SYSCFG_SWPR_PAGE21
#define SYSCFG_SWPR_PAGE22
#define SYSCFG_SWPR_PAGE23
#define SYSCFG_SWPR_PAGE24
#define SYSCFG_SWPR_PAGE25
#define SYSCFG_SWPR_PAGE26
#define SYSCFG_SWPR_PAGE27
#define SYSCFG_SWPR_PAGE28
#define SYSCFG_SWPR_PAGE29
#define SYSCFG_SWPR_PAGE30
#define SYSCFG_SWPR_PAGE31
#endif

#if defined(STM32L496xx ) || defined(STM32L4A6xx ) || defined(STM32L4P    ) 
#define SYSCFG_SWPR2
#define SYSCFG_MAP1_SWPR2    SWPR2_TypeDef SWPR2
#else
#define SYSCFG_MAP1_SWPR2 __SOOL_PERIPH_PADDING_4
#endif

#if defined(STM32F0     ) || defined(STM32F3     ) || defined(STM32L0     ) 
#define SYSCFG_MAP0_CFGR1    CFGR1_TypeDef CFGR1
#else
#define SYSCFG_MAP0_CFGR1 __SOOL_PERIPH_PADDING_4
#endif

#if defined(STM32F0     ) || defined(STM32F3     ) 
#define SYSCFG_MAP0_CFGR2    CFGR2_TypeDef CFGR2
#else
#define SYSCFG_MAP0_CFGR2 __SOOL_PERIPH_PADDING_4
#endif

#if defined(STM32F410Cx ) || defined(STM32F410Rx ) || defined(STM32F410Tx ) || defined(STM32F412Cx ) ||\
    defined(STM32F412Rx ) || defined(STM32F412Vx ) || defined(STM32F412Zx ) || defined(STM32F413xx ) ||\
    defined(STM32F423xx ) || defined(STM32L4     ) || defined(STM32L4P    ) 
#define SYSCFG_MAP1_CFGR2    CFGR2_TypeDef CFGR2
#else
#define SYSCFG_MAP1_CFGR2 __SOOL_PERIPH_PADDING_4
#endif

#if defined(STM32F410Cx ) || defined(STM32F410Rx ) || defined(STM32F410Tx ) || defined(STM32F412Cx ) ||\
    defined(STM32F412Rx ) || defined(STM32F412Vx ) || defined(STM32F412Zx ) 
#define SYSCFG_MAP0_CFGR     CFGR_TypeDef CFGR
#else
#define SYSCFG_MAP0_CFGR __SOOL_PERIPH_PADDING_4
#endif

#if defined(STM32F413xx ) || defined(STM32F423xx ) || defined(STM32F446xx ) 
#define SYSCFG_MAP1_CFGR     CFGR_TypeDef CFGR
#else
#define SYSCFG_MAP1_CFGR __SOOL_PERIPH_PADDING_4
#endif

//endregion
namespace sool
{
	namespace core
	{
//region related-types
		
//endregion
//region peripheral-declaration
		
		class SYSCFG
		{
			
			
			public :
			
			#ifdef SYSCFG_CBR
			struct CBR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t CLL                  :1;
					uint32_t                      :1;
					uint32_t PVDL                 :1;
					uint32_t                      :29;
			
				
			};
			#endif
			
			#ifdef SYSCFG_CCCR
			struct CCCR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t NCC                  :4;
					uint32_t PCC                  :4;
					uint32_t                      :24;
			
				
			};
			#endif
			
			#ifdef SYSCFG_CCCSR
			struct CCCSR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t EN                   :1;
					uint32_t CS                   :1;
					uint32_t                      :6;
					uint32_t READY                :1;
					uint32_t                      :7;
					uint32_t HSLV                 :1;
					uint32_t                      :15;
			
				
			};
			#endif
			
			#ifdef SYSCFG_CCVR
			struct CCVR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t NCV                  :4;
					uint32_t PCV                  :4;
					uint32_t                      :24;
			
				
			};
			#endif
			
			#ifdef SYSCFG_CFGR
			struct CFGR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t FMPI2C1_SCL          :1;
					uint32_t FMPI2C1_SDA          :1;
					uint32_t                      :30;
			
				
			};
			#endif
			
			#ifdef SYSCFG_CFGR1
			struct CFGR1_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					#ifdef SYSCFG_CFGR1_0
					struct
					{
						uint32_t SYSCFG_CFGR1_0_MEM_MODE :2;
						uint32_t                      :1;
						uint32_t SYSCFG_CFGR1_0_UFB   :1;
						uint32_t SYSCFG_CFGR1_0_PA11_PA12_RMP :1;
						uint32_t SYSCFG_CFGR1_0_USB_IT_RMP :1;
						uint32_t SYSCFG_CFGR1_0_IR_MOD :2;
						uint32_t SYSCFG_CFGR1_0_DMA_RMP :5;
						uint32_t SYSCFG_CFGR1_0_TIM16_DMA_RMP2 :1;
						uint32_t SYSCFG_CFGR1_0_TIM17_DMA_RMP2 :1;
						uint32_t SYSCFG_CFGR1_0_DAC2Ch1_DMA_RMP :1;
						uint32_t SYSCFG_CFGR1_0_I2C_FMP_PB6 :1;
						uint32_t SYSCFG_CFGR1_0_I2C_FMP_PB7 :1;
						uint32_t SYSCFG_CFGR1_0_I2C_FMP_PB8 :1;
						uint32_t SYSCFG_CFGR1_0_I2C_FMP_PB9 :1;
						uint32_t SYSCFG_CFGR1_0_I2C_FMP_I2C1 :1;
						uint32_t SYSCFG_CFGR1_0_I2C_FMP_I2C2 :1;
						uint32_t SYSCFG_CFGR1_0_I2C_FMP_PA9 :1;
						uint32_t SYSCFG_CFGR1_0_I2C_FMP_PA10 :1;
						uint32_t SYSCFG_CFGR1_0_SPI2_DMA_RMP :1;
						uint32_t SYSCFG_CFGR1_0_USART2_DMA_RMP :1;
						uint32_t SYSCFG_CFGR1_0_USART3_DMA_RMP :1;
						uint32_t SYSCFG_CFGR1_0_I2C1_DMA_RMP :1;
						uint32_t SYSCFG_CFGR1_0_TIM1_DMA_RMP :1;
						uint32_t SYSCFG_CFGR1_0_TIM2_DMA_RMP :1;
						uint32_t SYSCFG_CFGR1_0_TIM3_DMA_RMP :1;
						uint32_t                      :1;
					};
					#endif
					#ifdef SYSCFG_CFGR1_1
					struct
					{
						uint32_t SYSCFG_CFGR1_1_MEM_MODE :3;
						uint32_t                      :3;
						uint32_t SYSCFG_CFGR1_1_TIM1_ITR3_RMP :1;
						uint32_t SYSCFG_CFGR1_1_DAC1_TRIG1_RMP :1;
						uint32_t SYSCFG_CFGR1_1_ADC_DMA_RMP :1;
						uint32_t SYSCFG_CFGR1_1_USART1TX_DMA_RMP :1;
						uint32_t SYSCFG_CFGR1_1_USART1RX_DMA_RMP :1;
						uint32_t SYSCFG_CFGR1_1_TIM16_DMA_RMP :1;
						uint32_t SYSCFG_CFGR1_1_TIM17_DMA_RMP :1;
						uint32_t SYSCFG_CFGR1_1_TIM6DAC1Ch1_DMA_RMP :1;
						uint32_t SYSCFG_CFGR1_1_TIM7DAC1Ch2_DMA_RMP :1;
						uint32_t SYSCFG_CFGR1_1_TIM18DAC2Ch1_DMA_RMP :1;
						uint32_t SYSCFG_CFGR1_1_I2C_PB6_FMP :1;
						uint32_t SYSCFG_CFGR1_1_I2C_PB7_FMP :1;
						uint32_t SYSCFG_CFGR1_1_I2C_PB8_FMP :1;
						uint32_t SYSCFG_CFGR1_1_I2C_PB9_FMP :1;
						uint32_t SYSCFG_CFGR1_1_I2C1_FMP :1;
						uint32_t SYSCFG_CFGR1_1_I2C2_FMP :1;
						uint32_t SYSCFG_CFGR1_1_ENCODER_MODE :2;
						uint32_t SYSCFG_CFGR1_1_I2C3_FMP :1;
						uint32_t                      :1;
						uint32_t SYSCFG_CFGR1_1_FPU_IE :6;
					};
					#endif
					#ifdef SYSCFG_CFGR1_2
					struct
					{
						uint32_t SYSCFG_CFGR1_2_FWDIS :1;
						uint32_t                      :7;
						uint32_t SYSCFG_CFGR1_2_ADC24_DMA_RMP :1;
						uint32_t                      :2;
						uint32_t SYSCFG_CFGR1_2_DMA_RMP :3;
						uint32_t                      :8;
						uint32_t SYSCFG_CFGR1_2_I2C3_FMP :1;
						uint32_t SYSCFG_CFGR1_2_I2C4_FMP :1;
						uint32_t SYSCFG_CFGR1_2_VBAT  :1;
						uint32_t                      :7;
					};
					#endif
					#ifdef SYSCFG_CFGR1_3
					struct
					{
						uint32_t                      :8;
						uint32_t SYSCFG_CFGR1_3_BOOT_MODE :2;
						uint32_t                      :1;
						uint32_t SYSCFG_CFGR1_3_DMA_RMP :5;
						uint32_t                      :16;
					};
					#endif
					#ifdef SYSCFG_CFGR1_4
					struct
					{
						uint32_t                      :8;
						uint32_t BOOSTEN              :1;
						uint32_t                      :23;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef SYSCFG_CFGR2
			struct CFGR2_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					#ifdef SYSCFG_CFGR2_0
					struct
					{
						uint32_t SYSCFG_CFGR2_0_LOCKUP_LOCK :1;
						uint32_t SYSCFG_CFGR2_0_SRAM_PARITY_LOCK :1;
						uint32_t SYSCFG_CFGR2_0_PVD_LOCK :1;
						uint32_t SYSCFG_CFGR2_0_ECCL  :1;
						uint32_t SYSCFG_CFGR2_0_BYP_ADDR_PAR :1;
						uint32_t                      :3;
						uint32_t SYSCFG_CFGR2_0_SRAM_PEF :1;
						uint32_t SYSCFG_CFGR2_0_I2C_PB7_FMP :1;
						uint32_t SYSCFG_CFGR2_0_I2C_PB8_FMP :1;
						uint32_t SYSCFG_CFGR2_0_I2C_PB9_FMP :1;
						uint32_t SYSCFG_CFGR2_0_I2C1_FMP :1;
						uint32_t SYSCFG_CFGR2_0_I2C2_FMP :1;
						uint32_t SYSCFG_CFGR2_0_I2C3_FMP :1;
						uint32_t                      :17;
					};
					#endif
					#ifdef SYSCFG_CFGR2_1
					struct
					{
						uint32_t SYSCFG_CFGR2_1_FWDISEN :1;
						uint32_t SYSCFG_CFGR2_1_CAPA  :3;
						uint32_t                      :4;
						uint32_t SYSCFG_CFGR2_1_SRAM_PE :1;
						uint32_t                      :23;
					};
					#endif
					#ifdef SYSCFG_CFGR2_2
					struct
					{
						uint32_t SYSCFG_CFGR2_2_CLL   :1;
						uint32_t SYSCFG_CFGR2_2_CAPA  :5;
						uint32_t                      :2;
						uint32_t SYSCFG_CFGR2_2_I2C_PB6_FMP :1;
						uint32_t                      :23;
					};
					#endif
					#ifdef SYSCFG_CFGR2_3
					struct
					{
						uint32_t                      :1;
						uint32_t SPL                  :1;
						uint32_t PVDL                 :1;
						uint32_t                      :5;
						uint32_t SPF                  :1;
						uint32_t                      :23;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef SYSCFG_CFGR3
			struct CFGR3_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					struct
					{
						uint32_t SYSCFG_CFGR3_0_DMA_RMP :10;
						uint32_t                      :2;
						uint32_t SYSCFG_CFGR3_0_ENBUFLP_VREFINT_COMP :1;
						uint32_t SYSCFG_CFGR3_0_ENREF_HSI48 :1;
						uint32_t                      :2;
						uint32_t SYSCFG_CFGR3_0_TRIGGER_RMP :2;
						uint32_t                      :12;
						uint32_t SYSCFG_CFGR3_0_VREFINT_RDYF :1;
						uint32_t SYSCFG_CFGR3_0_REF_LOCK :1;
					};
					#ifdef SYSCFG_CFGR3_1
					struct
					{
						uint32_t SPI1_RX_DMA_RMP      :2;
						uint32_t SPI1_TX_DMA_RMP      :2;
						uint32_t I2C1_RX_DMA_RMP      :2;
						uint32_t I2C1_TX_DMA_RMP      :2;
						uint32_t ADC2_DMA_RMP         :2;
						uint32_t                      :6;
						uint32_t SYSCFG_CFGR3_1_DAC1_TRG3_RMP :1;
						uint32_t SYSCFG_CFGR3_1_DAC1_TRG5_RMP :1;
						uint32_t                      :14;
					};
					#endif
					#ifdef SYSCFG_CFGR3_2
					struct
					{
						uint32_t                      :4;
						uint32_t VREF_OUT             :2;
						uint32_t                      :2;
						uint32_t ENBUF_VREFINT_ADC    :1;
						uint32_t ENBUF_SENSOR_ADC     :1;
						uint32_t                      :22;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef SYSCFG_CFGR4
			struct CFGR4_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t ADC12_EXT2_RMP       :1;
					uint32_t ADC12_EXT3_RMP       :1;
					uint32_t ADC12_EXT5_RMP       :1;
					uint32_t ADC12_EXT13_RMP      :1;
					uint32_t ADC12_EXT15_RMP      :1;
					uint32_t ADC12_JEXT3_RMP      :1;
					uint32_t ADC12_JEXT6_RMP      :1;
					uint32_t ADC12_JEXT13_RMP     :1;
					uint32_t ADC34_EXT5_RMP       :1;
					uint32_t ADC34_EXT6_RMP       :1;
					uint32_t ADC34_EXT15_RMP      :1;
					uint32_t ADC34_JEXT5_RMP      :1;
					uint32_t ADC34_JEXT11_RMP     :1;
					uint32_t ADC34_JEXT14_RMP     :1;
					uint32_t                      :18;
			
				
			};
			#endif
			
			#ifdef SYSCFG_CMPCR
			struct CMPCR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t CMP_PD               :1;
					uint32_t                      :7;
					uint32_t READY                :1;
					uint32_t                      :23;
			
				
			};
			#endif
			
			#ifdef SYSCFG_EXTICR
			struct EXTICR_TypeDef : public BigArrayReg_t<uint32_t, 0, 4, 4>
			{
				using BigArrayReg_t<uint32_t, 0, 4, 4>::operator=;
				
					uint32_t EXTI0                :4;
					uint32_t EXTI1                :4;
					uint32_t EXTI2                :4;
					uint32_t EXTI3                :4;
					uint32_t                      :16;
					uint32_t EXTI4                :4;
					uint32_t EXTI5                :4;
					uint32_t EXTI6                :4;
					uint32_t EXTI7                :4;
					uint32_t                      :16;
					uint32_t EXTI8                :4;
					uint32_t EXTI9                :4;
					uint32_t EXTI10               :4;
					uint32_t EXTI11               :4;
					uint32_t                      :16;
					uint32_t EXTI12               :4;
					uint32_t EXTI13               :4;
					uint32_t EXTI14               :4;
					uint32_t EXTI15               :4;
					uint32_t                      :16;
			
				
			};
			#endif
			
			#ifdef SYSCFG_IT_LINE_SR
			struct IT_LINE_SR_TypeDef : public BigArrayReg_t<uint32_t, 0, 4, 32>
			{
				using BigArrayReg_t<uint32_t, 0, 4, 32>::operator=;
				
					uint32_t SR_EWDG              :1;
					uint32_t                      :31;
					uint32_t SYSCFG_IT_LINE_SR_SR_PVDOUT :1;
					uint32_t SR_VDDIO2            :1;
					uint32_t                      :30;
					uint32_t SR_RTC_ALRA          :1;
					uint32_t SR_RTC_TSTAMP        :1;
					uint32_t SR_RTC_WAKEUP        :1;
					uint32_t                      :29;
					uint32_t SR_FLASH_ITF         :1;
					uint32_t                      :31;
					uint32_t SR_CRS               :1;
					uint32_t SR_CLK_CTRL          :1;
					uint32_t                      :30;
					uint32_t SR_EXTI0             :1;
					uint32_t SR_EXTI1             :1;
					uint32_t                      :30;
					uint32_t SR_EXTI2             :1;
					uint32_t SR_EXTI3             :1;
					uint32_t                      :30;
					uint32_t SR_EXTI4             :1;
					uint32_t SR_EXTI5             :1;
					uint32_t SR_EXTI6             :1;
					uint32_t SR_EXTI7             :1;
					uint32_t SR_EXTI8             :1;
					uint32_t SR_EXTI9             :1;
					uint32_t SR_EXTI10            :1;
					uint32_t SR_EXTI11            :1;
					uint32_t SR_EXTI12            :1;
					uint32_t SR_EXTI13            :1;
					uint32_t SR_EXTI14            :1;
					uint32_t SR_EXTI15            :1;
					uint32_t                      :20;
					uint32_t SR_TSC_EOA           :1;
					uint32_t SR_TSC_MCE           :1;
					uint32_t                      :30;
					uint32_t SR_DMA1_CH1          :1;
					uint32_t                      :31;
					uint32_t SR_DMA1_CH2          :1;
					uint32_t SR_DMA1_CH3          :1;
					uint32_t SR_DMA2_CH1          :1;
					uint32_t SR_DMA2_CH2          :1;
					uint32_t                      :28;
					uint32_t SR_DMA1_CH4          :1;
					uint32_t SR_DMA1_CH5          :1;
					uint32_t SR_DMA1_CH6          :1;
					uint32_t SR_DMA1_CH7          :1;
					uint32_t SR_DMA2_CH3          :1;
					uint32_t SR_DMA2_CH4          :1;
					uint32_t SR_DMA2_CH5          :1;
					uint32_t                      :25;
					uint32_t SR_ADC               :1;
					uint32_t SR_COMP1             :1;
					uint32_t SR_COMP2             :1;
					uint32_t                      :29;
					uint32_t SR_TIM1_BRK          :1;
					uint32_t SR_TIM1_UPD          :1;
					uint32_t SR_TIM1_TRG          :1;
					uint32_t SR_TIM1_CCU          :1;
					uint32_t                      :28;
					uint32_t SR_TIM1_CC           :1;
					uint32_t                      :31;
					uint32_t SR_TIM2_GLB          :1;
					uint32_t                      :31;
					uint32_t SR_TIM3_GLB          :1;
					uint32_t                      :31;
					uint32_t SR_DAC               :1;
					uint32_t SR_TIM6_GLB          :1;
					uint32_t                      :30;
					uint32_t SR_TIM7_GLB          :1;
					uint32_t                      :31;
					uint32_t SR_TIM14_GLB         :1;
					uint32_t                      :31;
					uint32_t SR_TIM15_GLB         :1;
					uint32_t                      :31;
					uint32_t SR_TIM16_GLB         :1;
					uint32_t                      :31;
					uint32_t SR_TIM17_GLB         :1;
					uint32_t                      :31;
					uint32_t SR_I2C1_GLB          :1;
					uint32_t                      :31;
					uint32_t SR_I2C2_GLB          :1;
					uint32_t                      :31;
					uint32_t SR_SPI1              :1;
					uint32_t                      :31;
					uint32_t SR_SPI2              :1;
					uint32_t                      :31;
					uint32_t SR_USART1_GLB        :1;
					uint32_t                      :31;
					uint32_t SR_USART2_GLB        :1;
					uint32_t                      :31;
					uint32_t SR_USART3_GLB        :1;
					uint32_t SR_USART4_GLB        :1;
					uint32_t SR_USART5_GLB        :1;
					uint32_t SR_USART6_GLB        :1;
					uint32_t SR_USART7_GLB        :1;
					uint32_t SR_USART8_GLB        :1;
					uint32_t                      :26;
					uint32_t SR_CAN               :1;
					uint32_t SR_CEC               :1;
					uint32_t                      :32;
					uint32_t                      :30;
			
				
			};
			#endif
			
			#ifdef SYSCFG_MCHDLYCR
			struct MCHDLYCR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t BSCKSEL              :1;
					uint32_t MCHDLY1EN            :1;
					uint32_t DFSDM1D0SEL          :1;
					uint32_t DFSDM1D2SEL          :1;
					uint32_t DFSDM1CK02SEL        :1;
					uint32_t DFSDM1CK13SEL        :1;
					uint32_t DFSDM1CFG            :1;
					uint32_t DFSDM1CKOSEL         :1;
					uint32_t MCHDLY2EN            :1;
					uint32_t DFSDM2D0SEL          :1;
					uint32_t DFSDM2D2SEL          :1;
					uint32_t DFSDM2D4SEL          :1;
					uint32_t DFSDM2D6SEL          :1;
					uint32_t DFSDM2CK04SEL        :1;
					uint32_t DFSDM2CK15SEL        :1;
					uint32_t DFSDM2CK26SEL        :1;
					uint32_t DFSDM2CK37SEL        :1;
					uint32_t DFSDM2CFG            :1;
					uint32_t DFSDM2CKOSEL         :1;
					uint32_t                      :13;
			
				
			};
			#endif
			
			#ifdef SYSCFG_MEMRMP
			struct MEMRMP_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					#ifdef SYSCFG_MEMRMP_0
					struct
					{
						uint32_t SYSCFG_MEMRMP_0_MEM_MODE :2;
						uint32_t                      :6;
						uint32_t SYSCFG_MEMRMP_0_UFB_MODE :1;
						uint32_t                      :1;
						uint32_t SYSCFG_MEMRMP_0_SWP_FMC :2;
						uint32_t                      :20;
					};
					#endif
					#ifdef SYSCFG_MEMRMP_1
					struct
					{
						uint32_t SYSCFG_MEMRMP_1_MEM_MODE :3;
						uint32_t                      :5;
						uint32_t SYSCFG_MEMRMP_1_SWP_FB :1;
						uint32_t                      :23;
					};
					#endif
					#ifdef SYSCFG_MEMRMP_2
					struct
					{
						uint32_t SYSCFG_MEMRMP_2_MEM_BOOT :1;
						uint32_t                      :7;
						uint32_t SYSCFG_MEMRMP_2_BOOT_MODE :2;
						uint32_t                      :22;
					};
					#endif
					#ifdef SYSCFG_MEMRMP_3
					struct
					{
						uint32_t                      :8;
						uint32_t FB_MODE              :1;
						uint32_t                      :23;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef SYSCFG_PKGR
			struct PKGR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t PKG                  :4;
					uint32_t                      :28;
			
				
			};
			#endif
			
			#ifdef SYSCFG_PMC
			struct PMC_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					#ifdef SYSCFG_PMC_0
					struct
					{
						uint32_t SYSCFG_PMC_0_I2C1_FMP :1;
						uint32_t SYSCFG_PMC_0_I2C2_FMP :1;
						uint32_t SYSCFG_PMC_0_I2C3_FMP :1;
						uint32_t SYSCFG_PMC_0_I2C4_FMP :1;
						uint32_t SYSCFG_PMC_0_I2C_PB6_FMP :1;
						uint32_t SYSCFG_PMC_0_I2C_PB7_FMP :1;
						uint32_t SYSCFG_PMC_0_I2C_PB8_FMP :1;
						uint32_t SYSCFG_PMC_0_I2C_PB9_FMP :1;
						uint32_t                      :8;
						uint32_t SYSCFG_PMC_0_ADC1DC2 :1;
						uint32_t SYSCFG_PMC_0_ADC2DC2 :1;
						uint32_t SYSCFG_PMC_0_ADC3DC2 :1;
						uint32_t                      :4;
						uint32_t SYSCFG_PMC_0_MII_RMII_SEL :1;
						uint32_t                      :8;
					};
					#endif
					#ifdef SYSCFG_PMC_1
					struct
					{
						uint32_t SYSCFG_PMC_1_USB_PU  :1;
						uint32_t SYSCFG_PMC_1_LCD_CAPA :5;
						uint32_t                      :10;
						uint32_t SYSCFG_PMC_1_ADCxDC2 :3;
						uint32_t                      :13;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef SYSCFG_PMCR
			struct PMCR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t I2C1_FMP             :1;
					uint32_t I2C2_FMP             :1;
					uint32_t I2C3_FMP             :1;
					uint32_t I2C4_FMP             :1;
					uint32_t I2C_PB6_FMP          :1;
					uint32_t I2C_PB7_FMP          :1;
					uint32_t I2C_PB8_FMP          :1;
					uint32_t I2C_PB9_FMP          :1;
					uint32_t BOOSTEN              :1;
					uint32_t                      :12;
					uint32_t EPIS_SEL             :3;
					uint32_t PA0SO                :1;
					uint32_t PA1SO                :1;
					uint32_t PC2SO                :1;
					uint32_t PC3SO                :1;
					uint32_t                      :4;
			
				
			};
			#endif
			
			#ifdef SYSCFG_RCR
			struct RCR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t PAGE0                :1;
					uint32_t PAGE1                :1;
					uint32_t PAGE2                :1;
					uint32_t PAGE3                :1;
					uint32_t SYSCFG_RCR_PAGE4     :1;
					uint32_t SYSCFG_RCR_PAGE5     :1;
					uint32_t SYSCFG_RCR_PAGE6     :1;
					uint32_t SYSCFG_RCR_PAGE7     :1;
					uint32_t SYSCFG_RCR_PAGE8     :1;
					uint32_t SYSCFG_RCR_PAGE9     :1;
					uint32_t SYSCFG_RCR_PAGE10    :1;
					uint32_t SYSCFG_RCR_PAGE11    :1;
					uint32_t SYSCFG_RCR_PAGE12    :1;
					uint32_t SYSCFG_RCR_PAGE13    :1;
					uint32_t SYSCFG_RCR_PAGE14    :1;
					uint32_t SYSCFG_RCR_PAGE15    :1;
					uint32_t                      :16;
			
				
			};
			#endif
			
			#ifdef SYSCFG_SCSR
			struct SCSR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t SRAM2ER              :1;
					uint32_t SRAM2BSY             :1;
					uint32_t                      :30;
			
				
			};
			#endif
			
			#ifdef SYSCFG_SKR
			struct SKR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t KEY                  :8;
					uint32_t                      :24;
			
				
			};
			#endif
			
			#ifdef SYSCFG_SWPR
			struct SWPR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t PAGE0                :1;
					uint32_t PAGE1                :1;
					uint32_t PAGE2                :1;
					uint32_t PAGE3                :1;
					uint32_t PAGE4                :1;
					uint32_t PAGE5                :1;
					uint32_t PAGE6                :1;
					uint32_t PAGE7                :1;
					uint32_t PAGE8                :1;
					uint32_t PAGE9                :1;
					uint32_t PAGE10               :1;
					uint32_t PAGE11               :1;
					uint32_t PAGE12               :1;
					uint32_t PAGE13               :1;
					uint32_t PAGE14               :1;
					uint32_t PAGE15               :1;
					uint32_t SYSCFG_SWPR_PAGE16   :1;
					uint32_t SYSCFG_SWPR_PAGE17   :1;
					uint32_t SYSCFG_SWPR_PAGE18   :1;
					uint32_t SYSCFG_SWPR_PAGE19   :1;
					uint32_t SYSCFG_SWPR_PAGE20   :1;
					uint32_t SYSCFG_SWPR_PAGE21   :1;
					uint32_t SYSCFG_SWPR_PAGE22   :1;
					uint32_t SYSCFG_SWPR_PAGE23   :1;
					uint32_t SYSCFG_SWPR_PAGE24   :1;
					uint32_t SYSCFG_SWPR_PAGE25   :1;
					uint32_t SYSCFG_SWPR_PAGE26   :1;
					uint32_t SYSCFG_SWPR_PAGE27   :1;
					uint32_t SYSCFG_SWPR_PAGE28   :1;
					uint32_t SYSCFG_SWPR_PAGE29   :1;
					uint32_t SYSCFG_SWPR_PAGE30   :1;
					uint32_t SYSCFG_SWPR_PAGE31   :1;
			
				
			};
			#endif
			
			#ifdef SYSCFG_SWPR2
			struct SWPR2_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t PAGE32               :1;
					uint32_t PAGE33               :1;
					uint32_t PAGE34               :1;
					uint32_t PAGE35               :1;
					uint32_t PAGE36               :1;
					uint32_t PAGE37               :1;
					uint32_t PAGE38               :1;
					uint32_t PAGE39               :1;
					uint32_t PAGE40               :1;
					uint32_t PAGE41               :1;
					uint32_t PAGE42               :1;
					uint32_t PAGE43               :1;
					uint32_t PAGE44               :1;
					uint32_t PAGE45               :1;
					uint32_t PAGE46               :1;
					uint32_t PAGE47               :1;
					uint32_t PAGE48               :1;
					uint32_t PAGE49               :1;
					uint32_t PAGE50               :1;
					uint32_t PAGE51               :1;
					uint32_t PAGE52               :1;
					uint32_t PAGE53               :1;
					uint32_t PAGE54               :1;
					uint32_t PAGE55               :1;
					uint32_t PAGE56               :1;
					uint32_t PAGE57               :1;
					uint32_t PAGE58               :1;
					uint32_t PAGE59               :1;
					uint32_t PAGE60               :1;
					uint32_t PAGE61               :1;
					uint32_t PAGE62               :1;
					uint32_t PAGE63               :1;
			
				
			};
			#endif
			
			#ifdef SYSCFG_UR0
			struct UR0_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t BKS                  :1;
					uint32_t                      :15;
					uint32_t RDP                  :8;
					uint32_t                      :8;
			
				
			};
			#endif
			
			#ifdef SYSCFG_UR10
			struct UR10_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t PAEND_BANK2          :12;
					uint32_t                      :4;
					uint32_t SABEG_BANK2          :12;
					uint32_t                      :4;
			
				
			};
			#endif
			
			#ifdef SYSCFG_UR11
			struct UR11_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t SAEND_BANK2          :12;
					uint32_t                      :4;
					uint32_t IWDG1M               :1;
					uint32_t                      :15;
			
				
			};
			#endif
			
			#ifdef SYSCFG_UR12
			struct UR12_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t                      :16;
					uint32_t SECURE               :1;
					uint32_t                      :15;
			
				
			};
			#endif
			
			#ifdef SYSCFG_UR13
			struct UR13_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t SDRS                 :2;
					uint32_t                      :14;
					uint32_t D1SBRST              :1;
					uint32_t                      :15;
			
				
			};
			#endif
			
			#ifdef SYSCFG_UR14
			struct UR14_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t D1STPRST             :1;
					uint32_t                      :31;
			
				
			};
			#endif
			
			#ifdef SYSCFG_UR15
			struct UR15_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t                      :16;
					uint32_t FZIWDGSTB            :1;
					uint32_t                      :15;
			
				
			};
			#endif
			
			#ifdef SYSCFG_UR16
			struct UR16_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t FZIWDGSTP            :1;
					uint32_t                      :15;
					uint32_t PKP                  :1;
					uint32_t                      :15;
			
				
			};
			#endif
			
			#ifdef SYSCFG_UR17
			struct UR17_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t IOHSLV               :1;
					uint32_t                      :31;
			
				
			};
			#endif
			
			#ifdef SYSCFG_UR2
			struct UR2_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t BORH                 :2;
					uint32_t                      :14;
					uint32_t BOOT_ADD0            :16;
			
				
			};
			#endif
			
			#ifdef SYSCFG_UR3
			struct UR3_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t BOOT_ADD1            :16;
					uint32_t                      :16;
			
				
			};
			#endif
			
			#ifdef SYSCFG_UR4
			struct UR4_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t                      :16;
					uint32_t MEPAD_BANK1          :1;
					uint32_t                      :15;
			
				
			};
			#endif
			
			#ifdef SYSCFG_UR5
			struct UR5_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t MESAD_BANK1          :1;
					uint32_t                      :15;
					uint32_t WRPN_BANK1           :8;
					uint32_t                      :8;
			
				
			};
			#endif
			
			#ifdef SYSCFG_UR6
			struct UR6_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t PABEG_BANK1          :12;
					uint32_t                      :4;
					uint32_t PAEND_BANK1          :12;
					uint32_t                      :4;
			
				
			};
			#endif
			
			#ifdef SYSCFG_UR7
			struct UR7_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t SABEG_BANK1          :12;
					uint32_t                      :4;
					uint32_t SAEND_BANK1          :12;
					uint32_t                      :4;
			
				
			};
			#endif
			
			#ifdef SYSCFG_UR8
			struct UR8_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t MEPAD_BANK2          :1;
					uint32_t                      :15;
					uint32_t MESAD_BANK2          :1;
					uint32_t                      :15;
			
				
			};
			#endif
			
			#ifdef SYSCFG_UR9
			struct UR9_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t WRPN_BANK2           :8;
					uint32_t                      :8;
					uint32_t PABEG_BANK2          :12;
					uint32_t                      :4;
			
				
			};
			#endif
			
			union
			{
				
				struct
				{
					SYSCFG_MAP0_CFGR1;   // @0x000
					SYSCFG_MAP0_PMC;     // @0x004
					EXTICR_TypeDef EXTICR; // @0x008
					SYSCFG_MAP0_CFGR2;   // @0x018
					SYSCFG_MAP0_CBR;     // @0x01c
					SYSCFG_MAP0_CMPCR;   // @0x020
					SYSCFG_MAP0_CFGR;    // @0x024
					SYSCFG_MAP0_CCCR;    // @0x028
					__SOOL_PERIPH_PADDING_4;
					SYSCFG_MAP0_MCHDLYCR; // @0x030
					__SOOL_PERIPH_PADDING_16;
					__SOOL_PERIPH_PADDING_4;
					SYSCFG_MAP0_CFGR4;   // @0x048
					__SOOL_PERIPH_PADDING_4;
					SYSCFG_MAP0_CFGR3;   // @0x050
					__SOOL_PERIPH_PADDING_32;
					__SOOL_PERIPH_PADDING_8;
					__SOOL_PERIPH_PADDING_4;
					SYSCFG_MAP0_IT_LINE_SR; // @0x080
					__SOOL_PERIPH_PADDING_32;
					__SOOL_PERIPH_PADDING_4;
					SYSCFG_MAP0_PKGR;    // @0x124
					__SOOL_PERIPH_PADDING_256;
					__SOOL_PERIPH_PADDING_128;
					__SOOL_PERIPH_PADDING_64;
					__SOOL_PERIPH_PADDING_16;
					__SOOL_PERIPH_PADDING_8;
					SYSCFG_MAP0_UR0;     // @0x300
					SYSCFG_MAP0_UR1;     // @0x304
					SYSCFG_MAP0_UR2;     // @0x308
					SYSCFG_MAP0_UR3;     // @0x30c
					SYSCFG_MAP0_UR4;     // @0x310
					SYSCFG_MAP0_UR5;     // @0x314
					SYSCFG_MAP0_UR6;     // @0x318
					SYSCFG_MAP0_UR7;     // @0x31c
					SYSCFG_MAP0_UR8;     // @0x320
					SYSCFG_MAP0_UR9;     // @0x324
					SYSCFG_MAP0_UR10;    // @0x328
					SYSCFG_MAP0_UR11;    // @0x32c
					SYSCFG_MAP0_UR12;    // @0x330
					SYSCFG_MAP0_UR13;    // @0x334
					SYSCFG_MAP0_UR14;    // @0x338
					SYSCFG_MAP0_UR15;    // @0x33c
					SYSCFG_MAP0_UR16;    // @0x340
					SYSCFG_MAP0_UR17;    // @0x344
				};
				struct
				{
					SYSCFG_MAP1_MEMRMP;  // @0x000
					SYSCFG_MAP1_RCR;     // @0x004
					__SOOL_PERIPH_PADDING_16;
					SYSCFG_MAP1_SCSR;    // @0x018
					SYSCFG_MAP1_CFGR2;   // @0x01c
					SYSCFG_MAP1_CCCSR;   // @0x020
					SYSCFG_MAP1_CCVR;    // @0x024
					SYSCFG_MAP1_SWPR2;   // @0x028
					SYSCFG_MAP1_CFGR;    // @0x02c
					__SOOL_PERIPH_PADDING_512;
					__SOOL_PERIPH_PADDING_256;
					__SOOL_PERIPH_PADDING_16;
					__SOOL_PERIPH_PADDING_8;
				};
				struct
				{
					__SOOL_PERIPH_PADDING_4;
					SYSCFG_MAP2_PMCR;    // @0x004
					__SOOL_PERIPH_PADDING_16;
					__SOOL_PERIPH_PADDING_8;
					SYSCFG_MAP2_CFGR3;   // @0x020
					SYSCFG_MAP2_SKR;     // @0x024
					__SOOL_PERIPH_PADDING_512;
					__SOOL_PERIPH_PADDING_256;
					__SOOL_PERIPH_PADDING_32;
				};
				struct
				{
					__SOOL_PERIPH_PADDING_4;
					SYSCFG_MAP3_CFGR2;   // @0x004
					__SOOL_PERIPH_PADDING_16;
					__SOOL_PERIPH_PADDING_8;
					SYSCFG_MAP3_SWPR;    // @0x020
					__SOOL_PERIPH_PADDING_512;
					__SOOL_PERIPH_PADDING_256;
					__SOOL_PERIPH_PADDING_32;
					__SOOL_PERIPH_PADDING_4;
				};
				struct
				{
					__SOOL_PERIPH_PADDING_4;
					SYSCFG_MAP4_CFGR1;   // @0x004
					__SOOL_PERIPH_PADDING_512;
					__SOOL_PERIPH_PADDING_256;
					__SOOL_PERIPH_PADDING_64;
				};
			};
			private:
			SYSCFG() = delete;
			public:
				void enable_clock() volatile;
				void disable_clock() volatile;
				bool is_clock_enabled() const volatile;
			
			#if defined(STM32L0) || defined(STM32L4) || defined(STM32L4P)
				void enable_sleep_clock() const volatile;
				void disable_sleep_clock() volatile;
				bool is_sleep_clock_enabled() const volatile;
			#endif
			
			#if defined(STM32F2) || defined(STM32F4) || defined(STM32F7) || defined(STM32L1)
				void enable_low_power_clock() volatile;
				void disable_low_power_clock() volatile;
				bool is_low_power_clock_enabled() const volatile;
			#endif
			
		};
		
//endregion
//region instances
		#if defined(STM32F0     ) || defined(STM32F3     ) || defined(STM32L0     ) || defined(STM32L1     ) ||\
    defined(STM32L4     ) || defined(STM32L4P    ) 
