#ifndef __SOOL_TIM_H
#define __SOOL_TIM_H

#include "lib_utils/peripheral_include.h"
#include "RCC.h"


//region defines

#if defined(STM32F765xx ) || defined(STM32F767xx ) || defined(STM32F769xx ) || defined(STM32F777xx ) ||\
    defined(STM32F779xx ) || defined(STM32H7     ) 
#define TIM_AF1
#define TIM_AF2
#endif

#define TIM_ARR
#define TIM_CCER
#define TIM_CCMR1
#define TIM_CCMR2
#define TIM_CCR1
#define TIM_CCR2
#define TIM_CCR3
#define TIM_CCR4
#define TIM_CNT
#define TIM_CR1
#define TIM_CR2
#define TIM_DCR
#define TIM_DIER
#define TIM_DMAR
#define TIM_EGR
#define TIM_PSC
#define TIM_SMCR
#define TIM_SR

#if defined(STM32F0     ) || defined(STM32F1     ) || defined(STM32F2     ) || defined(STM32F3     ) ||\
    defined(STM32F4     ) || defined(STM32F7     ) || defined(STM32H7     ) || defined(STM32L1     ) ||\
    defined(STM32L4     ) || defined(STM32L4P    ) 
#define TIM_ARR_0
#define TIM_CNT_0
#define TIM_DIER_COMDE       COMDE                // 1 bits @ 13
#else
#define TIM_DIER_COMDE
#endif

#if defined(STM32L0     ) 
#define TIM_ARR_1
#define TIM_CNT_1_CNT        CNT                  // 16 bits @ 0
#define TIM2_OR_0_ETR_RMP    ETR_RMP              // 3 bits @ 0
#define TIM2_OR_0_TI4_RMP    TI4_RMP              // 2 bits @ 3
#define TIM21_OR_0_ETR_RMP   ETR_RMP              // 2 bits @ 0
#define TIM21_OR_0_TI1_RMP   TI1_RMP              // 3 bits @ 2
#define TIM21_OR_0_TI2_RMP   TI2_RMP              // 1 bits @ 5
#else
#define TIM_CNT_1_CNT

    defined(STM32L073xx ) || defined(STM32L081xx ) || defined(STM32L082xx ) || defined(STM32L083xx ) 
#define TIM3_OR_0
#endif

#if defined(STM32L071xx ) || defined(STM32L072xx ) || defined(STM32L073xx ) || defined(STM32L081xx ) ||\
    defined(STM32L082xx ) || defined(STM32L083xx ) 
#define TIM3_OR_0_ETR_RMP    ETR_RMP              // 2 bits @ 0
#define TIM3_OR_0_TI1_RMP    TI1_RMP              // 1 bits @ 2
#define TIM3_OR_0_TI2_RMP    TI2_RMP              // 1 bits @ 3
#define TIM3_OR_0_TI4_RMP    TI4_RMP              // 1 bits @ 4
#else
#define TIM3_OR_0_ETR_RMP
#define TIM3_OR_0_TI1_RMP
#define TIM3_OR_0_TI2_RMP
#define TIM3_OR_0_TI4_RMP
#endif

#if defined(STM32F2     ) || defined(STM32F4     ) || defined(STM32F7     ) || defined(STM32L0     ) 
#define TIM21_OR_0
#endif

#if defined(STM32F2     ) || defined(STM32F4     ) || defined(STM32F7     ) || defined(STM32L031xx ) ||\
    defined(STM32L041xx ) || defined(STM32L051xx ) || defined(STM32L052xx ) || defined(STM32L053xx ) ||\
    defined(STM32L061xx ) || defined(STM32L062xx ) || defined(STM32L063xx ) || defined(STM32L071xx ) ||\
    defined(STM32L072xx ) || defined(STM32L073xx ) || defined(STM32L081xx ) || defined(STM32L082xx ) ||\
    defined(STM32L083xx ) 
#define TIM22_OR_0
#endif

#if defined(STM32L031xx ) || defined(STM32L041xx ) || defined(STM32L051xx ) || defined(STM32L052xx ) ||\
    defined(STM32L053xx ) || defined(STM32L061xx ) || defined(STM32L062xx ) || defined(STM32L063xx ) ||\
    defined(STM32L071xx ) || defined(STM32L072xx ) || defined(STM32L073xx ) || defined(STM32L081xx ) ||\
    defined(STM32L082xx ) || defined(STM32L083xx ) 
#define TIM22_OR_0_ETR_RMP   ETR_RMP              // 2 bits @ 0
#define TIM22_OR_0_TI1_RMP   TI1_RMP              // 2 bits @ 2
#else
#define TIM22_OR_0_ETR_RMP
#define TIM22_OR_0_TI1_RMP
#endif

#if defined(STM32F2     ) || defined(STM32F4     ) || defined(STM32F7     ) || defined(STM32L100xC ) ||\
    defined(STM32L151xC ) || defined(STM32L151xCA) || defined(STM32L151xD ) || defined(STM32L151xDx) ||\
    defined(STM32L151xE ) || defined(STM32L152xC ) || defined(STM32L152xCA) || defined(STM32L152xD ) ||\
    defined(STM32L152xDx) || defined(STM32L152xE ) || defined(STM32L162xC ) || defined(STM32L162xCA) ||\
    defined(STM32L162xD ) || defined(STM32L162xDx) || defined(STM32L162xE ) 
#define TIM9_OR_0
#endif

#if defined(STM32F2     ) || defined(STM32F401xC ) || defined(STM32F401xE ) || defined(STM32F405xx ) ||\
    defined(STM32F407xx ) || defined(STM32F411xE ) || defined(STM32F412Cx ) || defined(STM32F412Rx ) ||\
    defined(STM32F412Vx ) || defined(STM32F412Zx ) || defined(STM32F413xx ) || defined(STM32F415xx ) ||\
    defined(STM32F417xx ) || defined(STM32F423xx ) || defined(STM32F427xx ) || defined(STM32F429xx ) ||\
    defined(STM32F437xx ) || defined(STM32F439xx ) || defined(STM32F446xx ) || defined(STM32F469xx ) ||\
    defined(STM32F479xx ) || defined(STM32F7     ) || defined(STM32L1     ) 
#define TIM9_OR_1
#endif

//endregion

namespace sool
{
	namespace core
	{struct TIM_base_plugin
		{
		
			#ifdef TIM_AF1
			struct AF1_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
			
				
			};
			#endif
			
			#ifdef TIM_AF2
			struct AF2_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
			
				
			};
			#endif
			
			#ifdef TIM_OR
			struct OR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					#ifdef TIM_OR_0
					struct
					{
						uint32_t TIM_OR_0_TI1_RMP     :2;
						uint32_t TIM_OR_0_ETR_RMP     :1;
						uint32_t                      :3;
						uint32_t TIM_OR_0_TI4_RMP     :2;
						uint32_t                      :2;
						uint32_t TIM_OR_0_ITR1_RMP    :2;
						uint32_t                      :20;
					};
					#endif
					#ifdef TIM_OR_1
					struct
					{
						uint32_t TI1RMP               :2;
						uint32_t                      :30;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef TIM_OR1
			struct OR1_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
			
				
			};
			#endif
			
			#ifdef TIM_OR2
			struct OR2_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
			
				
			};
			#endif
			
			#ifdef TIM_OR3
			struct OR3_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
			
				
			};
			#endif
			
			#ifdef TIM_TISEL
			struct TISEL_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
			
				
			};
			#endif
			};
		template<typename plugin=TIM_base_plugin>
		class TIM
		{
			
			
			public :
			
			#ifdef TIM_ARR
			struct ARR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					#ifdef TIM_ARR_0
					struct
					{
						uint32_t ARR                  :32;
					};
					#endif
					#ifdef TIM_ARR_1
					struct
					{
						uint32_t ARR                  :16;
						uint32_t                      :16;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef TIM_BDTR
			struct BDTR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t DTG                  :8;
					uint32_t LOCK                 :2;
					uint32_t OSSI                 :1;
					uint32_t OSSR                 :1;
					uint32_t BKE                  :1;
					uint32_t BKP                  :1;
					uint32_t AOE                  :1;
					uint32_t MOE                  :1;
					uint32_t TIM_BDTR_BKF         :4;
					uint32_t TIM_BDTR_BK2F        :4;
					uint32_t TIM_BDTR_BK2E        :1;
					uint32_t TIM_BDTR_BK2P        :1;
					uint32_t                      :6;
			
				
			};
			#endif
			
			#ifdef TIM_CCER
			struct CCER_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t CC1E                 :1;
					uint32_t CC1P                 :1;
					uint32_t TIM_CCER_CC1NE       :1;
					uint32_t CC1NP                :1;
					uint32_t CC2E                 :1;
					uint32_t CC2P                 :1;
					uint32_t TIM_CCER_CC2NE       :1;
					uint32_t CC2NP                :1;
					uint32_t CC3E                 :1;
					uint32_t CC3P                 :1;
					uint32_t TIM_CCER_CC3NE       :1;
					uint32_t CC3NP                :1;
					uint32_t CC4E                 :1;
					uint32_t CC4P                 :1;
					uint32_t                      :1;
					uint32_t TIM_CCER_CC4NP       :1;
					uint32_t TIM_CCER_CC5E        :1;
					uint32_t TIM_CCER_CC5P        :1;
					uint32_t                      :2;
					uint32_t TIM_CCER_CC6E        :1;
					uint32_t TIM_CCER_CC6P        :1;
					uint32_t                      :10;
			
				
			};
			#endif
			
			#ifdef TIM_CCMR1
			struct CCMR1_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					struct
					{
						uint32_t CC1S                 :2;
						uint32_t OC1FE                :1;
						uint32_t OC1PE                :1;
						uint32_t TIM_CCMR1_0_OC1M     :3;
						uint32_t OC1CE                :1;
						uint32_t CC2S                 :2;
						uint32_t OC2FE                :1;
						uint32_t OC2PE                :1;
						uint32_t TIM_CCMR1_0_OC2M     :3;
						uint32_t OC2CE                :1;
						uint32_t                      :16;
					};
					struct
					{
						uint32_t                      :2;
						uint32_t IC1PSC               :2;
						uint32_t IC1F                 :4;
						uint32_t                      :2;
						uint32_t IC2PSC               :2;
						uint32_t IC2F                 :4;
						uint32_t                      :16;
					};
				};
				
			};
			#endif
			
			#ifdef TIM_CCMR2
			struct CCMR2_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					struct
					{
						uint32_t CC3S                 :2;
						uint32_t OC3FE                :1;
						uint32_t OC3PE                :1;
						uint32_t TIM_CCMR2_0_OC3M     :3;
						uint32_t OC3CE                :1;
						uint32_t CC4S                 :2;
						uint32_t OC4FE                :1;
						uint32_t OC4PE                :1;
						uint32_t TIM_CCMR2_0_OC4M     :3;
						uint32_t OC4CE                :1;
						uint32_t                      :16;
					};
					struct
					{
						uint32_t                      :2;
						uint32_t IC3PSC               :2;
						uint32_t IC3F                 :4;
						uint32_t                      :2;
						uint32_t IC4PSC               :2;
						uint32_t IC4F                 :4;
						uint32_t                      :16;
					};
				};
				
			};
			#endif
			
			#ifdef TIM_CCMR3
			struct CCMR3_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					struct
					{
						uint32_t TIM_CCMR3_0_OC5M0    :1;
						uint32_t TIM_CCMR3_0_OC5M1    :1;
						uint32_t OC5FE                :1;
						uint32_t OC5PE                :1;
						uint32_t TIM_CCMR3_0_OC5M     :3;
						uint32_t OC5CE                :1;
						uint32_t                      :2;
						uint32_t OC6FE                :1;
						uint32_t OC6PE                :1;
						uint32_t TIM_CCMR3_0_OC5M3    :1;
						uint32_t                      :2;
						uint32_t OC6CE                :1;
						uint32_t                      :16;
					};
					#ifdef TIM_CCMR3_1
					struct
					{
						uint32_t OC6M0                :1;
						uint32_t OC6M1                :1;
						uint32_t OC5M2                :1;
						uint32_t                      :9;
						uint32_t OC6M3                :1;
						uint32_t                      :19;
					};
					#endif
					#ifdef TIM_CCMR3_2
					struct
					{
						uint32_t                      :2;
						uint32_t TIM_CCMR3_2_OC6M2    :1;
						uint32_t                      :9;
						uint32_t TIM_CCMR3_2_OC6M     :3;
						uint32_t                      :17;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef TIM_CCR1
			struct CCR1_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t CCR1                 :16;
					uint32_t                      :16;
			
				
			};
			#endif
			
			#ifdef TIM_CCR2
			struct CCR2_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t CCR2                 :16;
					uint32_t                      :16;
			
				
			};
			#endif
			
			#ifdef TIM_CCR3
			struct CCR3_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t CCR3                 :16;
					uint32_t                      :16;
			
				
			};
			#endif
			
			#ifdef TIM_CCR4
			struct CCR4_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t CCR4                 :16;
					uint32_t                      :16;
			
				
			};
			#endif
			
			#ifdef TIM_CCR5
			struct CCR5_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					struct
					{
						uint32_t CCR5                 :32;
					};
					struct
					{
						uint32_t                      :29;
						uint32_t GC5C1                :1;
						uint32_t GC5C2                :1;
						uint32_t GC5C3                :1;
					};
				};
				
			};
			#endif
			
			#ifdef TIM_CCR6
			struct CCR6_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t CCR6                 :16;
					uint32_t                      :16;
			
				
			};
			#endif
			
			#ifdef TIM_CNT
			struct CNT_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					#ifdef TIM_CNT_0
					struct
					{
						uint32_t CNT                  :32;
					};
					#endif
					#ifdef TIM_CNT_1
					struct
					{
						uint32_t TIM_CNT_1_CNT        :16;
						uint32_t                      :15;
						uint32_t TIM_CNT_1_UIFCPY     :1;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef TIM_CR1
			struct CR1_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t CEN                  :1;
					uint32_t UDIS                 :1;
					uint32_t URS                  :1;
					uint32_t OPM                  :1;
					uint32_t DIR                  :1;
					uint32_t CMS                  :2;
					uint32_t ARPE                 :1;
					uint32_t CKD                  :2;
					uint32_t                      :1;
					uint32_t TIM_CR1_UIFREMAP     :1;
					uint32_t                      :20;
			
				
			};
			#endif
			
			#ifdef TIM_CR2
			struct CR2_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					struct
					{
						uint32_t TIM_CR2_0_CCPC       :1;
						uint32_t                      :1;
						uint32_t TIM_CR2_0_CCUS       :1;
						uint32_t CCDS                 :1;
						uint32_t MMS                  :3;
						uint32_t TI1S                 :1;
						uint32_t TIM_CR2_0_OIS1       :1;
						uint32_t TIM_CR2_0_OIS1N      :1;
						uint32_t TIM_CR2_0_OIS2       :1;
						uint32_t TIM_CR2_0_OIS2N      :1;
						uint32_t TIM_CR2_0_OIS3       :1;
						uint32_t TIM_CR2_0_OIS3N      :1;
						uint32_t TIM_CR2_0_OIS4       :1;
						uint32_t                      :1;
						uint32_t TIM_CR2_0_OIS5       :1;
						uint32_t                      :1;
						uint32_t TIM_CR2_0_OIS6       :1;
						uint32_t                      :1;
						uint32_t TIM_CR2_0_MMS2       :4;
						uint32_t                      :8;
					};
					#ifdef TIM_CR2_1
					struct
					{
						uint32_t                      :17;
						uint32_t OIS6                 :1;
						uint32_t                      :14;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef TIM_DCR
			struct DCR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t DBA                  :5;
					uint32_t                      :3;
					uint32_t DBL                  :5;
					uint32_t                      :19;
			
				
			};
			#endif
			
			#ifdef TIM_DIER
			struct DIER_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t UIE                  :1;
					uint32_t CC1IE                :1;
					uint32_t CC2IE                :1;
					uint32_t CC3IE                :1;
					uint32_t CC4IE                :1;
					uint32_t TIM_DIER_COMIE       :1;
					uint32_t TIE                  :1;
					uint32_t TIM_DIER_BIE         :1;
					uint32_t UDE                  :1;
					uint32_t CC1DE                :1;
					uint32_t CC2DE                :1;
					uint32_t CC3DE                :1;
					uint32_t CC4DE                :1;
					uint32_t TIM_DIER_COMDE       :1;
					uint32_t TDE                  :1;
					uint32_t                      :17;
			
				
			};
			#endif
			
			#ifdef TIM_DMAR
			struct DMAR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t DMAB                 :16;
					uint32_t                      :16;
			
				
			};
			#endif
			
			#ifdef TIM_EGR
			struct EGR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t UG                   :1;
					uint32_t CC1G                 :1;
					uint32_t CC2G                 :1;
					uint32_t CC3G                 :1;
					uint32_t CC4G                 :1;
					uint32_t TIM_EGR_COMG         :1;
					uint32_t TG                   :1;
					uint32_t TIM_EGR_BG           :1;
					uint32_t TIM_EGR_B2G          :1;
					uint32_t                      :23;
			
				
			};
			#endif
			
			#ifdef TIM_PSC
			struct PSC_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t PSC                  :16;
					uint32_t                      :16;
			
				
			};
			#endif
			
			#ifdef TIM_RCR
			struct RCR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					#ifdef TIM_RCR_0
					struct
					{
						uint32_t REP                  :8;
						uint32_t                      :24;
					};
					#endif
					#ifdef TIM_RCR_1
					struct
					{
						uint32_t REP                  :16;
						uint32_t                      :16;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef TIM_SMCR
			struct SMCR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t TIM_SMCR_SMS         :3;
					uint32_t TIM_SMCR_OCCS        :1;
					uint32_t TIM_SMCR_TS          :3;
					uint32_t MSM                  :1;
					uint32_t ETF                  :4;
					uint32_t ETPS                 :2;
					uint32_t ECE                  :1;
					uint32_t ETP                  :1;
					uint32_t                      :16;
			
				
			};
			#endif
			
			#ifdef TIM_SR
			struct SR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t UIF                  :1;
					uint32_t CC1IF                :1;
					uint32_t CC2IF                :1;
					uint32_t CC3IF                :1;
					uint32_t CC4IF                :1;
					uint32_t TIM_SR_COMIF         :1;
					uint32_t TIF                  :1;
					uint32_t TIM_SR_BIF           :1;
					uint32_t TIM_SR_B2IF          :1;
					uint32_t CC1OF                :1;
					uint32_t CC2OF                :1;
					uint32_t CC3OF                :1;
					uint32_t CC4OF                :1;
					uint32_t TIM_SR_SBIF          :1;
					uint32_t                      :2;
					uint32_t TIM_SR_CC5IF         :1;
					uint32_t TIM_SR_CC6IF         :1;
					uint32_t                      :14;
			
				
			};
			#endif
			
			union
			{
				
				struct
				{
					CR1_TypeDef CR1;     // @0x000
					CR2_TypeDef CR2;     // @0x004
					SMCR_TypeDef SMCR;   // @0x008
					DIER_TypeDef DIER;   // @0x00c
					SR_TypeDef SR;       // @0x010
					EGR_TypeDef EGR;     // @0x014
					CCMR1_TypeDef CCMR1; // @0x018
					CCMR2_TypeDef CCMR2; // @0x01c
					CCER_TypeDef CCER;   // @0x020
					CNT_TypeDef CNT;     // @0x024
					PSC_TypeDef PSC;     // @0x028
					ARR_TypeDef ARR;     // @0x02c
					TIM_MAP0_RCR;        // @0x030
					CCR1_TypeDef CCR1;   // @0x034
					CCR2_TypeDef CCR2;   // @0x038
					CCR3_TypeDef CCR3;   // @0x03c
					CCR4_TypeDef CCR4;   // @0x040
					TIM_MAP0_BDTR;       // @0x044
					DCR_TypeDef DCR;     // @0x048
					DMAR_TypeDef DMAR;   // @0x04c
					TIM_MAP0_OR;         // @0x050
					TIM_MAP0_CCMR3;      // @0x054
					TIM_MAP0_CCR5;       // @0x058
					TIM_MAP0_CCR6;       // @0x05c
					TIM_MAP0_AF1;        // @0x060
					TIM_MAP0_AF2;        // @0x064
					__SOOL_PERIPH_PADDING_2;
				};
				struct
				{
					__SOOL_PERIPH_PADDING_64;
					__SOOL_PERIPH_PADDING_16;
					TIM_MAP1_OR1;        // @0x050
					__SOOL_PERIPH_PADDING_2;
					TIM_MAP1_CCR5;       // @0x056
					TIM_MAP1_CCR6;       // @0x05a
					TIM_MAP1_AF1;        // @0x05e
					TIM_MAP1_AF2;        // @0x062
					TIM_MAP1_TISEL;      // @0x066
				};
				struct
				{
					__SOOL_PERIPH_PADDING_64;
					__SOOL_PERIPH_PADDING_16;
					__SOOL_PERIPH_PADDING_2;
					TIM_MAP2_CCMR3;      // @0x052
					__SOOL_PERIPH_PADDING_8;
					__SOOL_PERIPH_PADDING_2;
					TIM_MAP2_OR2;        // @0x060
					TIM_MAP2_OR3;        // @0x064
					__SOOL_PERIPH_PADDING_2;
				};
			};
			private:
			TIM() = delete;
			private:
				static constexpr uint32_t get_clock_enable_bit(const uint32_t addr);
			
				static constexpr volatile Reg32_t &get_clock_enable_reg(const uint32_t addr);
			
			public:
				void enable_clock() volatile;
			
				void disable_clock() volatile;
			
				bool is_clock_enabled() const volatile;
			
		};
		
		//region instances
#if defined(STM32F0     ) || defined(STM32F1     ) || defined(STM32F2     ) || defined(STM32F302xC ) ||\
    defined(STM32F302xE ) || defined(STM32F303x8 ) || defined(STM32F303xC ) || defined(STM32F303xE ) ||\
    defined(STM32F328xx ) || defined(STM32F334x8 ) || defined(STM32F358xx ) || defined(STM32F373xC ) ||\
    defined(STM32F378xx ) || defined(STM32F398xx ) || defined(STM32F401xC ) || defined(STM32F401xE ) ||\
    defined(STM32F405xx ) || defined(STM32F407xx ) || defined(STM32F411xE ) || defined(STM32F412Cx ) ||\
