/**
 * Copyright (c) 2018-2019 FAUCHER Julien & FRANCE Loic
 * This file is part of SooL.
 *
 *  SooL is free software: you can redistribute it and/or modify
 *  it under the terms of the GNU Lesser General Public License
 *  as published by the Free Software Foundation, either version 3
 *  of the License, or (at your option) any later version.
 *
 *  SooL is distributed in the hope that it will be useful,
 *  but WITHOUT ANY WARRANTY; without even the implied warranty of
 *  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
 *  GNU Lesser General Public License for more details.
 *
 *  You should have received a copy of the GNU Lesser General Public License
 *  along with SooL. If not, see <https://www.gnu.org/licenses/>.
 */
#ifndef __SOOL_USART_H
#define __SOOL_USART_H

#include "lib_utils/peripheral_include.h"
#include "RCC.h"


//region defines

#define USART_BRR
#define USART_CR1
#define USART_CR2
#define USART_CR3
#define USART_GTPR

#if defined(STM32F0     ) || defined(STM32F3     ) || defined(STM32F7     ) || defined(STM32H7     ) ||\
    defined(STM32L0     ) || defined(STM32L1     ) || defined(STM32L4     ) || defined(STM32L4P    ) 
#define USART_BRR_0
#endif

#if defined(STM32F1     ) || defined(STM32F2     ) || defined(STM32F4     ) 
#define USART_BRR_1
#endif

#if defined(STM32F0     ) || defined(STM32F3     ) || defined(STM32F7     ) || defined(STM32H7     ) ||\
    defined(STM32L0     ) || defined(STM32L4     ) || defined(STM32L4P    ) 

#define USART_ICR_0_EOBCF    EOBCF                // 1 bits @ 12
#define USART_ISR_0_LBDF     LBDF                 // 1 bits @ 8
#define USART_ISR_0_EOBF     EOBF                 // 1 bits @ 12
#define USART_RQR_TXFRQ      TXFRQ                // 1 bits @ 4
#else
#define USART_CR3_0_SCARCNT
#define USART_ICR_0_LBDCF
#define USART_ICR_0_EOBCF
#define USART_ISR_0_LBDF
#define USART_ISR_0_EOBF
#define USART_RQR_TXFRQ
#endif

#if defined(STM32F722xx ) || defined(STM32F723xx ) || defined(STM32F732xx ) || defined(STM32F733xx ) ||\
    defined(STM32H7     ) || defined(STM32L011xx ) || defined(STM32L021xx ) || defined(STM32L431xx ) ||\
    defined(STM32L432xx ) || defined(STM32L433xx ) || defined(STM32L442xx ) || defined(STM32L443xx ) ||\
    defined(STM32L451xx ) || defined(STM32L452xx ) || defined(STM32L462xx ) || defined(STM32L496xx ) ||\
    defined(STM32L4A6xx ) || defined(STM32L4P    ) 
#define USART_CR3_0_TCBGTIE  TCBGTIE              // 1 bits @ 24
#define USART_ISR_0_TCBGT    TCBGT                // 1 bits @ 25
#else
#define USART_CR3_0_TCBGTIE
#define USART_ISR_0_TCBGT
#endif

#if defined(STM32L0     ) 
#define USART_CR3_1
#endif

#if defined(STM32F722xx ) || defined(STM32F723xx ) || defined(STM32F732xx ) || defined(STM32F733xx ) ||\
    defined(STM32L011xx ) || defined(STM32L021xx ) || defined(STM32L431xx ) || defined(STM32L432xx ) ||\
    defined(STM32L433xx ) || defined(STM32L442xx ) || defined(STM32L443xx ) || defined(STM32L451xx ) ||\
    defined(STM32L452xx ) || defined(STM32L462xx ) || defined(STM32L496xx ) || defined(STM32L4A6xx ) ||\
    defined(STM32L4P    ) 
#define USART_ICR_0_TCBGTCF  TCBGTCF              // 1 bits @ 7
#else
#define USART_ICR_0_TCBGTCF
#endif

#if defined(STM32H7     ) || defined(STM32L4     ) || defined(STM32L4P    ) 
#define USART_ICR_1
#endif

#if defined(STM32L4     ) || defined(STM32L4P    ) 
#define USART_ICR_1_NECF     NECF                 // 1 bits @ 2
#else
#define USART_ICR_1_NECF
#endif

#if defined(STM32H7     ) 
#define USART_ICR_1_TCBGT    TCBGT                // 1 bits @ 7
#else
#define USART_ICR_1_TCBGT
#endif

#if defined(STM32F0     ) || defined(STM32F3     ) || defined(STM32F7     ) || defined(STM32H7     ) ||\
    defined(STM32L0     ) || defined(STM32L4     ) 
#define USART_ISR_0_RXNE     RXNE                 // 1 bits @ 5
#define USART_ISR_0_TXE      TXE                  // 1 bits @ 7
#else
#define USART_ISR_0_RXNE
#define USART_ISR_0_TXE
#endif

#if defined(STM32F0     ) || defined(STM32F3     ) || defined(STM32H7     ) || defined(STM32L0     ) ||\
    defined(STM32L4     ) || defined(STM32L4P    ) 
#define USART_ISR_0_REACK    REACK                // 1 bits @ 22
#else
#define USART_ISR_0_REACK
#endif

#if defined(STM32F745xx ) || defined(STM32F746xx ) || defined(STM32F756xx ) 
#define USART_ISR_1
#endif

#if defined(STM32L4P    ) 
#define USART_VERR
#define USART_MAP0_VERR      VERR_TypeDef VERR
#else
#define USART_MAP0_VERR __SOOL_PERIPH_PADDING_4
#endif

//endregion

namespace sool
{
	namespace core
	{
		class USART
		{
			
			
			public :
			
			#ifdef USART_BRR
			struct BRR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					#ifdef USART_BRR_0
					struct
					{
						uint32_t DIV_FRACTION         :4;
						uint32_t DIV_MANTISSA         :12;
						uint32_t                      :16;
					};
					#endif
					#ifdef USART_BRR_1
					struct
					{
						uint32_t DIV_Fraction         :4;
						uint32_t DIV_Mantissa         :12;
						uint32_t                      :16;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef USART_CR1
			struct CR1_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					struct
					{
						uint32_t USART_CR1_0_UE       :1;
						uint32_t USART_CR1_0_UESM     :1;
						uint32_t RE                   :1;
						uint32_t TE                   :1;
						uint32_t IDLEIE               :1;
						uint32_t USART_CR1_0_RXNEIE   :1;
						uint32_t TCIE                 :1;
						uint32_t USART_CR1_0_TXEIE    :1;
						uint32_t PEIE                 :1;
						uint32_t PS                   :1;
						uint32_t PCE                  :1;
						uint32_t WAKE                 :1;
						uint32_t USART_CR1_0_M        :1;
						uint32_t USART_CR1_0_MME      :1;
						uint32_t USART_CR1_0_CMIE     :1;
						uint32_t USART_CR1_0_OVER8    :1;
						uint32_t USART_CR1_0_DEDT     :5;
						uint32_t USART_CR1_0_DEAT     :5;
						uint32_t USART_CR1_0_RTOIE    :1;
						uint32_t USART_CR1_0_EOBIE    :1;
						uint32_t USART_CR1_0_M1       :1;
						uint32_t USART_CR1_0_FIFOEN   :1;
						uint32_t USART_CR1_0_TXFEIE   :1;
						uint32_t USART_CR1_0_RXFFIE   :1;
					};
					#ifdef USART_CR1_1
					struct
					{
						uint32_t USART_CR1_1_SBK      :1;
						uint32_t USART_CR1_1_RWU      :1;
						uint32_t                      :10;
						uint32_t M0                   :1;
						uint32_t USART_CR1_1_UE       :1;
						uint32_t                      :18;
					};
					#endif
					#ifdef USART_CR1_2
					struct
					{
						uint32_t M0                   :1;
						uint32_t                      :31;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef USART_CR2
			struct CR2_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					struct
					{
						uint32_t USART_CR2_0_SLVEN    :1;
						uint32_t                      :2;
						uint32_t USART_CR2_0_DIS_NSS  :1;
						uint32_t USART_CR2_0_ADDM7    :1;
						uint32_t USART_CR2_0_LBDL     :1;
						uint32_t USART_CR2_0_LBDIE    :1;
						uint32_t                      :1;
						uint32_t LBCL                 :1;
						uint32_t CPHA                 :1;
						uint32_t CPOL                 :1;
						uint32_t CLKEN                :1;
						uint32_t STOP                 :2;
						uint32_t USART_CR2_0_LINEN    :1;
						uint32_t USART_CR2_0_SWAP     :1;
						uint32_t USART_CR2_0_RXINV    :1;
						uint32_t USART_CR2_0_TXINV    :1;
						uint32_t USART_CR2_0_DATAINV  :1;
						uint32_t USART_CR2_0_MSBFIRST :1;
						uint32_t USART_CR2_0_ABREN    :1;
						uint32_t USART_CR2_0_ABRMODE  :2;
						uint32_t USART_CR2_0_RTOEN    :1;
						uint32_t USART_CR2_0_ADD      :8;
					};
					#ifdef USART_CR2_1
					struct
					{
						uint32_t ADD                  :4;
						uint32_t                      :28;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef USART_CR3
			struct CR3_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					struct
					{
						uint32_t EIE                  :1;
						uint32_t USART_CR3_0_IREN     :1;
						uint32_t USART_CR3_0_IRLP     :1;
						uint32_t HDSEL                :1;
						uint32_t USART_CR3_0_NACK     :1;
						uint32_t USART_CR3_0_SCEN     :1;
						uint32_t DMAR                 :1;
						uint32_t DMAT                 :1;
						uint32_t RTSE                 :1;
						uint32_t CTSE                 :1;
						uint32_t CTSIE                :1;
						uint32_t USART_CR3_0_ONEBIT   :1;
						uint32_t USART_CR3_0_OVRDIS   :1;
						uint32_t USART_CR3_0_DDRE     :1;
						uint32_t USART_CR3_0_DEM      :1;
						uint32_t USART_CR3_0_DEP      :1;
						uint32_t                      :1;
						uint32_t USART_CR3_0_SCARCNT  :3;
						uint32_t USART_CR3_0_WUS      :2;
						uint32_t USART_CR3_0_WUFIE    :1;
						uint32_t USART_CR3_0_TXFTIE   :1;
						uint32_t USART_CR3_0_TCBGTIE  :1;
						uint32_t USART_CR3_0_RXFTCFG  :3;
						uint32_t USART_CR3_0_RXFTIE   :1;
						uint32_t USART_CR3_0_TXFTCFG  :3;
					};
					#ifdef USART_CR3_1
					struct
					{
						uint32_t                      :23;
						uint32_t UCESM                :1;
						uint32_t                      :8;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef USART_DR
			struct DR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t DR                   :9;
					uint32_t                      :23;
			
				
			};
			#endif
			
			#ifdef USART_GTPR
			struct GTPR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t PSC                  :8;
					uint32_t GT                   :8;
					uint32_t                      :16;
			
				
			};
			#endif
			
			#ifdef USART_ICR
			struct ICR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					struct
					{
						uint32_t PECF                 :1;
						uint32_t FECF                 :1;
						uint32_t NCF                  :1;
						uint32_t ORECF                :1;
						uint32_t IDLECF               :1;
						uint32_t USART_ICR_0_TXFECF   :1;
						uint32_t TCCF                 :1;
						uint32_t USART_ICR_0_TCBGTCF  :1;
						uint32_t USART_ICR_0_LBDCF    :1;
						uint32_t CTSCF                :1;
						uint32_t                      :1;
						uint32_t RTOCF                :1;
						uint32_t USART_ICR_0_EOBCF    :1;
						uint32_t USART_ICR_0_UDRCF    :1;
						uint32_t                      :3;
						uint32_t CMCF                 :1;
						uint32_t                      :2;
						uint32_t USART_ICR_0_WUCF     :1;
						uint32_t                      :11;
					};
					#ifdef USART_ICR_1
					struct
					{
						uint32_t                      :2;
						uint32_t USART_ICR_1_NECF     :1;
						uint32_t                      :4;
						uint32_t USART_ICR_1_TCBGT    :1;
						uint32_t                      :24;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef USART_ISR
			struct ISR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
			
				union
				{
					struct
					{
						uint32_t PE                   :1;
						uint32_t FE                   :1;
						uint32_t NE                   :1;
						uint32_t ORE                  :1;
						uint32_t IDLE                 :1;
						uint32_t USART_ISR_0_RXNE     :1;
						uint32_t TC                   :1;
						uint32_t USART_ISR_0_TXE      :1;
						uint32_t USART_ISR_0_LBDF     :1;
						uint32_t CTSIF                :1;
						uint32_t CTS                  :1;
						uint32_t RTOF                 :1;
						uint32_t USART_ISR_0_EOBF     :1;
						uint32_t USART_ISR_0_UDR      :1;
						uint32_t ABRE                 :1;
						uint32_t ABRF                 :1;
						uint32_t BUSY                 :1;
						uint32_t CMF                  :1;
						uint32_t SBKF                 :1;
						uint32_t RWU                  :1;
						uint32_t USART_ISR_0_WUF      :1;
						uint32_t TEACK                :1;
						uint32_t USART_ISR_0_REACK    :1;
						uint32_t USART_ISR_0_TXFE     :1;
						uint32_t USART_ISR_0_RXFF     :1;
						uint32_t USART_ISR_0_TCBGT    :1;
						uint32_t USART_ISR_0_RXFT     :1;
						uint32_t USART_ISR_0_TXFT     :1;
						uint32_t                      :4;
					};
					#ifdef USART_ISR_1
					struct
					{
						uint32_t                      :8;
						uint32_t LBD                  :1;
						uint32_t                      :23;
					};
					#endif
				};
				
			};
			#endif
			
			#ifdef USART_PRESC
			struct PRESC_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t PRESCALER            :4;
					uint32_t                      :28;
			
				
			};
			#endif
			
			#ifdef USART_RDR
			struct RDR_TypeDef : public Reg16_t
			{
				using Reg16_t::operator=;
				
					uint32_t RDR                  :9;
					uint32_t                      :23;
			
				
			};
			#endif
			
			#ifdef USART_RQR
			struct RQR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t ABRRQ                :1;
					uint32_t SBKRQ                :1;
					uint32_t MMRQ                 :1;
					uint32_t RXFRQ                :1;
					uint32_t USART_RQR_TXFRQ      :1;
					uint32_t                      :27;
			
				
			};
			#endif
			
			#ifdef USART_RTOR
			struct RTOR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t RTO                  :24;
					uint32_t BLEN                 :8;
			
				
			};
			#endif
			
			#ifdef USART_SR
			struct SR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t PE                   :1;
					uint32_t FE                   :1;
					uint32_t NE                   :1;
					uint32_t ORE                  :1;
					uint32_t IDLE                 :1;
					uint32_t RXNE                 :1;
					uint32_t TC                   :1;
					uint32_t TXE                  :1;
					uint32_t LBD                  :1;
					uint32_t CTS                  :1;
					uint32_t                      :22;
			
				
			};
			#endif
			
			#ifdef USART_TDR
			struct TDR_TypeDef : public Reg16_t
			{
				using Reg16_t::operator=;
				
					uint32_t TDR                  :9;
					uint32_t                      :23;
			
				
			};
			#endif
			
			#ifdef USART_VERR
			struct VERR_TypeDef : public Reg32_t
			{
				using Reg32_t::operator=;
				
					uint32_t MINREV               :4;
					uint32_t MAJREV               :4;
					uint32_t                      :24;
			
				
			};
			#endif
			
			union
			{
				
				struct
				{
					USART_MAP0_CR1;      // @0x000
					USART_MAP0_CR2;      // @0x004
					USART_MAP0_CR3;      // @0x008
					USART_MAP0_BRR;      // @0x00c
					USART_MAP0_GTPR;     // @0x010
					USART_MAP0_RTOR;     // @0x014
					USART_MAP0_RQR;      // @0x018
					USART_MAP0_ISR;      // @0x01c
					USART_MAP0_ICR;      // @0x020
					USART_MAP0_RDR;      // @0x024
					USART_MAP0_TDR;      // @0x028
					USART_MAP0_PRESC;    // @0x02c
					__SOOL_PERIPH_PADDING_512;
					__SOOL_PERIPH_PADDING_256;
					__SOOL_PERIPH_PADDING_128;
					__SOOL_PERIPH_PADDING_64;
					__SOOL_PERIPH_PADDING_4;
					USART_MAP0_VERR;     // @0x3f4
				};
				struct
				{
					USART_MAP1_SR;       // @0x000
					USART_MAP1_DR;       // @0x004
					USART_MAP1_BRR;      // @0x008
					USART_MAP1_CR1;      // @0x00c
					USART_MAP1_CR2;      // @0x010
					USART_MAP1_CR3;      // @0x014
					USART_MAP1_GTPR;     // @0x018
					__SOOL_PERIPH_PADDING_512;
					__SOOL_PERIPH_PADDING_256;
					__SOOL_PERIPH_PADDING_128;
					__SOOL_PERIPH_PADDING_64;
					__SOOL_PERIPH_PADDING_16;
					__SOOL_PERIPH_PADDING_8;
					__SOOL_PERIPH_PADDING_4;
				};
			};
			private:
			USART() = delete;
			private:
				static constexpr uint32_t get_clock_enable_bit(const uint32_t addr);
			
				static constexpr volatile Reg32_t& get_clock_enable_reg(const uint32_t addr);
			
			public:
				void enable_clock() volatile;
			
				void disable_clock() volatile;
			
				bool is_clock_enabled() const volatile;
			
				void init();
			
				const bool is_rx_not_empty() const;
			
				const bool is_tx_empty() const;
			
				const bool tx_sent() const;
			
				USART& operator<<(const uint8_t value);
			
				USART& operator<<(const uint16_t value);
			
				USART& operator>>(uint8_t &variable);
			
				USART& operator>>(uint16_t &variable);
			
		};
		
		//region instances
